theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual ADC_CLP0 bitfields
 */

/*!
 * @name Register ADC_CLP0, field CLP0[5:0] (RW)
 *
 * Calibration Value
 */
/*@{*/
#define BP_ADC_CLP0_CLP0     (0U)          /*!< Bit position for ADC_CLP0_CLP0. */
#define BM_ADC_CLP0_CLP0     (0x0000003FU) /*!< Bit mask for ADC_CLP0_CLP0. */
#define BS_ADC_CLP0_CLP0     (6U)          /*!< Bit field size in bits for ADC_CLP0_CLP0. */

/*! @brief Read current value of the ADC_CLP0_CLP0 field. */
#define BR_ADC_CLP0_CLP0(x)  (HW_ADC_CLP0(x).B.CLP0)

/*! @brief Format value for bitfield ADC_CLP0_CLP0. */
#define BF_ADC_CLP0_CLP0(v)  ((uint32_t)((uint32_t)(v) << BP_ADC_CLP0_CLP0) & BM_ADC_CLP0_CLP0)

/*! @brief Set the CLP0 field to a new value. */
#define BW_ADC_CLP0_CLP0(x, v) (HW_ADC_CLP0_WR(x, (HW_ADC_CLP0_RD(x) & ~BM_ADC_CLP0_CLP0) | BF_ADC_CLP0_CLP0(v)))
/*@}*/

/*******************************************************************************
 * HW_ADC_PGA - ADC PGA Register
 ******************************************************************************/

/*!
 * @brief HW_ADC_PGA - ADC PGA Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_adc_pga
{
    uint32_t U;
    struct _hw_adc_pga_bitfields
    {
        uint32_t RESERVED0 : 16;       /*!< [15:0]  */
        uint32_t PGAG : 4;             /*!< [19:16] PGA Gain Setting */
        uint32_t PGALPb : 1;           /*!< [20] PGA Low-Power Mode Control */
        uint32_t RESERVED1 : 2;        /*!< [22:21]  */
        uint32_t PGAEN : 1;            /*!< [23] PGA Enable */
        uint32_t RESERVED2 : 8;        /*!< [31:24]  */
    } B;
} hw_adc_pga_t;

/*!
 * @name Constants and macros for entire ADC_PGA register
 */
/*@{*/
#define HW_ADC_PGA_ADDR(x)       ((uint32_t)(x) + 0x50U)

#define HW_ADC_PGA(x)            (*(__IO hw_adc_pga_t *) HW_ADC_PGA_ADDR(x))
#define HW_ADC_PGA_RD(x)         (HW_ADC_PGA(x).U)
#define HW_ADC_PGA_WR(x, v)      (HW_ADC_PGA(x).U = (v))
#define HW_ADC_PGA_SET(x, v)     (HW_ADC_PGA_WR(x, HW_ADC_PGA_RD(x) |  (v)))
#define HW_ADC_PGA_CLR(x, v)     (HW_ADC_PGA_WR(x, HW_ADC_PGA_RD(x) & ~(v)))
#define HW_ADC_PGA_TOG(x, v)     (HW_ADC_PGA_WR(x, HW_ADC_PGA_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ADC_PGA bitfields
 */

/*!
 * @name Register ADC_PGA, field PGAG[19:16] (RW)
 *
 * PGA gain = 2^(PGAG)
 *
 * Values:
 * - 0000 - 1
 * - 0001 - 2
 * - 0010 - 4
 * - 0011 - 8
 * - 0100 - 16
 * - 0101 - 32
 * - 0110 - 64
 * - 0111 - Reserved
 * - 1000 - Reserved
 * - 1001 - Reserved
 * - 1010 - Reserved
 * - 1011 - Reserved
 * - 1100 - Reserved
 * - 1101 - Reserved
 * - 1110 - Reserved
 * - 1111 - Reserved
 */
/*@{*/
#define BP_ADC_PGA_PGAG      (16U)         /*!< Bit position for ADC_PGA_PGAG. */
#define BM_ADC_PGA_PGAG      (0x000F0000U) /*!< Bit mask for ADC_PGA_PGAG. */
#define BS_ADC_PGA_PGAG      (4U)          /*!< Bit field size in bits for ADC_PGA_PGAG. */

/*! @brief Read current value of the ADC_PGA_PGAG field. */
#define BR_ADC_PGA_PGAG(x)   (HW_ADC_PGA(x).B.PGAG)

/*! @brief Format value for bitfield ADC_PGA_PGAG. */
#define BF_ADC_PGA_PGAG(v)   ((uint32_t)((uint32_t)(v) << BP_ADC_PGA_PGAG) & BM_ADC_PGA_PGAG)

/*! @brief Set the PGAG field to a new value. */
#define BW_ADC_PGA_PGAG(x, v) (HW_ADC_PGA_WR(x, (HW_ADC_PGA_RD(x) & ~BM_ADC_PGA_PGAG) | BF_ADC_PGA_PGAG(v)))
/*@}*/

/*!
 * @name Register ADC_PGA, field PGALPb[20] (RW)
 *
 * Values:
 * - 0 - PGA runs in Low-Power mode.
 * - 1 - PGA runs in Normal Power mode.
 */
/*@{*/
#define BP_ADC_PGA_PGALPb    (20U)         /*!< Bit position for ADC_PGA_PGALPb. */
#define BM_ADC_PGA_PGALPb    (0x00100000U) /*!< Bit mask for ADC_PGA_PGALPb. */
#define BS_ADC_PGA_PGALPb    (1U)          /*!< Bit field size in bits for ADC_PGA_PGALPb. */

/*! @brief Read current value of the ADC_PGA_PGALPb field. */
#define BR_ADC_PGA_PGALPb(x) (BITBAND_ACCESS32(HW_ADC_PGA_ADDR(x), BP_ADC_PGA_PGALPb))

/*! @brief Format value for bitfield ADC_PGA_PGALPb. */
#define BF_ADC_PGA_PGALPb(v) ((uint32_t)((uint32_t)(v) << BP_ADC_PGA_PGALPb) & BM_ADC_PGA_PGALPb)

/*! @brief Set the PGALPb field to a new value. */
#define BW_ADC_PGA_PGALPb(x, v) (BITBAND_ACCESS32(HW_ADC_PGA_ADDR(x), BP_ADC_PGA_PGALPb) = (v))
/*@}*/

/*!
 * @name Register ADC_PGA, field PGAEN[23] (RW)
 *
 * Values:
 * - 0 - PGA disabled.
 * - 1 - PGA enabled.
 */
/*@{*/
#define BP_ADC_PGA_PGAEN     (23U)         /*!< Bit position for ADC_PGA_PGAEN. */
#define BM_ADC_PGA_PGAEN     (0x00800000U) /*!< Bit mask for ADC_PGA_PGAEN. */
#define BS_ADC_PGA_PGAEN     (1U)          /*!< Bit field size in bits for ADC_PGA_PGAEN. */

/*! @brief Read current value of the ADC_PGA_PGAEN field. */
#define BR_ADC_PGA_PGAEN(x)  (BITBAND_ACCESS32(HW_ADC_PGA_ADDR(x), BP_ADC_PGA_PGAEN))

/*! @brief Format value for bitfield ADC_PGA_PGAEN. */
#define BF_ADC_PGA_PGAEN(v)  ((uint32_t)((uint32_t)(v) << BP_ADC_PGA_PGAEN) & BM_ADC_PGA_PGAEN)

/*! @brief Set the PGAEN field to a new value. */
#define BW_ADC_PGA_PGAEN(x, v) (BITBAND_ACCESS32(HW_ADC_PGA_ADDR(x), BP_ADC_PGA_PGAEN) = (v))
/*@}*/

/*******************************************************************************
 * HW_ADC_CLMD - ADC Minus-Side General Calibration Value Register
 ******************************************************************************/

/*!
 * @brief HW_ADC_CLMD - ADC Minus-Side General Calibration Value Register (RW)
 *
 * Reset value: 0x0000000AU
 *
 * The Minus-Side General Calibration Value (CLMx) registers contain calibration
 * information that is generated by the calibration function. These registers
 * contain seven calibration values of varying widths: CLM0[5:0], CLM1[6:0],
 * CLM2[7:0], CLM3[8:0], CLM4[9:0], CLMS[5:0], and CLMD[5:0]. CLMx are automatically
 * set when the self-calibration sequence is done, that is, CAL is cleared. If
 * these registers are written by the user after calibration, the linearity error
 * specifications may not be met.
 */
typedef union _hw_adc_clmd
{
    uint32_t U;
    struct _hw_adc_clmd_bitfields
    {
        uint32_t CLMD : 6;             /*!< [5:0]  */
        uint32_t RESERVED0 : 26;       /*!< [31:6]  */
    } B;
} hw_adc_clmd_t;

/*!
 * @name Constants and macros for entire ADC_CLMD register
 */
/*@{*/
#define HW_ADC_CLMD_ADDR(x)      ((uint32_t)(x) + 0x54U)

#define HW_ADC_CLMD(x)           (*(__IO hw_adc_clmd_t *) HW_ADC_CLMD_ADDR(x))
#define HW_ADC_CLMD_RD(x)        (HW_ADC_CLMD(x).U)
#define HW_ADC_CLMD_WR(x, v)     (HW_ADC_CLMD(x).U = (v))
#define HW_ADC_CLMD_SET(x, v)    (HW_ADC_CLMD_WR(x, HW_ADC_CLMD_RD(x) |  (v)))
#define HW_ADC_CLMD_CLR(x, v)    (HW_ADC_CLMD_WR(x, HW_ADC_CLMD_RD(x) & ~(v)))
#define HW_ADC_CLMD_TOG(x, v)    (HW_ADC_CLMD_WR(x, HW_ADC_CLMD_RD(x) ^  (v)))
/*@}*/

