theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*******************************************************************************
 * HW_AIPS_PACRB - Peripheral Access Control Register
 ******************************************************************************/

/*!
 * @brief HW_AIPS_PACRB - Peripheral Access Control Register (RW)
 *
 * Reset value: 0x44444444U
 *
 * Each of the peripherals has a 4-bit PACR[0: 127 ] field which defines the
 * access levels supported by the given module. Eight PACR fields are grouped
 * together to form a 32-bit PACR[A: P ] register: PACRA- P define the access levels
 * for the 128 peripherals The peripheral assignments to each PACR are defined by
 * the memory map slot that the peripherals are assigned. See the device's memory
 * map details for the assignments for a particular device. The reset value of
 * PACR[A:D] is 0x4444_4444. The following table shows the top-level structure of
 * PACRs. Offset Register [31:28] [27:24] [23:20] [19:16] [15:12] [11:8] [7:4]
 * [3:0] 0x20 PACRA PACR0 PACR1 PACR2 PACR3 PACR4 PACR5 PACR6 PACR7 0x24 PACRB PACR8
 * PACR9 PACR10 PACR11 PACR12 PACR13 PACR14 PACR15 0x28 PACRC PACR16 PACR17
 * PACR18 PACR19 PACR20 PACR21 PACR22 PACR23 0x2C PACRD PACR24 PACR25 PACR26 PACR27
 * PACR28 PACR29 PACR30 PACR31 0x30 Reserved 0x34 Reserved 0x38 Reserved 0x3C
 * Reserved 0x40 PACRE PACR32 PACR33 PACR34 PACR35 PACR36 PACR37 PACR38 PACR39 0x44
 * PACRF PACR40 PACR41 PACR42 PACR43 PACR44 PACR45 PACR46 PACR47 0x48 PACRG PACR48
 * PACR49 PACR50 PACR51 PACR52 PACR53 PACR54 PACR55 0x4C PACRH PACR56 PACR57
 * PACR58 PACR59 PACR60 PACR61 PACR62 PACR63 0x50 PACRI PACR64 PACR65 PACR66 PACR67
 * PACR68 PACR69 PACR70 PACR71 0x54 PACRJ PACR72 PACR73 PACR74 PACR75 PACR76
 * PACR77 PACR78 PACR79 0x58 PACRK PACR80 PACR81 PACR82 PACR83 PACR84 PACR85 PACR86
 * PACR87 0x5C PACRL PACR88 PACR89 PACR90 PACR91 PACR92 PACR93 PACR94 PACR95 0x60
 * PACRM PACR96 PACR97 PACR98 PACR99 PACR100 PACR101 PACR102 PACR103 0x64 PACRN
 * PACR104 PACR105 PACR106 PACR107 PACR108 PACR109 PACR110 PACR111 0x68 PACRO
 * PACR112 PACR113 PACR114 PACR115 PACR116 PACR117 PACR118 PACR119 0x6C PACRP PACR120
 * PACR121 PACR122 PACR123 PACR124 PACR125 PACR126 PACR127
 */
typedef union _hw_aips_pacrb
{
    uint32_t U;
    struct _hw_aips_pacrb_bitfields
    {
        uint32_t TP7 : 1;              /*!< [0] Trusted Protect */
        uint32_t WP7 : 1;              /*!< [1] Write Protect */
        uint32_t SP7 : 1;              /*!< [2] Supervisor Protect */
        uint32_t RESERVED0 : 1;        /*!< [3]  */
        uint32_t TP6 : 1;              /*!< [4] Trusted Protect */
        uint32_t WP6 : 1;              /*!< [5] Write Protect */
        uint32_t SP6 : 1;              /*!< [6] Supervisor Protect */
        uint32_t RESERVED1 : 1;        /*!< [7]  */
        uint32_t TP5 : 1;              /*!< [8] Trusted Protect */
        uint32_t WP5 : 1;              /*!< [9] Write Protect */
        uint32_t SP5 : 1;              /*!< [10] Supervisor Protect */
        uint32_t RESERVED2 : 1;        /*!< [11]  */
        uint32_t TP4 : 1;              /*!< [12] Trusted protect */
        uint32_t WP4 : 1;              /*!< [13] Write protect */
        uint32_t SP4 : 1;              /*!< [14] Supervisor Protect */
        uint32_t RESERVED3 : 1;        /*!< [15]  */
        uint32_t TP3 : 1;              /*!< [16] Trusted protect */
        uint32_t WP3 : 1;              /*!< [17] Write Protect */
        uint32_t SP3 : 1;              /*!< [18] Supervisor protect */
        uint32_t RESERVED4 : 1;        /*!< [19]  */
        uint32_t TP2 : 1;              /*!< [20] Trusted Protect */
        uint32_t WP2 : 1;              /*!< [21] Write protect */
        uint32_t SP2 : 1;              /*!< [22] Supervisor Protect */
        uint32_t RESERVED5 : 1;        /*!< [23]  */
        uint32_t TP1 : 1;              /*!< [24] Trusted protect */
        uint32_t WP1 : 1;              /*!< [25] Write Protect */
        uint32_t SP1 : 1;              /*!< [26] Supervisor Protect */
        uint32_t RESERVED6 : 1;        /*!< [27]  */
        uint32_t TP0 : 1;              /*!< [28] Trusted Protect */
        uint32_t WP0 : 1;              /*!< [29] Write protect */
        uint32_t SP0 : 1;              /*!< [30] Supervisor Protect */
        uint32_t RESERVED7 : 1;        /*!< [31]  */
    } B;
} hw_aips_pacrb_t;

/*!
 * @name Constants and macros for entire AIPS_PACRB register
 */
/*@{*/
#define HW_AIPS_PACRB_ADDR(x)    ((uint32_t)(x) + 0x24U)

#define HW_AIPS_PACRB(x)         (*(__IO hw_aips_pacrb_t *) HW_AIPS_PACRB_ADDR(x))
#define HW_AIPS_PACRB_RD(x)      (HW_AIPS_PACRB(x).U)
#define HW_AIPS_PACRB_WR(x, v)   (HW_AIPS_PACRB(x).U = (v))
#define HW_AIPS_PACRB_SET(x, v)  (HW_AIPS_PACRB_WR(x, HW_AIPS_PACRB_RD(x) |  (v)))
#define HW_AIPS_PACRB_CLR(x, v)  (HW_AIPS_PACRB_WR(x, HW_AIPS_PACRB_RD(x) & ~(v)))
#define HW_AIPS_PACRB_TOG(x, v)  (HW_AIPS_PACRB_WR(x, HW_AIPS_PACRB_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual AIPS_PACRB bitfields
 */

/*!
 * @name Register AIPS_PACRB, field TP7[0] (RW)
 *
 * Determines whether the peripheral allows accesses from an untrusted master.
 * When this field is set and an access is attempted by an untrusted master, the
 * access terminates with an error response and no peripheral access initiates .
 *
 * Values:
 * - 0 - Accesses from an untrusted master are allowed.
 * - 1 - Accesses from an untrusted master are not allowed.
 */
/*@{*/
#define BP_AIPS_PACRB_TP7    (0U)          /*!< Bit position for AIPS_PACRB_TP7. */
#define BM_AIPS_PACRB_TP7    (0x00000001U) /*!< Bit mask for AIPS_PACRB_TP7. */
#define BS_AIPS_PACRB_TP7    (1U)          /*!< Bit field size in bits for AIPS_PACRB_TP7. */

/*! @brief Read current value of the AIPS_PACRB_TP7 field. */
#define BR_AIPS_PACRB_TP7(x) (BITBAND_ACCESS32(HW_AIPS_PACRB_ADDR(x), BP_AIPS_PACRB_TP7))

/*! @brief Format value for bitfield AIPS_PACRB_TP7. */
#define BF_AIPS_PACRB_TP7(v) ((uint32_t)((uint32_t)(v) << BP_AIPS_PACRB_TP7) & BM_AIPS_PACRB_TP7)

