theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Format value for bitfield AIPS_PACRP_SP0. */
#define BF_AIPS_PACRP_SP0(v) ((uint32_t)((uint32_t)(v) << BP_AIPS_PACRP_SP0) & BM_AIPS_PACRP_SP0)

/*! @brief Set the SP0 field to a new value. */
#define BW_AIPS_PACRP_SP0(x, v) (BITBAND_ACCESS32(HW_AIPS_PACRP_ADDR(x), BP_AIPS_PACRP_SP0) = (v))
/*@}*/

/*******************************************************************************
 * hw_aips_t - module struct
 ******************************************************************************/
/*!
 * @brief All AIPS module registers.
 */
#pragma pack(1)
typedef struct _hw_aips
{
    __IO hw_aips_mpra_t MPRA;              /*!< [0x0] Master Privilege Register A */
    uint8_t _reserved0[28];
    __IO hw_aips_pacra_t PACRA;            /*!< [0x20] Peripheral Access Control Register */
    __IO hw_aips_pacrb_t PACRB;            /*!< [0x24] Peripheral Access Control Register */
    __IO hw_aips_pacrc_t PACRC;            /*!< [0x28] Peripheral Access Control Register */
    __IO hw_aips_pacrd_t PACRD;            /*!< [0x2C] Peripheral Access Control Register */
    uint8_t _reserved1[16];
    __IO hw_aips_pacre_t PACRE;            /*!< [0x40] Peripheral Access Control Register */
    __IO hw_aips_pacrf_t PACRF;            /*!< [0x44] Peripheral Access Control Register */
    __IO hw_aips_pacrg_t PACRG;            /*!< [0x48] Peripheral Access Control Register */
    __IO hw_aips_pacrh_t PACRH;            /*!< [0x4C] Peripheral Access Control Register */
    __IO hw_aips_pacri_t PACRI;            /*!< [0x50] Peripheral Access Control Register */
    __IO hw_aips_pacrj_t PACRJ;            /*!< [0x54] Peripheral Access Control Register */
    __IO hw_aips_pacrk_t PACRK;            /*!< [0x58] Peripheral Access Control Register */
    __IO hw_aips_pacrl_t PACRL;            /*!< [0x5C] Peripheral Access Control Register */
    __IO hw_aips_pacrm_t PACRM;            /*!< [0x60] Peripheral Access Control Register */
    __IO hw_aips_pacrn_t PACRN;            /*!< [0x64] Peripheral Access Control Register */
    __IO hw_aips_pacro_t PACRO;            /*!< [0x68] Peripheral Access Control Register */
    __IO hw_aips_pacrp_t PACRP;            /*!< [0x6C] Peripheral Access Control Register */
} hw_aips_t;
#pragma pack()

/*! @brief Macro to access all AIPS registers. */
/*! @param x AIPS module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_AIPS_REGS(AIPS0_BASE)</code>. */
#define HW_AIPS_REGS(x) (*(hw_aips_t *)(x))

/*
 * MK60D10 AXBS
 *
 * Crossbar switch
 *
 * Registers defined in this header file:
 * - HW_AXBS_PRSn - Priority Registers Slave
 * - HW_AXBS_CRSn - Control Register
 * - HW_AXBS_MGPCR0 - Master General Purpose Control Register
 * - HW_AXBS_MGPCR1 - Master General Purpose Control Register
 * - HW_AXBS_MGPCR2 - Master General Purpose Control Register
 * - HW_AXBS_MGPCR3 - Master General Purpose Control Register
 * - HW_AXBS_MGPCR4 - Master General Purpose Control Register
 * - HW_AXBS_MGPCR5 - Master General Purpose Control Register
 *
 * - hw_axbs_t - Struct containing all module registers.
 */

#define HW_AXBS_INSTANCE_COUNT (1U) /*!< Number of instances of the AXBS module. */
#define HW_AXBS (0U) /*!< Instance number for AXBS. */

/*******************************************************************************
 * HW_AXBS_PRSn - Priority Registers Slave
 ******************************************************************************/

/*!
 * @brief HW_AXBS_PRSn - Priority Registers Slave (RW)
 *
 * Reset value: 0x76543210U
 *
 * The priority registers (PRSn) set the priority of each master port on a per
 * slave port basis and reside in each slave port. The priority register can be
 * accessed only with 32-bit accesses. After the CRSn[RO] bit is set, the PRSn
 * register can only be read; attempts to write to it have no effect on PRSn and
 * result in a bus-error response to the master initiating the write. No two
 * available master ports may be programmed with the same priority level. Attempts to
 * program two or more masters with the same priority level result in a bus-error
 * response and the PRSn is not updated. The possible values for the PRSn fields
 * depend on the number of masters available on the device. See the device's chip
 * configuration details for the number of masters supported. If the device
 * contains less than five masters, values 000-011 are valid and writing other values
 * results in an error. If the device contains n masters where n >= 5, values 0 to
 * n -1 are valid and writing other values results in an error.
 */
typedef union _hw_axbs_prsn
{
    uint32_t U;
    struct _hw_axbs_prsn_bitfields
    {
        uint32_t M0 : 3;               /*!< [2:0] Master 0 Priority. Sets the arbitration
                                        * priority for this port on the associated slave port. */
        uint32_t RESERVED0 : 1;        /*!< [3]  */
        uint32_t M1 : 3;               /*!< [6:4] Master 1 Priority. Sets the arbitration
                                        * priority for this port on the associated slave port. */
        uint32_t RESERVED1 : 1;        /*!< [7]  */
        uint32_t M2 : 3;               /*!< [10:8] Master 2 Priority. Sets the arbitration
                                        * priority for this port on the associated slave port. */
        uint32_t RESERVED2 : 1;        /*!< [11]  */
        uint32_t M3 : 3;               /*!< [14:12] Master 3 Priority. Sets the arbitration
                                        * priority for this port on the associated slave port. */
        uint32_t RESERVED3 : 1;        /*!< [15]  */
        uint32_t M4 : 3;               /*!< [18:16] Master 4 Priority. Sets the arbitration
                                        * priority for this port on the associated slave port. */
        uint32_t RESERVED4 : 1;        /*!< [19]  */
        uint32_t M5 : 3;               /*!< [22:20] Master 5 Priority. Sets the arbitration
                                        * priority for this port on the associated slave port. */
        uint32_t RESERVED5 : 9;        /*!< [31:23]  */
    } B;
} hw_axbs_prsn_t;

/*!
 * @name Constants and macros for entire AXBS_PRSn register
 */
/*@{*/
#define HW_AXBS_PRSn_COUNT (5U)

#define HW_AXBS_PRSn_ADDR(x, n)  ((uint32_t)(x) + 0x0U + (0x100U * (n)))

