theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Format value for bitfield CAU_LDR_CASR_VER. */
#define BF_CAU_LDR_CASR_VER(v) ((uint32_t)((uint32_t)(v) << BP_CAU_LDR_CASR_VER) & BM_CAU_LDR_CASR_VER)
/*@}*/

/*******************************************************************************
 * HW_CAU_LDR_CAA - Accumulator register - Load Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_LDR_CAA - Accumulator register - Load Register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_ldr_caa
{
    uint32_t U;
    struct _hw_cau_ldr_caa_bitfields
    {
        uint32_t ACC : 32;             /*!< [31:0] ACC */
    } B;
} hw_cau_ldr_caa_t;

/*!
 * @name Constants and macros for entire CAU_LDR_CAA register
 */
/*@{*/
#define HW_CAU_LDR_CAA_ADDR(x)   ((uint32_t)(x) + 0x844U)

#define HW_CAU_LDR_CAA(x)        (*(__O hw_cau_ldr_caa_t *) HW_CAU_LDR_CAA_ADDR(x))
#define HW_CAU_LDR_CAA_WR(x, v)  (HW_CAU_LDR_CAA(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_LDR_CAA bitfields
 */

/*!
 * @name Register CAU_LDR_CAA, field ACC[31:0] (WO)
 */
/*@{*/
#define BP_CAU_LDR_CAA_ACC   (0U)          /*!< Bit position for CAU_LDR_CAA_ACC. */
#define BM_CAU_LDR_CAA_ACC   (0xFFFFFFFFU) /*!< Bit mask for CAU_LDR_CAA_ACC. */
#define BS_CAU_LDR_CAA_ACC   (32U)         /*!< Bit field size in bits for CAU_LDR_CAA_ACC. */

/*! @brief Format value for bitfield CAU_LDR_CAA_ACC. */
#define BF_CAU_LDR_CAA_ACC(v) ((uint32_t)((uint32_t)(v) << BP_CAU_LDR_CAA_ACC) & BM_CAU_LDR_CAA_ACC)
/*@}*/

/*******************************************************************************
 * HW_CAU_LDR_CA0 - General Purpose Register 0 - Load Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_LDR_CA0 - General Purpose Register 0 - Load Register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_ldr_ca0
{
    uint32_t U;
    struct _hw_cau_ldr_ca0_bitfields
    {
        uint32_t CA0 : 32;             /*!< [31:0] CA0 */
    } B;
} hw_cau_ldr_ca0_t;

/*!
 * @name Constants and macros for entire CAU_LDR_CA0 register
 */
/*@{*/
#define HW_CAU_LDR_CA0_ADDR(x)   ((uint32_t)(x) + 0x848U)

#define HW_CAU_LDR_CA0(x)        (*(__O hw_cau_ldr_ca0_t *) HW_CAU_LDR_CA0_ADDR(x))
#define HW_CAU_LDR_CA0_WR(x, v)  (HW_CAU_LDR_CA0(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_LDR_CA0 bitfields
 */

/*!
 * @name Register CAU_LDR_CA0, field CA0[31:0] (WO)
 */
/*@{*/
#define BP_CAU_LDR_CA0_CA0   (0U)          /*!< Bit position for CAU_LDR_CA0_CA0. */
#define BM_CAU_LDR_CA0_CA0   (0xFFFFFFFFU) /*!< Bit mask for CAU_LDR_CA0_CA0. */
#define BS_CAU_LDR_CA0_CA0   (32U)         /*!< Bit field size in bits for CAU_LDR_CA0_CA0. */

/*! @brief Format value for bitfield CAU_LDR_CA0_CA0. */
#define BF_CAU_LDR_CA0_CA0(v) ((uint32_t)((uint32_t)(v) << BP_CAU_LDR_CA0_CA0) & BM_CAU_LDR_CA0_CA0)
/*@}*/

/*******************************************************************************
 * HW_CAU_LDR_CA1 - General Purpose Register 1 - Load Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_LDR_CA1 - General Purpose Register 1 - Load Register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_ldr_ca1
{
    uint32_t U;
    struct _hw_cau_ldr_ca1_bitfields
    {
        uint32_t CA1 : 32;             /*!< [31:0] CA1 */
    } B;
} hw_cau_ldr_ca1_t;

/*!
 * @name Constants and macros for entire CAU_LDR_CA1 register
 */
/*@{*/
#define HW_CAU_LDR_CA1_ADDR(x)   ((uint32_t)(x) + 0x84CU)

#define HW_CAU_LDR_CA1(x)        (*(__O hw_cau_ldr_ca1_t *) HW_CAU_LDR_CA1_ADDR(x))
#define HW_CAU_LDR_CA1_WR(x, v)  (HW_CAU_LDR_CA1(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_LDR_CA1 bitfields
 */

/*!
 * @name Register CAU_LDR_CA1, field CA1[31:0] (WO)
 */
/*@{*/
#define BP_CAU_LDR_CA1_CA1   (0U)          /*!< Bit position for CAU_LDR_CA1_CA1. */
#define BM_CAU_LDR_CA1_CA1   (0xFFFFFFFFU) /*!< Bit mask for CAU_LDR_CA1_CA1. */
#define BS_CAU_LDR_CA1_CA1   (32U)         /*!< Bit field size in bits for CAU_LDR_CA1_CA1. */

/*! @brief Format value for bitfield CAU_LDR_CA1_CA1. */
#define BF_CAU_LDR_CA1_CA1(v) ((uint32_t)((uint32_t)(v) << BP_CAU_LDR_CA1_CA1) & BM_CAU_LDR_CA1_CA1)
/*@}*/

/*******************************************************************************
 * HW_CAU_LDR_CA2 - General Purpose Register 2 - Load Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_LDR_CA2 - General Purpose Register 2 - Load Register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_ldr_ca2
{
    uint32_t U;
    struct _hw_cau_ldr_ca2_bitfields
    {
        uint32_t CA2 : 32;             /*!< [31:0] CA2 */
    } B;
} hw_cau_ldr_ca2_t;

/*!
 * @name Constants and macros for entire CAU_LDR_CA2 register
 */
/*@{*/
#define HW_CAU_LDR_CA2_ADDR(x)   ((uint32_t)(x) + 0x850U)

#define HW_CAU_LDR_CA2(x)        (*(__O hw_cau_ldr_ca2_t *) HW_CAU_LDR_CA2_ADDR(x))
#define HW_CAU_LDR_CA2_WR(x, v)  (HW_CAU_LDR_CA2(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_LDR_CA2 bitfields
 */

/*!
 * @name Register CAU_LDR_CA2, field CA2[31:0] (WO)
 */
/*@{*/
#define BP_CAU_LDR_CA2_CA2   (0U)          /*!< Bit position for CAU_LDR_CA2_CA2. */
#define BM_CAU_LDR_CA2_CA2   (0xFFFFFFFFU) /*!< Bit mask for CAU_LDR_CA2_CA2. */
#define BS_CAU_LDR_CA2_CA2   (32U)         /*!< Bit field size in bits for CAU_LDR_CA2_CA2. */

/*! @brief Format value for bitfield CAU_LDR_CA2_CA2. */
#define BF_CAU_LDR_CA2_CA2(v) ((uint32_t)((uint32_t)(v) << BP_CAU_LDR_CA2_CA2) & BM_CAU_LDR_CA2_CA2)
/*@}*/

/*******************************************************************************
 * HW_CAU_LDR_CA3 - General Purpose Register 3 - Load Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_LDR_CA3 - General Purpose Register 3 - Load Register command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_ldr_ca3
{
    uint32_t U;
    struct _hw_cau_ldr_ca3_bitfields
    {
        uint32_t CA3 : 32;             /*!< [31:0] CA3 */
    } B;
} hw_cau_ldr_ca3_t;

/*!
 * @name Constants and macros for entire CAU_LDR_CA3 register
 */
/*@{*/
#define HW_CAU_LDR_CA3_ADDR(x)   ((uint32_t)(x) + 0x854U)

