theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the CMT_DMA_DMA field. */
#define BR_CMT_DMA_DMA(x)    (BITBAND_ACCESS8(HW_CMT_DMA_ADDR(x), BP_CMT_DMA_DMA))

/*! @brief Format value for bitfield CMT_DMA_DMA. */
#define BF_CMT_DMA_DMA(v)    ((uint8_t)((uint8_t)(v) << BP_CMT_DMA_DMA) & BM_CMT_DMA_DMA)

/*! @brief Set the DMA field to a new value. */
#define BW_CMT_DMA_DMA(x, v) (BITBAND_ACCESS8(HW_CMT_DMA_ADDR(x), BP_CMT_DMA_DMA) = (v))
/*@}*/

/*******************************************************************************
 * hw_cmt_t - module struct
 ******************************************************************************/
/*!
 * @brief All CMT module registers.
 */
#pragma pack(1)
typedef struct _hw_cmt
{
    __IO hw_cmt_cgh1_t CGH1;               /*!< [0x0] CMT Carrier Generator High Data Register 1 */
    __IO hw_cmt_cgl1_t CGL1;               /*!< [0x1] CMT Carrier Generator Low Data Register 1 */
    __IO hw_cmt_cgh2_t CGH2;               /*!< [0x2] CMT Carrier Generator High Data Register 2 */
    __IO hw_cmt_cgl2_t CGL2;               /*!< [0x3] CMT Carrier Generator Low Data Register 2 */
    __IO hw_cmt_oc_t OC;                   /*!< [0x4] CMT Output Control Register */
    __IO hw_cmt_msc_t MSC;                 /*!< [0x5] CMT Modulator Status and Control Register */
    __IO hw_cmt_cmd1_t CMD1;               /*!< [0x6] CMT Modulator Data Register Mark High */
    __IO hw_cmt_cmd2_t CMD2;               /*!< [0x7] CMT Modulator Data Register Mark Low */
    __IO hw_cmt_cmd3_t CMD3;               /*!< [0x8] CMT Modulator Data Register Space High */
    __IO hw_cmt_cmd4_t CMD4;               /*!< [0x9] CMT Modulator Data Register Space Low */
    __IO hw_cmt_pps_t PPS;                 /*!< [0xA] CMT Primary Prescaler Register */
    __IO hw_cmt_dma_t DMA;                 /*!< [0xB] CMT Direct Memory Access Register */
} hw_cmt_t;
#pragma pack()

/*! @brief Macro to access all CMT registers. */
/*! @param x CMT module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_CMT_REGS(CMT_BASE)</code>. */
#define HW_CMT_REGS(x) (*(hw_cmt_t *)(x))

/*
 * MK60D10 CRC
 *
 * Cyclic Redundancy Check
 *
 * Registers defined in this header file:
 * - HW_CRC_CRCL - CRC_CRCL register.
 * - HW_CRC_CRCH - CRC_CRCH register.
 * - HW_CRC_CRCLL - CRC_CRCLL register.
 * - HW_CRC_CRCLU - CRC_CRCLU register.
 * - HW_CRC_CRCHL - CRC_CRCHL register.
 * - HW_CRC_CRCHU - CRC_CRCHU register.
 * - HW_CRC_CRC - CRC Data register
 * - HW_CRC_GPOLY - CRC Polynomial register
 * - HW_CRC_GPOLYL - CRC_GPOLYL register.
 * - HW_CRC_GPOLYH - CRC_GPOLYH register.
 * - HW_CRC_GPOLYLL - CRC_GPOLYLL register.
 * - HW_CRC_GPOLYLU - CRC_GPOLYLU register.
 * - HW_CRC_GPOLYHL - CRC_GPOLYHL register.
 * - HW_CRC_GPOLYHU - CRC_GPOLYHU register.
 * - HW_CRC_CTRL - CRC Control register
 * - HW_CRC_CTRLHU - CRC_CTRLHU register.
 *
 * - hw_crc_t - Struct containing all module registers.
 */

#define HW_CRC_INSTANCE_COUNT (1U) /*!< Number of instances of the CRC module. */
#define HW_CRC (0U) /*!< Instance number for CRC. */

/*******************************************************************************
 * HW_CRC_CRCL - CRC_CRCL register.
 ******************************************************************************/

/*!
 * @brief HW_CRC_CRCL - CRC_CRCL register. (RW)
 *
 * Reset value: 0xFFFFU
 */
typedef union _hw_crc_crcl
{
    uint16_t U;
    struct _hw_crc_crcl_bitfields
    {
        uint16_t CRCL : 16;            /*!< [15:0] CRCL stores the lower 16 bits of the
                                        * 16/32 bit CRC */
    } B;
} hw_crc_crcl_t;

/*!
 * @name Constants and macros for entire CRC_CRCL register
 */
/*@{*/
#define HW_CRC_CRCL_ADDR(x)      ((uint32_t)(x) + 0x0U)

#define HW_CRC_CRCL(x)           (*(__IO hw_crc_crcl_t *) HW_CRC_CRCL_ADDR(x))
#define HW_CRC_CRCL_RD(x)        (HW_CRC_CRCL(x).U)
#define HW_CRC_CRCL_WR(x, v)     (HW_CRC_CRCL(x).U = (v))
#define HW_CRC_CRCL_SET(x, v)    (HW_CRC_CRCL_WR(x, HW_CRC_CRCL_RD(x) |  (v)))
#define HW_CRC_CRCL_CLR(x, v)    (HW_CRC_CRCL_WR(x, HW_CRC_CRCL_RD(x) & ~(v)))
#define HW_CRC_CRCL_TOG(x, v)    (HW_CRC_CRCL_WR(x, HW_CRC_CRCL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual CRC_CRCL bitfields
 */

/*!
 * @name Register CRC_CRCL, field CRCL[15:0] (RW)
 */
/*@{*/
#define BP_CRC_CRCL_CRCL     (0U)          /*!< Bit position for CRC_CRCL_CRCL. */
#define BM_CRC_CRCL_CRCL     (0xFFFFU)     /*!< Bit mask for CRC_CRCL_CRCL. */
#define BS_CRC_CRCL_CRCL     (16U)         /*!< Bit field size in bits for CRC_CRCL_CRCL. */

/*! @brief Read current value of the CRC_CRCL_CRCL field. */
#define BR_CRC_CRCL_CRCL(x)  (HW_CRC_CRCL(x).U)

/*! @brief Format value for bitfield CRC_CRCL_CRCL. */
#define BF_CRC_CRCL_CRCL(v)  ((uint16_t)((uint16_t)(v) << BP_CRC_CRCL_CRCL) & BM_CRC_CRCL_CRCL)

/*! @brief Set the CRCL field to a new value. */
#define BW_CRC_CRCL_CRCL(x, v) (HW_CRC_CRCL_WR(x, v))
/*@}*/
/*******************************************************************************
 * HW_CRC_CRCH - CRC_CRCH register.
 ******************************************************************************/

/*!
 * @brief HW_CRC_CRCH - CRC_CRCH register. (RW)
 *
 * Reset value: 0xFFFFU
 */
typedef union _hw_crc_crch
{
    uint16_t U;
    struct _hw_crc_crch_bitfields
    {
        uint16_t CRCH : 16;            /*!< [15:0] CRCH stores the high 16 bits of the
                                        * 16/32 bit CRC */
    } B;
} hw_crc_crch_t;

/*!
 * @name Constants and macros for entire CRC_CRCH register
 */
/*@{*/
#define HW_CRC_CRCH_ADDR(x)      ((uint32_t)(x) + 0x2U)

#define HW_CRC_CRCH(x)           (*(__IO hw_crc_crch_t *) HW_CRC_CRCH_ADDR(x))
#define HW_CRC_CRCH_RD(x)        (HW_CRC_CRCH(x).U)
#define HW_CRC_CRCH_WR(x, v)     (HW_CRC_CRCH(x).U = (v))
#define HW_CRC_CRCH_SET(x, v)    (HW_CRC_CRCH_WR(x, HW_CRC_CRCH_RD(x) |  (v)))
#define HW_CRC_CRCH_CLR(x, v)    (HW_CRC_CRCH_WR(x, HW_CRC_CRCH_RD(x) & ~(v)))
#define HW_CRC_CRCH_TOG(x, v)    (HW_CRC_CRCH_WR(x, HW_CRC_CRCH_RD(x) ^  (v)))
/*@}*/

