theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the ENET_RACC_LINEDIS field. */
#define BR_ENET_RACC_LINEDIS(x) (BITBAND_ACCESS32(HW_ENET_RACC_ADDR(x), BP_ENET_RACC_LINEDIS))

/*! @brief Format value for bitfield ENET_RACC_LINEDIS. */
#define BF_ENET_RACC_LINEDIS(v) ((uint32_t)((uint32_t)(v) << BP_ENET_RACC_LINEDIS) & BM_ENET_RACC_LINEDIS)

/*! @brief Set the LINEDIS field to a new value. */
#define BW_ENET_RACC_LINEDIS(x, v) (BITBAND_ACCESS32(HW_ENET_RACC_ADDR(x), BP_ENET_RACC_LINEDIS) = (v))
/*@}*/

/*!
 * @name Register ENET_RACC, field SHIFT16[7] (RW)
 *
 * When this field is set, the actual frame data starts at bit 16 of the first
 * word read from the RX FIFO aligning the Ethernet payload on a 32-bit boundary.
 * This function only affects the FIFO storage and has no influence on the
 * statistics, which use the actual length of the frame received.
 *
 * Values:
 * - 0 - Disabled.
 * - 1 - Instructs the MAC to write two additional bytes in front of each frame
 *     received into the RX FIFO.
 */
/*@{*/
#define BP_ENET_RACC_SHIFT16 (7U)          /*!< Bit position for ENET_RACC_SHIFT16. */
#define BM_ENET_RACC_SHIFT16 (0x00000080U) /*!< Bit mask for ENET_RACC_SHIFT16. */
#define BS_ENET_RACC_SHIFT16 (1U)          /*!< Bit field size in bits for ENET_RACC_SHIFT16. */

/*! @brief Read current value of the ENET_RACC_SHIFT16 field. */
#define BR_ENET_RACC_SHIFT16(x) (BITBAND_ACCESS32(HW_ENET_RACC_ADDR(x), BP_ENET_RACC_SHIFT16))

/*! @brief Format value for bitfield ENET_RACC_SHIFT16. */
#define BF_ENET_RACC_SHIFT16(v) ((uint32_t)((uint32_t)(v) << BP_ENET_RACC_SHIFT16) & BM_ENET_RACC_SHIFT16)

/*! @brief Set the SHIFT16 field to a new value. */
#define BW_ENET_RACC_SHIFT16(x, v) (BITBAND_ACCESS32(HW_ENET_RACC_ADDR(x), BP_ENET_RACC_SHIFT16) = (v))
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_DROP - Count of frames not counted correctly (RMON_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable.
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_DROP - Count of frames not counted correctly (RMON_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable. (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_drop
{
    uint32_t U;
    struct _hw_enet_rmon_t_drop_bitfields
    {
        uint32_t RESERVED0 : 32;       /*!< [31:0]  */
    } B;
} hw_enet_rmon_t_drop_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_DROP register
 */
/*@{*/
#define HW_ENET_RMON_T_DROP_ADDR(x) ((uint32_t)(x) + 0x200U)

#define HW_ENET_RMON_T_DROP(x)   (*(__IO hw_enet_rmon_t_drop_t *) HW_ENET_RMON_T_DROP_ADDR(x))
#define HW_ENET_RMON_T_DROP_RD(x) (HW_ENET_RMON_T_DROP(x).U)
#define HW_ENET_RMON_T_DROP_WR(x, v) (HW_ENET_RMON_T_DROP(x).U = (v))
#define HW_ENET_RMON_T_DROP_SET(x, v) (HW_ENET_RMON_T_DROP_WR(x, HW_ENET_RMON_T_DROP_RD(x) |  (v)))
#define HW_ENET_RMON_T_DROP_CLR(x, v) (HW_ENET_RMON_T_DROP_WR(x, HW_ENET_RMON_T_DROP_RD(x) & ~(v)))
#define HW_ENET_RMON_T_DROP_TOG(x, v) (HW_ENET_RMON_T_DROP_WR(x, HW_ENET_RMON_T_DROP_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_DROP bitfields
 */

/*******************************************************************************
 * HW_ENET_RMON_T_PACKETS - RMON Tx packet count (RMON_T_PACKETS)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_PACKETS - RMON Tx packet count (RMON_T_PACKETS) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_packets
{
    uint32_t U;
    struct _hw_enet_rmon_t_packets_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_packets_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_PACKETS register
 */
/*@{*/
#define HW_ENET_RMON_T_PACKETS_ADDR(x) ((uint32_t)(x) + 0x204U)

#define HW_ENET_RMON_T_PACKETS(x) (*(__IO hw_enet_rmon_t_packets_t *) HW_ENET_RMON_T_PACKETS_ADDR(x))
#define HW_ENET_RMON_T_PACKETS_RD(x) (HW_ENET_RMON_T_PACKETS(x).U)
#define HW_ENET_RMON_T_PACKETS_WR(x, v) (HW_ENET_RMON_T_PACKETS(x).U = (v))
#define HW_ENET_RMON_T_PACKETS_SET(x, v) (HW_ENET_RMON_T_PACKETS_WR(x, HW_ENET_RMON_T_PACKETS_RD(x) |  (v)))
#define HW_ENET_RMON_T_PACKETS_CLR(x, v) (HW_ENET_RMON_T_PACKETS_WR(x, HW_ENET_RMON_T_PACKETS_RD(x) & ~(v)))
#define HW_ENET_RMON_T_PACKETS_TOG(x, v) (HW_ENET_RMON_T_PACKETS_WR(x, HW_ENET_RMON_T_PACKETS_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_PACKETS bitfields
 */

/*!
 * @name Register ENET_RMON_T_PACKETS, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_PACKETS_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_PACKETS_TXPKTS. */
#define BM_ENET_RMON_T_PACKETS_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_PACKETS_TXPKTS. */
#define BS_ENET_RMON_T_PACKETS_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_PACKETS_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_PACKETS_TXPKTS field. */
#define BR_ENET_RMON_T_PACKETS_TXPKTS(x) (HW_ENET_RMON_T_PACKETS(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_BC_PKT - RMON Tx Broadcast Packets (RMON_T_BC_PKT)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_BC_PKT - RMON Tx Broadcast Packets (RMON_T_BC_PKT) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_bc_pkt
{
    uint32_t U;
    struct _hw_enet_rmon_t_bc_pkt_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Broadcast packets */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_bc_pkt_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_BC_PKT register
 */
/*@{*/
#define HW_ENET_RMON_T_BC_PKT_ADDR(x) ((uint32_t)(x) + 0x208U)

#define HW_ENET_RMON_T_BC_PKT(x) (*(__IO hw_enet_rmon_t_bc_pkt_t *) HW_ENET_RMON_T_BC_PKT_ADDR(x))
#define HW_ENET_RMON_T_BC_PKT_RD(x) (HW_ENET_RMON_T_BC_PKT(x).U)
#define HW_ENET_RMON_T_BC_PKT_WR(x, v) (HW_ENET_RMON_T_BC_PKT(x).U = (v))
#define HW_ENET_RMON_T_BC_PKT_SET(x, v) (HW_ENET_RMON_T_BC_PKT_WR(x, HW_ENET_RMON_T_BC_PKT_RD(x) |  (v)))
#define HW_ENET_RMON_T_BC_PKT_CLR(x, v) (HW_ENET_RMON_T_BC_PKT_WR(x, HW_ENET_RMON_T_BC_PKT_RD(x) & ~(v)))
#define HW_ENET_RMON_T_BC_PKT_TOG(x, v) (HW_ENET_RMON_T_BC_PKT_WR(x, HW_ENET_RMON_T_BC_PKT_RD(x) ^  (v)))
/*@}*/

