theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual ENET_RMON_T_BC_PKT bitfields
 */

/*!
 * @name Register ENET_RMON_T_BC_PKT, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_BC_PKT_TXPKTS (0U)  /*!< Bit position for ENET_RMON_T_BC_PKT_TXPKTS. */
#define BM_ENET_RMON_T_BC_PKT_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_BC_PKT_TXPKTS. */
#define BS_ENET_RMON_T_BC_PKT_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_BC_PKT_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_BC_PKT_TXPKTS field. */
#define BR_ENET_RMON_T_BC_PKT_TXPKTS(x) (HW_ENET_RMON_T_BC_PKT(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_MC_PKT - RMON Tx Multicast Packets (RMON_T_MC_PKT)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_MC_PKT - RMON Tx Multicast Packets (RMON_T_MC_PKT) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_mc_pkt
{
    uint32_t U;
    struct _hw_enet_rmon_t_mc_pkt_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Multicast packets */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_mc_pkt_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_MC_PKT register
 */
/*@{*/
#define HW_ENET_RMON_T_MC_PKT_ADDR(x) ((uint32_t)(x) + 0x20CU)

#define HW_ENET_RMON_T_MC_PKT(x) (*(__IO hw_enet_rmon_t_mc_pkt_t *) HW_ENET_RMON_T_MC_PKT_ADDR(x))
#define HW_ENET_RMON_T_MC_PKT_RD(x) (HW_ENET_RMON_T_MC_PKT(x).U)
#define HW_ENET_RMON_T_MC_PKT_WR(x, v) (HW_ENET_RMON_T_MC_PKT(x).U = (v))
#define HW_ENET_RMON_T_MC_PKT_SET(x, v) (HW_ENET_RMON_T_MC_PKT_WR(x, HW_ENET_RMON_T_MC_PKT_RD(x) |  (v)))
#define HW_ENET_RMON_T_MC_PKT_CLR(x, v) (HW_ENET_RMON_T_MC_PKT_WR(x, HW_ENET_RMON_T_MC_PKT_RD(x) & ~(v)))
#define HW_ENET_RMON_T_MC_PKT_TOG(x, v) (HW_ENET_RMON_T_MC_PKT_WR(x, HW_ENET_RMON_T_MC_PKT_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_MC_PKT bitfields
 */

/*!
 * @name Register ENET_RMON_T_MC_PKT, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_MC_PKT_TXPKTS (0U)  /*!< Bit position for ENET_RMON_T_MC_PKT_TXPKTS. */
#define BM_ENET_RMON_T_MC_PKT_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_MC_PKT_TXPKTS. */
#define BS_ENET_RMON_T_MC_PKT_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_MC_PKT_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_MC_PKT_TXPKTS field. */
#define BR_ENET_RMON_T_MC_PKT_TXPKTS(x) (HW_ENET_RMON_T_MC_PKT(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_CRC_ALIGN - RMON Tx Packets w CRC/Align error (RMON_T_CRC_ALIGN)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_CRC_ALIGN - RMON Tx Packets w CRC/Align error (RMON_T_CRC_ALIGN) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_crc_align
{
    uint32_t U;
    struct _hw_enet_rmon_t_crc_align_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packets with CRC/align error */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_crc_align_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_CRC_ALIGN register
 */
/*@{*/
#define HW_ENET_RMON_T_CRC_ALIGN_ADDR(x) ((uint32_t)(x) + 0x210U)

#define HW_ENET_RMON_T_CRC_ALIGN(x) (*(__IO hw_enet_rmon_t_crc_align_t *) HW_ENET_RMON_T_CRC_ALIGN_ADDR(x))
#define HW_ENET_RMON_T_CRC_ALIGN_RD(x) (HW_ENET_RMON_T_CRC_ALIGN(x).U)
#define HW_ENET_RMON_T_CRC_ALIGN_WR(x, v) (HW_ENET_RMON_T_CRC_ALIGN(x).U = (v))
#define HW_ENET_RMON_T_CRC_ALIGN_SET(x, v) (HW_ENET_RMON_T_CRC_ALIGN_WR(x, HW_ENET_RMON_T_CRC_ALIGN_RD(x) |  (v)))
#define HW_ENET_RMON_T_CRC_ALIGN_CLR(x, v) (HW_ENET_RMON_T_CRC_ALIGN_WR(x, HW_ENET_RMON_T_CRC_ALIGN_RD(x) & ~(v)))
#define HW_ENET_RMON_T_CRC_ALIGN_TOG(x, v) (HW_ENET_RMON_T_CRC_ALIGN_WR(x, HW_ENET_RMON_T_CRC_ALIGN_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_CRC_ALIGN bitfields
 */

/*!
 * @name Register ENET_RMON_T_CRC_ALIGN, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_CRC_ALIGN_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_CRC_ALIGN_TXPKTS. */
#define BM_ENET_RMON_T_CRC_ALIGN_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_CRC_ALIGN_TXPKTS. */
#define BS_ENET_RMON_T_CRC_ALIGN_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_CRC_ALIGN_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_CRC_ALIGN_TXPKTS field. */
#define BR_ENET_RMON_T_CRC_ALIGN_TXPKTS(x) (HW_ENET_RMON_T_CRC_ALIGN(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_UNDERSIZE - RMON Tx Packets < 64 bytes, good CRC (RMON_T_UNDERSIZE)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_UNDERSIZE - RMON Tx Packets < 64 bytes, good CRC (RMON_T_UNDERSIZE) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_undersize
{
    uint32_t U;
    struct _hw_enet_rmon_t_undersize_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_undersize_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_UNDERSIZE register
 */
/*@{*/
#define HW_ENET_RMON_T_UNDERSIZE_ADDR(x) ((uint32_t)(x) + 0x214U)

#define HW_ENET_RMON_T_UNDERSIZE(x) (*(__IO hw_enet_rmon_t_undersize_t *) HW_ENET_RMON_T_UNDERSIZE_ADDR(x))
#define HW_ENET_RMON_T_UNDERSIZE_RD(x) (HW_ENET_RMON_T_UNDERSIZE(x).U)
#define HW_ENET_RMON_T_UNDERSIZE_WR(x, v) (HW_ENET_RMON_T_UNDERSIZE(x).U = (v))
#define HW_ENET_RMON_T_UNDERSIZE_SET(x, v) (HW_ENET_RMON_T_UNDERSIZE_WR(x, HW_ENET_RMON_T_UNDERSIZE_RD(x) |  (v)))
#define HW_ENET_RMON_T_UNDERSIZE_CLR(x, v) (HW_ENET_RMON_T_UNDERSIZE_WR(x, HW_ENET_RMON_T_UNDERSIZE_RD(x) & ~(v)))
#define HW_ENET_RMON_T_UNDERSIZE_TOG(x, v) (HW_ENET_RMON_T_UNDERSIZE_WR(x, HW_ENET_RMON_T_UNDERSIZE_RD(x) ^  (v)))
/*@}*/

