theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual ENET_RMON_T_UNDERSIZE bitfields
 */

/*!
 * @name Register ENET_RMON_T_UNDERSIZE, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_UNDERSIZE_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_UNDERSIZE_TXPKTS. */
#define BM_ENET_RMON_T_UNDERSIZE_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_UNDERSIZE_TXPKTS. */
#define BS_ENET_RMON_T_UNDERSIZE_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_UNDERSIZE_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_UNDERSIZE_TXPKTS field. */
#define BR_ENET_RMON_T_UNDERSIZE_TXPKTS(x) (HW_ENET_RMON_T_UNDERSIZE(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_OVERSIZE - RMON Tx Packets > MAX_FL bytes, good CRC (RMON_T_OVERSIZE)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_OVERSIZE - RMON Tx Packets > MAX_FL bytes, good CRC (RMON_T_OVERSIZE) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_oversize
{
    uint32_t U;
    struct _hw_enet_rmon_t_oversize_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_oversize_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_OVERSIZE register
 */
/*@{*/
#define HW_ENET_RMON_T_OVERSIZE_ADDR(x) ((uint32_t)(x) + 0x218U)

#define HW_ENET_RMON_T_OVERSIZE(x) (*(__IO hw_enet_rmon_t_oversize_t *) HW_ENET_RMON_T_OVERSIZE_ADDR(x))
#define HW_ENET_RMON_T_OVERSIZE_RD(x) (HW_ENET_RMON_T_OVERSIZE(x).U)
#define HW_ENET_RMON_T_OVERSIZE_WR(x, v) (HW_ENET_RMON_T_OVERSIZE(x).U = (v))
#define HW_ENET_RMON_T_OVERSIZE_SET(x, v) (HW_ENET_RMON_T_OVERSIZE_WR(x, HW_ENET_RMON_T_OVERSIZE_RD(x) |  (v)))
#define HW_ENET_RMON_T_OVERSIZE_CLR(x, v) (HW_ENET_RMON_T_OVERSIZE_WR(x, HW_ENET_RMON_T_OVERSIZE_RD(x) & ~(v)))
#define HW_ENET_RMON_T_OVERSIZE_TOG(x, v) (HW_ENET_RMON_T_OVERSIZE_WR(x, HW_ENET_RMON_T_OVERSIZE_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_OVERSIZE bitfields
 */

/*!
 * @name Register ENET_RMON_T_OVERSIZE, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_OVERSIZE_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_OVERSIZE_TXPKTS. */
#define BM_ENET_RMON_T_OVERSIZE_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_OVERSIZE_TXPKTS. */
#define BS_ENET_RMON_T_OVERSIZE_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_OVERSIZE_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_OVERSIZE_TXPKTS field. */
#define BR_ENET_RMON_T_OVERSIZE_TXPKTS(x) (HW_ENET_RMON_T_OVERSIZE(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_FRAG - RMON Tx Packets < 64 bytes, bad CRC (RMON_T_FRAG)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_FRAG - RMON Tx Packets < 64 bytes, bad CRC (RMON_T_FRAG) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_frag
{
    uint32_t U;
    struct _hw_enet_rmon_t_frag_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_frag_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_FRAG register
 */
/*@{*/
#define HW_ENET_RMON_T_FRAG_ADDR(x) ((uint32_t)(x) + 0x21CU)

#define HW_ENET_RMON_T_FRAG(x)   (*(__IO hw_enet_rmon_t_frag_t *) HW_ENET_RMON_T_FRAG_ADDR(x))
#define HW_ENET_RMON_T_FRAG_RD(x) (HW_ENET_RMON_T_FRAG(x).U)
#define HW_ENET_RMON_T_FRAG_WR(x, v) (HW_ENET_RMON_T_FRAG(x).U = (v))
#define HW_ENET_RMON_T_FRAG_SET(x, v) (HW_ENET_RMON_T_FRAG_WR(x, HW_ENET_RMON_T_FRAG_RD(x) |  (v)))
#define HW_ENET_RMON_T_FRAG_CLR(x, v) (HW_ENET_RMON_T_FRAG_WR(x, HW_ENET_RMON_T_FRAG_RD(x) & ~(v)))
#define HW_ENET_RMON_T_FRAG_TOG(x, v) (HW_ENET_RMON_T_FRAG_WR(x, HW_ENET_RMON_T_FRAG_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_FRAG bitfields
 */

/*!
 * @name Register ENET_RMON_T_FRAG, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_FRAG_TXPKTS (0U)    /*!< Bit position for ENET_RMON_T_FRAG_TXPKTS. */
#define BM_ENET_RMON_T_FRAG_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_FRAG_TXPKTS. */
#define BS_ENET_RMON_T_FRAG_TXPKTS (16U)   /*!< Bit field size in bits for ENET_RMON_T_FRAG_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_FRAG_TXPKTS field. */
#define BR_ENET_RMON_T_FRAG_TXPKTS(x) (HW_ENET_RMON_T_FRAG(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_JAB - RMON Tx Packets > MAX_FL bytes, bad CRC (RMON_T_JAB)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_JAB - RMON Tx Packets > MAX_FL bytes, bad CRC (RMON_T_JAB) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_jab
{
    uint32_t U;
    struct _hw_enet_rmon_t_jab_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_jab_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_JAB register
 */
/*@{*/
#define HW_ENET_RMON_T_JAB_ADDR(x) ((uint32_t)(x) + 0x220U)

#define HW_ENET_RMON_T_JAB(x)    (*(__IO hw_enet_rmon_t_jab_t *) HW_ENET_RMON_T_JAB_ADDR(x))
#define HW_ENET_RMON_T_JAB_RD(x) (HW_ENET_RMON_T_JAB(x).U)
#define HW_ENET_RMON_T_JAB_WR(x, v) (HW_ENET_RMON_T_JAB(x).U = (v))
#define HW_ENET_RMON_T_JAB_SET(x, v) (HW_ENET_RMON_T_JAB_WR(x, HW_ENET_RMON_T_JAB_RD(x) |  (v)))
#define HW_ENET_RMON_T_JAB_CLR(x, v) (HW_ENET_RMON_T_JAB_WR(x, HW_ENET_RMON_T_JAB_RD(x) & ~(v)))
#define HW_ENET_RMON_T_JAB_TOG(x, v) (HW_ENET_RMON_T_JAB_WR(x, HW_ENET_RMON_T_JAB_RD(x) ^  (v)))
/*@}*/

