theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual ENET_RMON_T_JAB bitfields
 */

/*!
 * @name Register ENET_RMON_T_JAB, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_JAB_TXPKTS (0U)     /*!< Bit position for ENET_RMON_T_JAB_TXPKTS. */
#define BM_ENET_RMON_T_JAB_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_JAB_TXPKTS. */
#define BS_ENET_RMON_T_JAB_TXPKTS (16U)    /*!< Bit field size in bits for ENET_RMON_T_JAB_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_JAB_TXPKTS field. */
#define BR_ENET_RMON_T_JAB_TXPKTS(x) (HW_ENET_RMON_T_JAB(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_COL - RMON Tx collision count (RMON_T_COL)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_COL - RMON Tx collision count (RMON_T_COL) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_col
{
    uint32_t U;
    struct _hw_enet_rmon_t_col_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_col_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_COL register
 */
/*@{*/
#define HW_ENET_RMON_T_COL_ADDR(x) ((uint32_t)(x) + 0x224U)

#define HW_ENET_RMON_T_COL(x)    (*(__IO hw_enet_rmon_t_col_t *) HW_ENET_RMON_T_COL_ADDR(x))
#define HW_ENET_RMON_T_COL_RD(x) (HW_ENET_RMON_T_COL(x).U)
#define HW_ENET_RMON_T_COL_WR(x, v) (HW_ENET_RMON_T_COL(x).U = (v))
#define HW_ENET_RMON_T_COL_SET(x, v) (HW_ENET_RMON_T_COL_WR(x, HW_ENET_RMON_T_COL_RD(x) |  (v)))
#define HW_ENET_RMON_T_COL_CLR(x, v) (HW_ENET_RMON_T_COL_WR(x, HW_ENET_RMON_T_COL_RD(x) & ~(v)))
#define HW_ENET_RMON_T_COL_TOG(x, v) (HW_ENET_RMON_T_COL_WR(x, HW_ENET_RMON_T_COL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_COL bitfields
 */

/*!
 * @name Register ENET_RMON_T_COL, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_COL_TXPKTS (0U)     /*!< Bit position for ENET_RMON_T_COL_TXPKTS. */
#define BM_ENET_RMON_T_COL_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_COL_TXPKTS. */
#define BS_ENET_RMON_T_COL_TXPKTS (16U)    /*!< Bit field size in bits for ENET_RMON_T_COL_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_COL_TXPKTS field. */
#define BR_ENET_RMON_T_COL_TXPKTS(x) (HW_ENET_RMON_T_COL(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_P64 - RMON Tx 64 byte packets (RMON_T_P64)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_P64 - RMON Tx 64 byte packets (RMON_T_P64) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_p64
{
    uint32_t U;
    struct _hw_enet_rmon_t_p64_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_p64_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_P64 register
 */
/*@{*/
#define HW_ENET_RMON_T_P64_ADDR(x) ((uint32_t)(x) + 0x228U)

#define HW_ENET_RMON_T_P64(x)    (*(__IO hw_enet_rmon_t_p64_t *) HW_ENET_RMON_T_P64_ADDR(x))
#define HW_ENET_RMON_T_P64_RD(x) (HW_ENET_RMON_T_P64(x).U)
#define HW_ENET_RMON_T_P64_WR(x, v) (HW_ENET_RMON_T_P64(x).U = (v))
#define HW_ENET_RMON_T_P64_SET(x, v) (HW_ENET_RMON_T_P64_WR(x, HW_ENET_RMON_T_P64_RD(x) |  (v)))
#define HW_ENET_RMON_T_P64_CLR(x, v) (HW_ENET_RMON_T_P64_WR(x, HW_ENET_RMON_T_P64_RD(x) & ~(v)))
#define HW_ENET_RMON_T_P64_TOG(x, v) (HW_ENET_RMON_T_P64_WR(x, HW_ENET_RMON_T_P64_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P64 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P64, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_P64_TXPKTS (0U)     /*!< Bit position for ENET_RMON_T_P64_TXPKTS. */
#define BM_ENET_RMON_T_P64_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_P64_TXPKTS. */
#define BS_ENET_RMON_T_P64_TXPKTS (16U)    /*!< Bit field size in bits for ENET_RMON_T_P64_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_P64_TXPKTS field. */
#define BR_ENET_RMON_T_P64_TXPKTS(x) (HW_ENET_RMON_T_P64(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_P65TO127 - RMON Tx 65 to 127 byte packets (RMON_T_P65TO127)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_P65TO127 - RMON Tx 65 to 127 byte packets (RMON_T_P65TO127) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_p65to127
{
    uint32_t U;
    struct _hw_enet_rmon_t_p65to127_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_p65to127_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_P65TO127 register
 */
/*@{*/
#define HW_ENET_RMON_T_P65TO127_ADDR(x) ((uint32_t)(x) + 0x22CU)

#define HW_ENET_RMON_T_P65TO127(x) (*(__IO hw_enet_rmon_t_p65to127_t *) HW_ENET_RMON_T_P65TO127_ADDR(x))
#define HW_ENET_RMON_T_P65TO127_RD(x) (HW_ENET_RMON_T_P65TO127(x).U)
#define HW_ENET_RMON_T_P65TO127_WR(x, v) (HW_ENET_RMON_T_P65TO127(x).U = (v))
#define HW_ENET_RMON_T_P65TO127_SET(x, v) (HW_ENET_RMON_T_P65TO127_WR(x, HW_ENET_RMON_T_P65TO127_RD(x) |  (v)))
#define HW_ENET_RMON_T_P65TO127_CLR(x, v) (HW_ENET_RMON_T_P65TO127_WR(x, HW_ENET_RMON_T_P65TO127_RD(x) & ~(v)))
#define HW_ENET_RMON_T_P65TO127_TOG(x, v) (HW_ENET_RMON_T_P65TO127_WR(x, HW_ENET_RMON_T_P65TO127_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P65TO127 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P65TO127, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_P65TO127_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_P65TO127_TXPKTS. */
#define BM_ENET_RMON_T_P65TO127_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_P65TO127_TXPKTS. */
#define BS_ENET_RMON_T_P65TO127_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_P65TO127_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_P65TO127_TXPKTS field. */
#define BR_ENET_RMON_T_P65TO127_TXPKTS(x) (HW_ENET_RMON_T_P65TO127(x).B.TXPKTS)
/*@}*/

