theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*******************************************************************************
 * HW_ENET_RMON_T_P128TO255 - RMON Tx 128 to 255 byte packets (RMON_T_P128TO255)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_P128TO255 - RMON Tx 128 to 255 byte packets (RMON_T_P128TO255) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_p128to255
{
    uint32_t U;
    struct _hw_enet_rmon_t_p128to255_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_p128to255_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_P128TO255 register
 */
/*@{*/
#define HW_ENET_RMON_T_P128TO255_ADDR(x) ((uint32_t)(x) + 0x230U)

#define HW_ENET_RMON_T_P128TO255(x) (*(__IO hw_enet_rmon_t_p128to255_t *) HW_ENET_RMON_T_P128TO255_ADDR(x))
#define HW_ENET_RMON_T_P128TO255_RD(x) (HW_ENET_RMON_T_P128TO255(x).U)
#define HW_ENET_RMON_T_P128TO255_WR(x, v) (HW_ENET_RMON_T_P128TO255(x).U = (v))
#define HW_ENET_RMON_T_P128TO255_SET(x, v) (HW_ENET_RMON_T_P128TO255_WR(x, HW_ENET_RMON_T_P128TO255_RD(x) |  (v)))
#define HW_ENET_RMON_T_P128TO255_CLR(x, v) (HW_ENET_RMON_T_P128TO255_WR(x, HW_ENET_RMON_T_P128TO255_RD(x) & ~(v)))
#define HW_ENET_RMON_T_P128TO255_TOG(x, v) (HW_ENET_RMON_T_P128TO255_WR(x, HW_ENET_RMON_T_P128TO255_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P128TO255 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P128TO255, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_P128TO255_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_P128TO255_TXPKTS. */
#define BM_ENET_RMON_T_P128TO255_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_P128TO255_TXPKTS. */
#define BS_ENET_RMON_T_P128TO255_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_P128TO255_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_P128TO255_TXPKTS field. */
#define BR_ENET_RMON_T_P128TO255_TXPKTS(x) (HW_ENET_RMON_T_P128TO255(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_P256TO511 - RMON Tx 256 to 511 byte packets (RMON_T_P256TO511)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_P256TO511 - RMON Tx 256 to 511 byte packets (RMON_T_P256TO511) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_p256to511
{
    uint32_t U;
    struct _hw_enet_rmon_t_p256to511_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_p256to511_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_P256TO511 register
 */
/*@{*/
#define HW_ENET_RMON_T_P256TO511_ADDR(x) ((uint32_t)(x) + 0x234U)

#define HW_ENET_RMON_T_P256TO511(x) (*(__IO hw_enet_rmon_t_p256to511_t *) HW_ENET_RMON_T_P256TO511_ADDR(x))
#define HW_ENET_RMON_T_P256TO511_RD(x) (HW_ENET_RMON_T_P256TO511(x).U)
#define HW_ENET_RMON_T_P256TO511_WR(x, v) (HW_ENET_RMON_T_P256TO511(x).U = (v))
#define HW_ENET_RMON_T_P256TO511_SET(x, v) (HW_ENET_RMON_T_P256TO511_WR(x, HW_ENET_RMON_T_P256TO511_RD(x) |  (v)))
#define HW_ENET_RMON_T_P256TO511_CLR(x, v) (HW_ENET_RMON_T_P256TO511_WR(x, HW_ENET_RMON_T_P256TO511_RD(x) & ~(v)))
#define HW_ENET_RMON_T_P256TO511_TOG(x, v) (HW_ENET_RMON_T_P256TO511_WR(x, HW_ENET_RMON_T_P256TO511_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P256TO511 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P256TO511, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_P256TO511_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_P256TO511_TXPKTS. */
#define BM_ENET_RMON_T_P256TO511_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_P256TO511_TXPKTS. */
#define BS_ENET_RMON_T_P256TO511_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_P256TO511_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_P256TO511_TXPKTS field. */
#define BR_ENET_RMON_T_P256TO511_TXPKTS(x) (HW_ENET_RMON_T_P256TO511(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_P512TO1023 - RMON Tx 512 to 1023 byte packets (RMON_T_P512TO1023)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_P512TO1023 - RMON Tx 512 to 1023 byte packets (RMON_T_P512TO1023) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_p512to1023
{
    uint32_t U;
    struct _hw_enet_rmon_t_p512to1023_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_p512to1023_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_P512TO1023 register
 */
/*@{*/
#define HW_ENET_RMON_T_P512TO1023_ADDR(x) ((uint32_t)(x) + 0x238U)

#define HW_ENET_RMON_T_P512TO1023(x) (*(__IO hw_enet_rmon_t_p512to1023_t *) HW_ENET_RMON_T_P512TO1023_ADDR(x))
#define HW_ENET_RMON_T_P512TO1023_RD(x) (HW_ENET_RMON_T_P512TO1023(x).U)
#define HW_ENET_RMON_T_P512TO1023_WR(x, v) (HW_ENET_RMON_T_P512TO1023(x).U = (v))
#define HW_ENET_RMON_T_P512TO1023_SET(x, v) (HW_ENET_RMON_T_P512TO1023_WR(x, HW_ENET_RMON_T_P512TO1023_RD(x) |  (v)))
#define HW_ENET_RMON_T_P512TO1023_CLR(x, v) (HW_ENET_RMON_T_P512TO1023_WR(x, HW_ENET_RMON_T_P512TO1023_RD(x) & ~(v)))
#define HW_ENET_RMON_T_P512TO1023_TOG(x, v) (HW_ENET_RMON_T_P512TO1023_WR(x, HW_ENET_RMON_T_P512TO1023_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P512TO1023 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P512TO1023, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_P512TO1023_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_P512TO1023_TXPKTS. */
#define BM_ENET_RMON_T_P512TO1023_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_P512TO1023_TXPKTS. */
#define BS_ENET_RMON_T_P512TO1023_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_P512TO1023_TXPKTS. */

