theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the ENET_RMON_T_P512TO1023_TXPKTS field. */
#define BR_ENET_RMON_T_P512TO1023_TXPKTS(x) (HW_ENET_RMON_T_P512TO1023(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_P1024TO2047 - RMON Tx 1024 to 2047 byte packets (RMON_T_P1024TO2047)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_P1024TO2047 - RMON Tx 1024 to 2047 byte packets (RMON_T_P1024TO2047) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_p1024to2047
{
    uint32_t U;
    struct _hw_enet_rmon_t_p1024to2047_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_p1024to2047_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_P1024TO2047 register
 */
/*@{*/
#define HW_ENET_RMON_T_P1024TO2047_ADDR(x) ((uint32_t)(x) + 0x23CU)

#define HW_ENET_RMON_T_P1024TO2047(x) (*(__IO hw_enet_rmon_t_p1024to2047_t *) HW_ENET_RMON_T_P1024TO2047_ADDR(x))
#define HW_ENET_RMON_T_P1024TO2047_RD(x) (HW_ENET_RMON_T_P1024TO2047(x).U)
#define HW_ENET_RMON_T_P1024TO2047_WR(x, v) (HW_ENET_RMON_T_P1024TO2047(x).U = (v))
#define HW_ENET_RMON_T_P1024TO2047_SET(x, v) (HW_ENET_RMON_T_P1024TO2047_WR(x, HW_ENET_RMON_T_P1024TO2047_RD(x) |  (v)))
#define HW_ENET_RMON_T_P1024TO2047_CLR(x, v) (HW_ENET_RMON_T_P1024TO2047_WR(x, HW_ENET_RMON_T_P1024TO2047_RD(x) & ~(v)))
#define HW_ENET_RMON_T_P1024TO2047_TOG(x, v) (HW_ENET_RMON_T_P1024TO2047_WR(x, HW_ENET_RMON_T_P1024TO2047_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P1024TO2047 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P1024TO2047, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_P1024TO2047_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_P1024TO2047_TXPKTS. */
#define BM_ENET_RMON_T_P1024TO2047_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_P1024TO2047_TXPKTS. */
#define BS_ENET_RMON_T_P1024TO2047_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_P1024TO2047_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_P1024TO2047_TXPKTS field. */
#define BR_ENET_RMON_T_P1024TO2047_TXPKTS(x) (HW_ENET_RMON_T_P1024TO2047(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_P_GTE2048 - RMON Tx packets w > 2048 bytes (RMON_T_P_GTE2048)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_P_GTE2048 - RMON Tx packets w > 2048 bytes (RMON_T_P_GTE2048) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_p_gte2048
{
    uint32_t U;
    struct _hw_enet_rmon_t_p_gte2048_bitfields
    {
        uint32_t TXPKTS : 16;          /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_t_p_gte2048_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_P_GTE2048 register
 */
/*@{*/
#define HW_ENET_RMON_T_P_GTE2048_ADDR(x) ((uint32_t)(x) + 0x240U)

#define HW_ENET_RMON_T_P_GTE2048(x) (*(__IO hw_enet_rmon_t_p_gte2048_t *) HW_ENET_RMON_T_P_GTE2048_ADDR(x))
#define HW_ENET_RMON_T_P_GTE2048_RD(x) (HW_ENET_RMON_T_P_GTE2048(x).U)
#define HW_ENET_RMON_T_P_GTE2048_WR(x, v) (HW_ENET_RMON_T_P_GTE2048(x).U = (v))
#define HW_ENET_RMON_T_P_GTE2048_SET(x, v) (HW_ENET_RMON_T_P_GTE2048_WR(x, HW_ENET_RMON_T_P_GTE2048_RD(x) |  (v)))
#define HW_ENET_RMON_T_P_GTE2048_CLR(x, v) (HW_ENET_RMON_T_P_GTE2048_WR(x, HW_ENET_RMON_T_P_GTE2048_RD(x) & ~(v)))
#define HW_ENET_RMON_T_P_GTE2048_TOG(x, v) (HW_ENET_RMON_T_P_GTE2048_WR(x, HW_ENET_RMON_T_P_GTE2048_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_P_GTE2048 bitfields
 */

/*!
 * @name Register ENET_RMON_T_P_GTE2048, field TXPKTS[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_P_GTE2048_TXPKTS (0U) /*!< Bit position for ENET_RMON_T_P_GTE2048_TXPKTS. */
#define BM_ENET_RMON_T_P_GTE2048_TXPKTS (0x0000FFFFU) /*!< Bit mask for ENET_RMON_T_P_GTE2048_TXPKTS. */
#define BS_ENET_RMON_T_P_GTE2048_TXPKTS (16U) /*!< Bit field size in bits for ENET_RMON_T_P_GTE2048_TXPKTS. */

/*! @brief Read current value of the ENET_RMON_T_P_GTE2048_TXPKTS field. */
#define BR_ENET_RMON_T_P_GTE2048_TXPKTS(x) (HW_ENET_RMON_T_P_GTE2048(x).B.TXPKTS)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_T_OCTETS - RMON Tx Octets (RMON_T_OCTETS)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_T_OCTETS - RMON Tx Octets (RMON_T_OCTETS) (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_t_octets
{
    uint32_t U;
    struct _hw_enet_rmon_t_octets_bitfields
    {
        uint32_t TXOCTS : 32;          /*!< [31:0] Octet count */
    } B;
} hw_enet_rmon_t_octets_t;

/*!
 * @name Constants and macros for entire ENET_RMON_T_OCTETS register
 */
/*@{*/
#define HW_ENET_RMON_T_OCTETS_ADDR(x) ((uint32_t)(x) + 0x244U)

#define HW_ENET_RMON_T_OCTETS(x) (*(__I hw_enet_rmon_t_octets_t *) HW_ENET_RMON_T_OCTETS_ADDR(x))
#define HW_ENET_RMON_T_OCTETS_RD(x) (HW_ENET_RMON_T_OCTETS(x).U)
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_OCTETS bitfields
 */

/*!
 * @name Register ENET_RMON_T_OCTETS, field TXOCTS[31:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_T_OCTETS_TXOCTS (0U)  /*!< Bit position for ENET_RMON_T_OCTETS_TXOCTS. */
#define BM_ENET_RMON_T_OCTETS_TXOCTS (0xFFFFFFFFU) /*!< Bit mask for ENET_RMON_T_OCTETS_TXOCTS. */
#define BS_ENET_RMON_T_OCTETS_TXOCTS (32U) /*!< Bit field size in bits for ENET_RMON_T_OCTETS_TXOCTS. */

/*! @brief Read current value of the ENET_RMON_T_OCTETS_TXOCTS field. */
#define BR_ENET_RMON_T_OCTETS_TXOCTS(x) (HW_ENET_RMON_T_OCTETS(x).U)
/*@}*/

/*******************************************************************************
 * HW_ENET_IEEE_T_DROP - Count of frames not counted correctly (IEEE_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable.
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_T_DROP - Count of frames not counted correctly (IEEE_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable. (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_t_drop
{
    uint32_t U;
    struct _hw_enet_ieee_t_drop_bitfields
    {
        uint32_t RESERVED0 : 32;       /*!< [31:0]  */
    } B;
} hw_enet_ieee_t_drop_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_T_DROP register
 */
/*@{*/
#define HW_ENET_IEEE_T_DROP_ADDR(x) ((uint32_t)(x) + 0x248U)

#define HW_ENET_IEEE_T_DROP(x)   (*(__IO hw_enet_ieee_t_drop_t *) HW_ENET_IEEE_T_DROP_ADDR(x))
#define HW_ENET_IEEE_T_DROP_RD(x) (HW_ENET_IEEE_T_DROP(x).U)
#define HW_ENET_IEEE_T_DROP_WR(x, v) (HW_ENET_IEEE_T_DROP(x).U = (v))
#define HW_ENET_IEEE_T_DROP_SET(x, v) (HW_ENET_IEEE_T_DROP_WR(x, HW_ENET_IEEE_T_DROP_RD(x) |  (v)))
#define HW_ENET_IEEE_T_DROP_CLR(x, v) (HW_ENET_IEEE_T_DROP_WR(x, HW_ENET_IEEE_T_DROP_RD(x) & ~(v)))
#define HW_ENET_IEEE_T_DROP_TOG(x, v) (HW_ENET_IEEE_T_DROP_WR(x, HW_ENET_IEEE_T_DROP_RD(x) ^  (v)))
/*@}*/

