theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual ENET_IEEE_T_DROP bitfields
 */

/*******************************************************************************
 * HW_ENET_IEEE_T_FRAME_OK - Frames Transmitted OK (IEEE_T_FRAME_OK)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_T_FRAME_OK - Frames Transmitted OK (IEEE_T_FRAME_OK) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_t_frame_ok
{
    uint32_t U;
    struct _hw_enet_ieee_t_frame_ok_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Frame count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_t_frame_ok_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_T_FRAME_OK register
 */
/*@{*/
#define HW_ENET_IEEE_T_FRAME_OK_ADDR(x) ((uint32_t)(x) + 0x24CU)

#define HW_ENET_IEEE_T_FRAME_OK(x) (*(__IO hw_enet_ieee_t_frame_ok_t *) HW_ENET_IEEE_T_FRAME_OK_ADDR(x))
#define HW_ENET_IEEE_T_FRAME_OK_RD(x) (HW_ENET_IEEE_T_FRAME_OK(x).U)
#define HW_ENET_IEEE_T_FRAME_OK_WR(x, v) (HW_ENET_IEEE_T_FRAME_OK(x).U = (v))
#define HW_ENET_IEEE_T_FRAME_OK_SET(x, v) (HW_ENET_IEEE_T_FRAME_OK_WR(x, HW_ENET_IEEE_T_FRAME_OK_RD(x) |  (v)))
#define HW_ENET_IEEE_T_FRAME_OK_CLR(x, v) (HW_ENET_IEEE_T_FRAME_OK_WR(x, HW_ENET_IEEE_T_FRAME_OK_RD(x) & ~(v)))
#define HW_ENET_IEEE_T_FRAME_OK_TOG(x, v) (HW_ENET_IEEE_T_FRAME_OK_WR(x, HW_ENET_IEEE_T_FRAME_OK_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_FRAME_OK bitfields
 */

/*!
 * @name Register ENET_IEEE_T_FRAME_OK, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_IEEE_T_FRAME_OK_COUNT (0U) /*!< Bit position for ENET_IEEE_T_FRAME_OK_COUNT. */
#define BM_ENET_IEEE_T_FRAME_OK_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_IEEE_T_FRAME_OK_COUNT. */
#define BS_ENET_IEEE_T_FRAME_OK_COUNT (16U) /*!< Bit field size in bits for ENET_IEEE_T_FRAME_OK_COUNT. */

/*! @brief Read current value of the ENET_IEEE_T_FRAME_OK_COUNT field. */
#define BR_ENET_IEEE_T_FRAME_OK_COUNT(x) (HW_ENET_IEEE_T_FRAME_OK(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_IEEE_T_1COL - Frames Transmitted with Single Collision (IEEE_T_1COL)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_T_1COL - Frames Transmitted with Single Collision (IEEE_T_1COL) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_t_1col
{
    uint32_t U;
    struct _hw_enet_ieee_t_1col_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Frame count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_t_1col_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_T_1COL register
 */
/*@{*/
#define HW_ENET_IEEE_T_1COL_ADDR(x) ((uint32_t)(x) + 0x250U)

#define HW_ENET_IEEE_T_1COL(x)   (*(__IO hw_enet_ieee_t_1col_t *) HW_ENET_IEEE_T_1COL_ADDR(x))
#define HW_ENET_IEEE_T_1COL_RD(x) (HW_ENET_IEEE_T_1COL(x).U)
#define HW_ENET_IEEE_T_1COL_WR(x, v) (HW_ENET_IEEE_T_1COL(x).U = (v))
#define HW_ENET_IEEE_T_1COL_SET(x, v) (HW_ENET_IEEE_T_1COL_WR(x, HW_ENET_IEEE_T_1COL_RD(x) |  (v)))
#define HW_ENET_IEEE_T_1COL_CLR(x, v) (HW_ENET_IEEE_T_1COL_WR(x, HW_ENET_IEEE_T_1COL_RD(x) & ~(v)))
#define HW_ENET_IEEE_T_1COL_TOG(x, v) (HW_ENET_IEEE_T_1COL_WR(x, HW_ENET_IEEE_T_1COL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_1COL bitfields
 */

/*!
 * @name Register ENET_IEEE_T_1COL, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_IEEE_T_1COL_COUNT (0U)     /*!< Bit position for ENET_IEEE_T_1COL_COUNT. */
#define BM_ENET_IEEE_T_1COL_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_IEEE_T_1COL_COUNT. */
#define BS_ENET_IEEE_T_1COL_COUNT (16U)    /*!< Bit field size in bits for ENET_IEEE_T_1COL_COUNT. */

/*! @brief Read current value of the ENET_IEEE_T_1COL_COUNT field. */
#define BR_ENET_IEEE_T_1COL_COUNT(x) (HW_ENET_IEEE_T_1COL(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_IEEE_T_MCOL - Frames Transmitted with Multiple Collisions (IEEE_T_MCOL)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_T_MCOL - Frames Transmitted with Multiple Collisions (IEEE_T_MCOL) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_t_mcol
{
    uint32_t U;
    struct _hw_enet_ieee_t_mcol_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Frame count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_t_mcol_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_T_MCOL register
 */
/*@{*/
#define HW_ENET_IEEE_T_MCOL_ADDR(x) ((uint32_t)(x) + 0x254U)

#define HW_ENET_IEEE_T_MCOL(x)   (*(__IO hw_enet_ieee_t_mcol_t *) HW_ENET_IEEE_T_MCOL_ADDR(x))
#define HW_ENET_IEEE_T_MCOL_RD(x) (HW_ENET_IEEE_T_MCOL(x).U)
#define HW_ENET_IEEE_T_MCOL_WR(x, v) (HW_ENET_IEEE_T_MCOL(x).U = (v))
#define HW_ENET_IEEE_T_MCOL_SET(x, v) (HW_ENET_IEEE_T_MCOL_WR(x, HW_ENET_IEEE_T_MCOL_RD(x) |  (v)))
#define HW_ENET_IEEE_T_MCOL_CLR(x, v) (HW_ENET_IEEE_T_MCOL_WR(x, HW_ENET_IEEE_T_MCOL_RD(x) & ~(v)))
#define HW_ENET_IEEE_T_MCOL_TOG(x, v) (HW_ENET_IEEE_T_MCOL_WR(x, HW_ENET_IEEE_T_MCOL_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_MCOL bitfields
 */

/*!
 * @name Register ENET_IEEE_T_MCOL, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_IEEE_T_MCOL_COUNT (0U)     /*!< Bit position for ENET_IEEE_T_MCOL_COUNT. */
#define BM_ENET_IEEE_T_MCOL_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_IEEE_T_MCOL_COUNT. */
#define BS_ENET_IEEE_T_MCOL_COUNT (16U)    /*!< Bit field size in bits for ENET_IEEE_T_MCOL_COUNT. */

/*! @brief Read current value of the ENET_IEEE_T_MCOL_COUNT field. */
#define BR_ENET_IEEE_T_MCOL_COUNT(x) (HW_ENET_IEEE_T_MCOL(x).B.COUNT)
/*@}*/

