theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
#define HW_ENET_IEEE_T_MACERR(x) (*(__IO hw_enet_ieee_t_macerr_t *) HW_ENET_IEEE_T_MACERR_ADDR(x))
#define HW_ENET_IEEE_T_MACERR_RD(x) (HW_ENET_IEEE_T_MACERR(x).U)
#define HW_ENET_IEEE_T_MACERR_WR(x, v) (HW_ENET_IEEE_T_MACERR(x).U = (v))
#define HW_ENET_IEEE_T_MACERR_SET(x, v) (HW_ENET_IEEE_T_MACERR_WR(x, HW_ENET_IEEE_T_MACERR_RD(x) |  (v)))
#define HW_ENET_IEEE_T_MACERR_CLR(x, v) (HW_ENET_IEEE_T_MACERR_WR(x, HW_ENET_IEEE_T_MACERR_RD(x) & ~(v)))
#define HW_ENET_IEEE_T_MACERR_TOG(x, v) (HW_ENET_IEEE_T_MACERR_WR(x, HW_ENET_IEEE_T_MACERR_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_MACERR bitfields
 */

/*!
 * @name Register ENET_IEEE_T_MACERR, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_IEEE_T_MACERR_COUNT (0U)   /*!< Bit position for ENET_IEEE_T_MACERR_COUNT. */
#define BM_ENET_IEEE_T_MACERR_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_IEEE_T_MACERR_COUNT. */
#define BS_ENET_IEEE_T_MACERR_COUNT (16U)  /*!< Bit field size in bits for ENET_IEEE_T_MACERR_COUNT. */

/*! @brief Read current value of the ENET_IEEE_T_MACERR_COUNT field. */
#define BR_ENET_IEEE_T_MACERR_COUNT(x) (HW_ENET_IEEE_T_MACERR(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_IEEE_T_CSERR - Frames Transmitted with Carrier Sense Error (IEEE_T_CSERR)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_T_CSERR - Frames Transmitted with Carrier Sense Error (IEEE_T_CSERR) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_t_cserr
{
    uint32_t U;
    struct _hw_enet_ieee_t_cserr_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Frame count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_t_cserr_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_T_CSERR register
 */
/*@{*/
#define HW_ENET_IEEE_T_CSERR_ADDR(x) ((uint32_t)(x) + 0x268U)

#define HW_ENET_IEEE_T_CSERR(x)  (*(__IO hw_enet_ieee_t_cserr_t *) HW_ENET_IEEE_T_CSERR_ADDR(x))
#define HW_ENET_IEEE_T_CSERR_RD(x) (HW_ENET_IEEE_T_CSERR(x).U)
#define HW_ENET_IEEE_T_CSERR_WR(x, v) (HW_ENET_IEEE_T_CSERR(x).U = (v))
#define HW_ENET_IEEE_T_CSERR_SET(x, v) (HW_ENET_IEEE_T_CSERR_WR(x, HW_ENET_IEEE_T_CSERR_RD(x) |  (v)))
#define HW_ENET_IEEE_T_CSERR_CLR(x, v) (HW_ENET_IEEE_T_CSERR_WR(x, HW_ENET_IEEE_T_CSERR_RD(x) & ~(v)))
#define HW_ENET_IEEE_T_CSERR_TOG(x, v) (HW_ENET_IEEE_T_CSERR_WR(x, HW_ENET_IEEE_T_CSERR_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_CSERR bitfields
 */

/*!
 * @name Register ENET_IEEE_T_CSERR, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_IEEE_T_CSERR_COUNT (0U)    /*!< Bit position for ENET_IEEE_T_CSERR_COUNT. */
#define BM_ENET_IEEE_T_CSERR_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_IEEE_T_CSERR_COUNT. */
#define BS_ENET_IEEE_T_CSERR_COUNT (16U)   /*!< Bit field size in bits for ENET_IEEE_T_CSERR_COUNT. */

/*! @brief Read current value of the ENET_IEEE_T_CSERR_COUNT field. */
#define BR_ENET_IEEE_T_CSERR_COUNT(x) (HW_ENET_IEEE_T_CSERR(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_IEEE_T_SQE - Frames Transmitted with SQE Error (IEEE_T_SQE). NOTE: Counter not implemented (read 0 always) as no SQE information is available.
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_T_SQE - Frames Transmitted with SQE Error (IEEE_T_SQE). NOTE: Counter not implemented (read 0 always) as no SQE information is available. (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_t_sqe
{
    uint32_t U;
    struct _hw_enet_ieee_t_sqe_bitfields
    {
        uint32_t RESERVED0 : 32;       /*!< [31:0]  */
    } B;
} hw_enet_ieee_t_sqe_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_T_SQE register
 */
/*@{*/
#define HW_ENET_IEEE_T_SQE_ADDR(x) ((uint32_t)(x) + 0x26CU)

#define HW_ENET_IEEE_T_SQE(x)    (*(__IO hw_enet_ieee_t_sqe_t *) HW_ENET_IEEE_T_SQE_ADDR(x))
#define HW_ENET_IEEE_T_SQE_RD(x) (HW_ENET_IEEE_T_SQE(x).U)
#define HW_ENET_IEEE_T_SQE_WR(x, v) (HW_ENET_IEEE_T_SQE(x).U = (v))
#define HW_ENET_IEEE_T_SQE_SET(x, v) (HW_ENET_IEEE_T_SQE_WR(x, HW_ENET_IEEE_T_SQE_RD(x) |  (v)))
#define HW_ENET_IEEE_T_SQE_CLR(x, v) (HW_ENET_IEEE_T_SQE_WR(x, HW_ENET_IEEE_T_SQE_RD(x) & ~(v)))
#define HW_ENET_IEEE_T_SQE_TOG(x, v) (HW_ENET_IEEE_T_SQE_WR(x, HW_ENET_IEEE_T_SQE_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_SQE bitfields
 */

/*******************************************************************************
 * HW_ENET_IEEE_T_FDXFC - Flow Control Pause frames transmitted (IEEE_T_FDXFC)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_T_FDXFC - Flow Control Pause frames transmitted (IEEE_T_FDXFC) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_t_fdxfc
{
    uint32_t U;
    struct _hw_enet_ieee_t_fdxfc_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Frame count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_t_fdxfc_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_T_FDXFC register
 */
/*@{*/
#define HW_ENET_IEEE_T_FDXFC_ADDR(x) ((uint32_t)(x) + 0x270U)

#define HW_ENET_IEEE_T_FDXFC(x)  (*(__IO hw_enet_ieee_t_fdxfc_t *) HW_ENET_IEEE_T_FDXFC_ADDR(x))
#define HW_ENET_IEEE_T_FDXFC_RD(x) (HW_ENET_IEEE_T_FDXFC(x).U)
#define HW_ENET_IEEE_T_FDXFC_WR(x, v) (HW_ENET_IEEE_T_FDXFC(x).U = (v))
#define HW_ENET_IEEE_T_FDXFC_SET(x, v) (HW_ENET_IEEE_T_FDXFC_WR(x, HW_ENET_IEEE_T_FDXFC_RD(x) |  (v)))
#define HW_ENET_IEEE_T_FDXFC_CLR(x, v) (HW_ENET_IEEE_T_FDXFC_WR(x, HW_ENET_IEEE_T_FDXFC_RD(x) & ~(v)))
#define HW_ENET_IEEE_T_FDXFC_TOG(x, v) (HW_ENET_IEEE_T_FDXFC_WR(x, HW_ENET_IEEE_T_FDXFC_RD(x) ^  (v)))
/*@}*/

