theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the ENET_RMON_R_BC_PKT_COUNT field. */
#define BR_ENET_RMON_R_BC_PKT_COUNT(x) (HW_ENET_RMON_R_BC_PKT(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_MC_PKT - RMON Rx Multicast Packets (RMON_R_MC_PKT)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_MC_PKT - RMON Rx Multicast Packets (RMON_R_MC_PKT) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_mc_pkt
{
    uint32_t U;
    struct _hw_enet_rmon_r_mc_pkt_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_mc_pkt_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_MC_PKT register
 */
/*@{*/
#define HW_ENET_RMON_R_MC_PKT_ADDR(x) ((uint32_t)(x) + 0x28CU)

#define HW_ENET_RMON_R_MC_PKT(x) (*(__IO hw_enet_rmon_r_mc_pkt_t *) HW_ENET_RMON_R_MC_PKT_ADDR(x))
#define HW_ENET_RMON_R_MC_PKT_RD(x) (HW_ENET_RMON_R_MC_PKT(x).U)
#define HW_ENET_RMON_R_MC_PKT_WR(x, v) (HW_ENET_RMON_R_MC_PKT(x).U = (v))
#define HW_ENET_RMON_R_MC_PKT_SET(x, v) (HW_ENET_RMON_R_MC_PKT_WR(x, HW_ENET_RMON_R_MC_PKT_RD(x) |  (v)))
#define HW_ENET_RMON_R_MC_PKT_CLR(x, v) (HW_ENET_RMON_R_MC_PKT_WR(x, HW_ENET_RMON_R_MC_PKT_RD(x) & ~(v)))
#define HW_ENET_RMON_R_MC_PKT_TOG(x, v) (HW_ENET_RMON_R_MC_PKT_WR(x, HW_ENET_RMON_R_MC_PKT_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_MC_PKT bitfields
 */

/*!
 * @name Register ENET_RMON_R_MC_PKT, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_MC_PKT_COUNT (0U)   /*!< Bit position for ENET_RMON_R_MC_PKT_COUNT. */
#define BM_ENET_RMON_R_MC_PKT_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_MC_PKT_COUNT. */
#define BS_ENET_RMON_R_MC_PKT_COUNT (16U)  /*!< Bit field size in bits for ENET_RMON_R_MC_PKT_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_MC_PKT_COUNT field. */
#define BR_ENET_RMON_R_MC_PKT_COUNT(x) (HW_ENET_RMON_R_MC_PKT(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_CRC_ALIGN - RMON Rx Packets w CRC/Align error (RMON_R_CRC_ALIGN)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_CRC_ALIGN - RMON Rx Packets w CRC/Align error (RMON_R_CRC_ALIGN) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_crc_align
{
    uint32_t U;
    struct _hw_enet_rmon_r_crc_align_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_crc_align_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_CRC_ALIGN register
 */
/*@{*/
#define HW_ENET_RMON_R_CRC_ALIGN_ADDR(x) ((uint32_t)(x) + 0x290U)

#define HW_ENET_RMON_R_CRC_ALIGN(x) (*(__IO hw_enet_rmon_r_crc_align_t *) HW_ENET_RMON_R_CRC_ALIGN_ADDR(x))
#define HW_ENET_RMON_R_CRC_ALIGN_RD(x) (HW_ENET_RMON_R_CRC_ALIGN(x).U)
#define HW_ENET_RMON_R_CRC_ALIGN_WR(x, v) (HW_ENET_RMON_R_CRC_ALIGN(x).U = (v))
#define HW_ENET_RMON_R_CRC_ALIGN_SET(x, v) (HW_ENET_RMON_R_CRC_ALIGN_WR(x, HW_ENET_RMON_R_CRC_ALIGN_RD(x) |  (v)))
#define HW_ENET_RMON_R_CRC_ALIGN_CLR(x, v) (HW_ENET_RMON_R_CRC_ALIGN_WR(x, HW_ENET_RMON_R_CRC_ALIGN_RD(x) & ~(v)))
#define HW_ENET_RMON_R_CRC_ALIGN_TOG(x, v) (HW_ENET_RMON_R_CRC_ALIGN_WR(x, HW_ENET_RMON_R_CRC_ALIGN_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_CRC_ALIGN bitfields
 */

/*!
 * @name Register ENET_RMON_R_CRC_ALIGN, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_CRC_ALIGN_COUNT (0U) /*!< Bit position for ENET_RMON_R_CRC_ALIGN_COUNT. */
#define BM_ENET_RMON_R_CRC_ALIGN_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_CRC_ALIGN_COUNT. */
#define BS_ENET_RMON_R_CRC_ALIGN_COUNT (16U) /*!< Bit field size in bits for ENET_RMON_R_CRC_ALIGN_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_CRC_ALIGN_COUNT field. */
#define BR_ENET_RMON_R_CRC_ALIGN_COUNT(x) (HW_ENET_RMON_R_CRC_ALIGN(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_UNDERSIZE - RMON Rx Packets < 64 bytes, good CRC (RMON_R_UNDERSIZE)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_UNDERSIZE - RMON Rx Packets < 64 bytes, good CRC (RMON_R_UNDERSIZE) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_undersize
{
    uint32_t U;
    struct _hw_enet_rmon_r_undersize_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_undersize_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_UNDERSIZE register
 */
/*@{*/
#define HW_ENET_RMON_R_UNDERSIZE_ADDR(x) ((uint32_t)(x) + 0x294U)

#define HW_ENET_RMON_R_UNDERSIZE(x) (*(__IO hw_enet_rmon_r_undersize_t *) HW_ENET_RMON_R_UNDERSIZE_ADDR(x))
#define HW_ENET_RMON_R_UNDERSIZE_RD(x) (HW_ENET_RMON_R_UNDERSIZE(x).U)
#define HW_ENET_RMON_R_UNDERSIZE_WR(x, v) (HW_ENET_RMON_R_UNDERSIZE(x).U = (v))
#define HW_ENET_RMON_R_UNDERSIZE_SET(x, v) (HW_ENET_RMON_R_UNDERSIZE_WR(x, HW_ENET_RMON_R_UNDERSIZE_RD(x) |  (v)))
#define HW_ENET_RMON_R_UNDERSIZE_CLR(x, v) (HW_ENET_RMON_R_UNDERSIZE_WR(x, HW_ENET_RMON_R_UNDERSIZE_RD(x) & ~(v)))
#define HW_ENET_RMON_R_UNDERSIZE_TOG(x, v) (HW_ENET_RMON_R_UNDERSIZE_WR(x, HW_ENET_RMON_R_UNDERSIZE_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_UNDERSIZE bitfields
 */

/*!
 * @name Register ENET_RMON_R_UNDERSIZE, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_UNDERSIZE_COUNT (0U) /*!< Bit position for ENET_RMON_R_UNDERSIZE_COUNT. */
#define BM_ENET_RMON_R_UNDERSIZE_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_UNDERSIZE_COUNT. */
#define BS_ENET_RMON_R_UNDERSIZE_COUNT (16U) /*!< Bit field size in bits for ENET_RMON_R_UNDERSIZE_COUNT. */

