theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the ENET_RMON_R_UNDERSIZE_COUNT field. */
#define BR_ENET_RMON_R_UNDERSIZE_COUNT(x) (HW_ENET_RMON_R_UNDERSIZE(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_OVERSIZE - RMON Rx Packets > MAX_FL bytes, good CRC (RMON_R_OVERSIZE)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_OVERSIZE - RMON Rx Packets > MAX_FL bytes, good CRC (RMON_R_OVERSIZE) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_oversize
{
    uint32_t U;
    struct _hw_enet_rmon_r_oversize_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_oversize_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_OVERSIZE register
 */
/*@{*/
#define HW_ENET_RMON_R_OVERSIZE_ADDR(x) ((uint32_t)(x) + 0x298U)

#define HW_ENET_RMON_R_OVERSIZE(x) (*(__IO hw_enet_rmon_r_oversize_t *) HW_ENET_RMON_R_OVERSIZE_ADDR(x))
#define HW_ENET_RMON_R_OVERSIZE_RD(x) (HW_ENET_RMON_R_OVERSIZE(x).U)
#define HW_ENET_RMON_R_OVERSIZE_WR(x, v) (HW_ENET_RMON_R_OVERSIZE(x).U = (v))
#define HW_ENET_RMON_R_OVERSIZE_SET(x, v) (HW_ENET_RMON_R_OVERSIZE_WR(x, HW_ENET_RMON_R_OVERSIZE_RD(x) |  (v)))
#define HW_ENET_RMON_R_OVERSIZE_CLR(x, v) (HW_ENET_RMON_R_OVERSIZE_WR(x, HW_ENET_RMON_R_OVERSIZE_RD(x) & ~(v)))
#define HW_ENET_RMON_R_OVERSIZE_TOG(x, v) (HW_ENET_RMON_R_OVERSIZE_WR(x, HW_ENET_RMON_R_OVERSIZE_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_OVERSIZE bitfields
 */

/*!
 * @name Register ENET_RMON_R_OVERSIZE, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_OVERSIZE_COUNT (0U) /*!< Bit position for ENET_RMON_R_OVERSIZE_COUNT. */
#define BM_ENET_RMON_R_OVERSIZE_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_OVERSIZE_COUNT. */
#define BS_ENET_RMON_R_OVERSIZE_COUNT (16U) /*!< Bit field size in bits for ENET_RMON_R_OVERSIZE_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_OVERSIZE_COUNT field. */
#define BR_ENET_RMON_R_OVERSIZE_COUNT(x) (HW_ENET_RMON_R_OVERSIZE(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_FRAG - RMON Rx Packets < 64 bytes, bad CRC (RMON_R_FRAG)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_FRAG - RMON Rx Packets < 64 bytes, bad CRC (RMON_R_FRAG) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_frag
{
    uint32_t U;
    struct _hw_enet_rmon_r_frag_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_frag_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_FRAG register
 */
/*@{*/
#define HW_ENET_RMON_R_FRAG_ADDR(x) ((uint32_t)(x) + 0x29CU)

#define HW_ENET_RMON_R_FRAG(x)   (*(__IO hw_enet_rmon_r_frag_t *) HW_ENET_RMON_R_FRAG_ADDR(x))
#define HW_ENET_RMON_R_FRAG_RD(x) (HW_ENET_RMON_R_FRAG(x).U)
#define HW_ENET_RMON_R_FRAG_WR(x, v) (HW_ENET_RMON_R_FRAG(x).U = (v))
#define HW_ENET_RMON_R_FRAG_SET(x, v) (HW_ENET_RMON_R_FRAG_WR(x, HW_ENET_RMON_R_FRAG_RD(x) |  (v)))
#define HW_ENET_RMON_R_FRAG_CLR(x, v) (HW_ENET_RMON_R_FRAG_WR(x, HW_ENET_RMON_R_FRAG_RD(x) & ~(v)))
#define HW_ENET_RMON_R_FRAG_TOG(x, v) (HW_ENET_RMON_R_FRAG_WR(x, HW_ENET_RMON_R_FRAG_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_FRAG bitfields
 */

/*!
 * @name Register ENET_RMON_R_FRAG, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_FRAG_COUNT (0U)     /*!< Bit position for ENET_RMON_R_FRAG_COUNT. */
#define BM_ENET_RMON_R_FRAG_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_FRAG_COUNT. */
#define BS_ENET_RMON_R_FRAG_COUNT (16U)    /*!< Bit field size in bits for ENET_RMON_R_FRAG_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_FRAG_COUNT field. */
#define BR_ENET_RMON_R_FRAG_COUNT(x) (HW_ENET_RMON_R_FRAG(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_JAB - RMON Rx Packets > MAX_FL bytes, bad CRC (RMON_R_JAB)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_JAB - RMON Rx Packets > MAX_FL bytes, bad CRC (RMON_R_JAB) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_jab
{
    uint32_t U;
    struct _hw_enet_rmon_r_jab_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_jab_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_JAB register
 */
/*@{*/
#define HW_ENET_RMON_R_JAB_ADDR(x) ((uint32_t)(x) + 0x2A0U)

#define HW_ENET_RMON_R_JAB(x)    (*(__IO hw_enet_rmon_r_jab_t *) HW_ENET_RMON_R_JAB_ADDR(x))
#define HW_ENET_RMON_R_JAB_RD(x) (HW_ENET_RMON_R_JAB(x).U)
#define HW_ENET_RMON_R_JAB_WR(x, v) (HW_ENET_RMON_R_JAB(x).U = (v))
#define HW_ENET_RMON_R_JAB_SET(x, v) (HW_ENET_RMON_R_JAB_WR(x, HW_ENET_RMON_R_JAB_RD(x) |  (v)))
#define HW_ENET_RMON_R_JAB_CLR(x, v) (HW_ENET_RMON_R_JAB_WR(x, HW_ENET_RMON_R_JAB_RD(x) & ~(v)))
#define HW_ENET_RMON_R_JAB_TOG(x, v) (HW_ENET_RMON_R_JAB_WR(x, HW_ENET_RMON_R_JAB_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_JAB bitfields
 */

/*!
 * @name Register ENET_RMON_R_JAB, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_JAB_COUNT (0U)      /*!< Bit position for ENET_RMON_R_JAB_COUNT. */
#define BM_ENET_RMON_R_JAB_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_JAB_COUNT. */
#define BS_ENET_RMON_R_JAB_COUNT (16U)     /*!< Bit field size in bits for ENET_RMON_R_JAB_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_JAB_COUNT field. */
#define BR_ENET_RMON_R_JAB_COUNT(x) (HW_ENET_RMON_R_JAB(x).B.COUNT)
/*@}*/

