theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*******************************************************************************
 * HW_ENET_RMON_R_RESVD_0 - Reserved (RMON_R_RESVD_0)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_RESVD_0 - Reserved (RMON_R_RESVD_0) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_resvd_0
{
    uint32_t U;
    struct _hw_enet_rmon_r_resvd_0_bitfields
    {
        uint32_t RESERVED0 : 32;       /*!< [31:0]  */
    } B;
} hw_enet_rmon_r_resvd_0_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_RESVD_0 register
 */
/*@{*/
#define HW_ENET_RMON_R_RESVD_0_ADDR(x) ((uint32_t)(x) + 0x2A4U)

#define HW_ENET_RMON_R_RESVD_0(x) (*(__IO hw_enet_rmon_r_resvd_0_t *) HW_ENET_RMON_R_RESVD_0_ADDR(x))
#define HW_ENET_RMON_R_RESVD_0_RD(x) (HW_ENET_RMON_R_RESVD_0(x).U)
#define HW_ENET_RMON_R_RESVD_0_WR(x, v) (HW_ENET_RMON_R_RESVD_0(x).U = (v))
#define HW_ENET_RMON_R_RESVD_0_SET(x, v) (HW_ENET_RMON_R_RESVD_0_WR(x, HW_ENET_RMON_R_RESVD_0_RD(x) |  (v)))
#define HW_ENET_RMON_R_RESVD_0_CLR(x, v) (HW_ENET_RMON_R_RESVD_0_WR(x, HW_ENET_RMON_R_RESVD_0_RD(x) & ~(v)))
#define HW_ENET_RMON_R_RESVD_0_TOG(x, v) (HW_ENET_RMON_R_RESVD_0_WR(x, HW_ENET_RMON_R_RESVD_0_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_RESVD_0 bitfields
 */

/*******************************************************************************
 * HW_ENET_RMON_R_P64 - RMON Rx 64 byte packets (RMON_R_P64)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_P64 - RMON Rx 64 byte packets (RMON_R_P64) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_p64
{
    uint32_t U;
    struct _hw_enet_rmon_r_p64_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_p64_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_P64 register
 */
/*@{*/
#define HW_ENET_RMON_R_P64_ADDR(x) ((uint32_t)(x) + 0x2A8U)

#define HW_ENET_RMON_R_P64(x)    (*(__IO hw_enet_rmon_r_p64_t *) HW_ENET_RMON_R_P64_ADDR(x))
#define HW_ENET_RMON_R_P64_RD(x) (HW_ENET_RMON_R_P64(x).U)
#define HW_ENET_RMON_R_P64_WR(x, v) (HW_ENET_RMON_R_P64(x).U = (v))
#define HW_ENET_RMON_R_P64_SET(x, v) (HW_ENET_RMON_R_P64_WR(x, HW_ENET_RMON_R_P64_RD(x) |  (v)))
#define HW_ENET_RMON_R_P64_CLR(x, v) (HW_ENET_RMON_R_P64_WR(x, HW_ENET_RMON_R_P64_RD(x) & ~(v)))
#define HW_ENET_RMON_R_P64_TOG(x, v) (HW_ENET_RMON_R_P64_WR(x, HW_ENET_RMON_R_P64_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P64 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P64, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_P64_COUNT (0U)      /*!< Bit position for ENET_RMON_R_P64_COUNT. */
#define BM_ENET_RMON_R_P64_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_P64_COUNT. */
#define BS_ENET_RMON_R_P64_COUNT (16U)     /*!< Bit field size in bits for ENET_RMON_R_P64_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_P64_COUNT field. */
#define BR_ENET_RMON_R_P64_COUNT(x) (HW_ENET_RMON_R_P64(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_P65TO127 - RMON Rx 65 to 127 byte packets (RMON_R_P65TO127)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_P65TO127 - RMON Rx 65 to 127 byte packets (RMON_R_P65TO127) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_p65to127
{
    uint32_t U;
    struct _hw_enet_rmon_r_p65to127_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_p65to127_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_P65TO127 register
 */
/*@{*/
#define HW_ENET_RMON_R_P65TO127_ADDR(x) ((uint32_t)(x) + 0x2ACU)

#define HW_ENET_RMON_R_P65TO127(x) (*(__IO hw_enet_rmon_r_p65to127_t *) HW_ENET_RMON_R_P65TO127_ADDR(x))
#define HW_ENET_RMON_R_P65TO127_RD(x) (HW_ENET_RMON_R_P65TO127(x).U)
#define HW_ENET_RMON_R_P65TO127_WR(x, v) (HW_ENET_RMON_R_P65TO127(x).U = (v))
#define HW_ENET_RMON_R_P65TO127_SET(x, v) (HW_ENET_RMON_R_P65TO127_WR(x, HW_ENET_RMON_R_P65TO127_RD(x) |  (v)))
#define HW_ENET_RMON_R_P65TO127_CLR(x, v) (HW_ENET_RMON_R_P65TO127_WR(x, HW_ENET_RMON_R_P65TO127_RD(x) & ~(v)))
#define HW_ENET_RMON_R_P65TO127_TOG(x, v) (HW_ENET_RMON_R_P65TO127_WR(x, HW_ENET_RMON_R_P65TO127_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P65TO127 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P65TO127, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_P65TO127_COUNT (0U) /*!< Bit position for ENET_RMON_R_P65TO127_COUNT. */
#define BM_ENET_RMON_R_P65TO127_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_P65TO127_COUNT. */
#define BS_ENET_RMON_R_P65TO127_COUNT (16U) /*!< Bit field size in bits for ENET_RMON_R_P65TO127_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_P65TO127_COUNT field. */
#define BR_ENET_RMON_R_P65TO127_COUNT(x) (HW_ENET_RMON_R_P65TO127(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_P128TO255 - RMON Rx 128 to 255 byte packets (RMON_R_P128TO255)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_P128TO255 - RMON Rx 128 to 255 byte packets (RMON_R_P128TO255) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_p128to255
{
    uint32_t U;
    struct _hw_enet_rmon_r_p128to255_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_p128to255_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_P128TO255 register
 */
/*@{*/
#define HW_ENET_RMON_R_P128TO255_ADDR(x) ((uint32_t)(x) + 0x2B0U)

#define HW_ENET_RMON_R_P128TO255(x) (*(__IO hw_enet_rmon_r_p128to255_t *) HW_ENET_RMON_R_P128TO255_ADDR(x))
#define HW_ENET_RMON_R_P128TO255_RD(x) (HW_ENET_RMON_R_P128TO255(x).U)
#define HW_ENET_RMON_R_P128TO255_WR(x, v) (HW_ENET_RMON_R_P128TO255(x).U = (v))
#define HW_ENET_RMON_R_P128TO255_SET(x, v) (HW_ENET_RMON_R_P128TO255_WR(x, HW_ENET_RMON_R_P128TO255_RD(x) |  (v)))
#define HW_ENET_RMON_R_P128TO255_CLR(x, v) (HW_ENET_RMON_R_P128TO255_WR(x, HW_ENET_RMON_R_P128TO255_RD(x) & ~(v)))
#define HW_ENET_RMON_R_P128TO255_TOG(x, v) (HW_ENET_RMON_R_P128TO255_WR(x, HW_ENET_RMON_R_P128TO255_RD(x) ^  (v)))
/*@}*/

