theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual ENET_RMON_R_P128TO255 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P128TO255, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_P128TO255_COUNT (0U) /*!< Bit position for ENET_RMON_R_P128TO255_COUNT. */
#define BM_ENET_RMON_R_P128TO255_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_P128TO255_COUNT. */
#define BS_ENET_RMON_R_P128TO255_COUNT (16U) /*!< Bit field size in bits for ENET_RMON_R_P128TO255_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_P128TO255_COUNT field. */
#define BR_ENET_RMON_R_P128TO255_COUNT(x) (HW_ENET_RMON_R_P128TO255(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_P256TO511 - RMON Rx 256 to 511 byte packets (RMON_R_P256TO511)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_P256TO511 - RMON Rx 256 to 511 byte packets (RMON_R_P256TO511) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_p256to511
{
    uint32_t U;
    struct _hw_enet_rmon_r_p256to511_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_p256to511_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_P256TO511 register
 */
/*@{*/
#define HW_ENET_RMON_R_P256TO511_ADDR(x) ((uint32_t)(x) + 0x2B4U)

#define HW_ENET_RMON_R_P256TO511(x) (*(__IO hw_enet_rmon_r_p256to511_t *) HW_ENET_RMON_R_P256TO511_ADDR(x))
#define HW_ENET_RMON_R_P256TO511_RD(x) (HW_ENET_RMON_R_P256TO511(x).U)
#define HW_ENET_RMON_R_P256TO511_WR(x, v) (HW_ENET_RMON_R_P256TO511(x).U = (v))
#define HW_ENET_RMON_R_P256TO511_SET(x, v) (HW_ENET_RMON_R_P256TO511_WR(x, HW_ENET_RMON_R_P256TO511_RD(x) |  (v)))
#define HW_ENET_RMON_R_P256TO511_CLR(x, v) (HW_ENET_RMON_R_P256TO511_WR(x, HW_ENET_RMON_R_P256TO511_RD(x) & ~(v)))
#define HW_ENET_RMON_R_P256TO511_TOG(x, v) (HW_ENET_RMON_R_P256TO511_WR(x, HW_ENET_RMON_R_P256TO511_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P256TO511 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P256TO511, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_P256TO511_COUNT (0U) /*!< Bit position for ENET_RMON_R_P256TO511_COUNT. */
#define BM_ENET_RMON_R_P256TO511_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_P256TO511_COUNT. */
#define BS_ENET_RMON_R_P256TO511_COUNT (16U) /*!< Bit field size in bits for ENET_RMON_R_P256TO511_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_P256TO511_COUNT field. */
#define BR_ENET_RMON_R_P256TO511_COUNT(x) (HW_ENET_RMON_R_P256TO511(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_P512TO1023 - RMON Rx 512 to 1023 byte packets (RMON_R_P512TO1023)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_P512TO1023 - RMON Rx 512 to 1023 byte packets (RMON_R_P512TO1023) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_p512to1023
{
    uint32_t U;
    struct _hw_enet_rmon_r_p512to1023_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_p512to1023_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_P512TO1023 register
 */
/*@{*/
#define HW_ENET_RMON_R_P512TO1023_ADDR(x) ((uint32_t)(x) + 0x2B8U)

#define HW_ENET_RMON_R_P512TO1023(x) (*(__IO hw_enet_rmon_r_p512to1023_t *) HW_ENET_RMON_R_P512TO1023_ADDR(x))
#define HW_ENET_RMON_R_P512TO1023_RD(x) (HW_ENET_RMON_R_P512TO1023(x).U)
#define HW_ENET_RMON_R_P512TO1023_WR(x, v) (HW_ENET_RMON_R_P512TO1023(x).U = (v))
#define HW_ENET_RMON_R_P512TO1023_SET(x, v) (HW_ENET_RMON_R_P512TO1023_WR(x, HW_ENET_RMON_R_P512TO1023_RD(x) |  (v)))
#define HW_ENET_RMON_R_P512TO1023_CLR(x, v) (HW_ENET_RMON_R_P512TO1023_WR(x, HW_ENET_RMON_R_P512TO1023_RD(x) & ~(v)))
#define HW_ENET_RMON_R_P512TO1023_TOG(x, v) (HW_ENET_RMON_R_P512TO1023_WR(x, HW_ENET_RMON_R_P512TO1023_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P512TO1023 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P512TO1023, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_RMON_R_P512TO1023_COUNT (0U) /*!< Bit position for ENET_RMON_R_P512TO1023_COUNT. */
#define BM_ENET_RMON_R_P512TO1023_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_RMON_R_P512TO1023_COUNT. */
#define BS_ENET_RMON_R_P512TO1023_COUNT (16U) /*!< Bit field size in bits for ENET_RMON_R_P512TO1023_COUNT. */

/*! @brief Read current value of the ENET_RMON_R_P512TO1023_COUNT field. */
#define BR_ENET_RMON_R_P512TO1023_COUNT(x) (HW_ENET_RMON_R_P512TO1023(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_RMON_R_P1024TO2047 - RMON Rx 1024 to 2047 byte packets (RMON_R_P1024TO2047)
 ******************************************************************************/

/*!
 * @brief HW_ENET_RMON_R_P1024TO2047 - RMON Rx 1024 to 2047 byte packets (RMON_R_P1024TO2047) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_rmon_r_p1024to2047
{
    uint32_t U;
    struct _hw_enet_rmon_r_p1024to2047_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Packet count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_rmon_r_p1024to2047_t;

/*!
 * @name Constants and macros for entire ENET_RMON_R_P1024TO2047 register
 */
/*@{*/
#define HW_ENET_RMON_R_P1024TO2047_ADDR(x) ((uint32_t)(x) + 0x2BCU)

#define HW_ENET_RMON_R_P1024TO2047(x) (*(__IO hw_enet_rmon_r_p1024to2047_t *) HW_ENET_RMON_R_P1024TO2047_ADDR(x))
#define HW_ENET_RMON_R_P1024TO2047_RD(x) (HW_ENET_RMON_R_P1024TO2047(x).U)
#define HW_ENET_RMON_R_P1024TO2047_WR(x, v) (HW_ENET_RMON_R_P1024TO2047(x).U = (v))
#define HW_ENET_RMON_R_P1024TO2047_SET(x, v) (HW_ENET_RMON_R_P1024TO2047_WR(x, HW_ENET_RMON_R_P1024TO2047_RD(x) |  (v)))
#define HW_ENET_RMON_R_P1024TO2047_CLR(x, v) (HW_ENET_RMON_R_P1024TO2047_WR(x, HW_ENET_RMON_R_P1024TO2047_RD(x) & ~(v)))
#define HW_ENET_RMON_R_P1024TO2047_TOG(x, v) (HW_ENET_RMON_R_P1024TO2047_WR(x, HW_ENET_RMON_R_P1024TO2047_RD(x) ^  (v)))
/*@}*/

