theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*******************************************************************************
 * HW_ENET_IEEE_R_FRAME_OK - Frames Received OK (IEEE_R_FRAME_OK)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_R_FRAME_OK - Frames Received OK (IEEE_R_FRAME_OK) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_r_frame_ok
{
    uint32_t U;
    struct _hw_enet_ieee_r_frame_ok_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Frame count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_r_frame_ok_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_R_FRAME_OK register
 */
/*@{*/
#define HW_ENET_IEEE_R_FRAME_OK_ADDR(x) ((uint32_t)(x) + 0x2CCU)

#define HW_ENET_IEEE_R_FRAME_OK(x) (*(__IO hw_enet_ieee_r_frame_ok_t *) HW_ENET_IEEE_R_FRAME_OK_ADDR(x))
#define HW_ENET_IEEE_R_FRAME_OK_RD(x) (HW_ENET_IEEE_R_FRAME_OK(x).U)
#define HW_ENET_IEEE_R_FRAME_OK_WR(x, v) (HW_ENET_IEEE_R_FRAME_OK(x).U = (v))
#define HW_ENET_IEEE_R_FRAME_OK_SET(x, v) (HW_ENET_IEEE_R_FRAME_OK_WR(x, HW_ENET_IEEE_R_FRAME_OK_RD(x) |  (v)))
#define HW_ENET_IEEE_R_FRAME_OK_CLR(x, v) (HW_ENET_IEEE_R_FRAME_OK_WR(x, HW_ENET_IEEE_R_FRAME_OK_RD(x) & ~(v)))
#define HW_ENET_IEEE_R_FRAME_OK_TOG(x, v) (HW_ENET_IEEE_R_FRAME_OK_WR(x, HW_ENET_IEEE_R_FRAME_OK_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_FRAME_OK bitfields
 */

/*!
 * @name Register ENET_IEEE_R_FRAME_OK, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_IEEE_R_FRAME_OK_COUNT (0U) /*!< Bit position for ENET_IEEE_R_FRAME_OK_COUNT. */
#define BM_ENET_IEEE_R_FRAME_OK_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_IEEE_R_FRAME_OK_COUNT. */
#define BS_ENET_IEEE_R_FRAME_OK_COUNT (16U) /*!< Bit field size in bits for ENET_IEEE_R_FRAME_OK_COUNT. */

/*! @brief Read current value of the ENET_IEEE_R_FRAME_OK_COUNT field. */
#define BR_ENET_IEEE_R_FRAME_OK_COUNT(x) (HW_ENET_IEEE_R_FRAME_OK(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_IEEE_R_CRC - Frames Received with CRC Error (IEEE_R_CRC)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_R_CRC - Frames Received with CRC Error (IEEE_R_CRC) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_r_crc
{
    uint32_t U;
    struct _hw_enet_ieee_r_crc_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Frame count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_r_crc_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_R_CRC register
 */
/*@{*/
#define HW_ENET_IEEE_R_CRC_ADDR(x) ((uint32_t)(x) + 0x2D0U)

#define HW_ENET_IEEE_R_CRC(x)    (*(__IO hw_enet_ieee_r_crc_t *) HW_ENET_IEEE_R_CRC_ADDR(x))
#define HW_ENET_IEEE_R_CRC_RD(x) (HW_ENET_IEEE_R_CRC(x).U)
#define HW_ENET_IEEE_R_CRC_WR(x, v) (HW_ENET_IEEE_R_CRC(x).U = (v))
#define HW_ENET_IEEE_R_CRC_SET(x, v) (HW_ENET_IEEE_R_CRC_WR(x, HW_ENET_IEEE_R_CRC_RD(x) |  (v)))
#define HW_ENET_IEEE_R_CRC_CLR(x, v) (HW_ENET_IEEE_R_CRC_WR(x, HW_ENET_IEEE_R_CRC_RD(x) & ~(v)))
#define HW_ENET_IEEE_R_CRC_TOG(x, v) (HW_ENET_IEEE_R_CRC_WR(x, HW_ENET_IEEE_R_CRC_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_CRC bitfields
 */

/*!
 * @name Register ENET_IEEE_R_CRC, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_IEEE_R_CRC_COUNT (0U)      /*!< Bit position for ENET_IEEE_R_CRC_COUNT. */
#define BM_ENET_IEEE_R_CRC_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_IEEE_R_CRC_COUNT. */
#define BS_ENET_IEEE_R_CRC_COUNT (16U)     /*!< Bit field size in bits for ENET_IEEE_R_CRC_COUNT. */

/*! @brief Read current value of the ENET_IEEE_R_CRC_COUNT field. */
#define BR_ENET_IEEE_R_CRC_COUNT(x) (HW_ENET_IEEE_R_CRC(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_IEEE_R_ALIGN - Frames Received with Alignment Error (IEEE_R_ALIGN)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_R_ALIGN - Frames Received with Alignment Error (IEEE_R_ALIGN) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_r_align
{
    uint32_t U;
    struct _hw_enet_ieee_r_align_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Frame count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_r_align_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_R_ALIGN register
 */
/*@{*/
#define HW_ENET_IEEE_R_ALIGN_ADDR(x) ((uint32_t)(x) + 0x2D4U)

#define HW_ENET_IEEE_R_ALIGN(x)  (*(__IO hw_enet_ieee_r_align_t *) HW_ENET_IEEE_R_ALIGN_ADDR(x))
#define HW_ENET_IEEE_R_ALIGN_RD(x) (HW_ENET_IEEE_R_ALIGN(x).U)
#define HW_ENET_IEEE_R_ALIGN_WR(x, v) (HW_ENET_IEEE_R_ALIGN(x).U = (v))
#define HW_ENET_IEEE_R_ALIGN_SET(x, v) (HW_ENET_IEEE_R_ALIGN_WR(x, HW_ENET_IEEE_R_ALIGN_RD(x) |  (v)))
#define HW_ENET_IEEE_R_ALIGN_CLR(x, v) (HW_ENET_IEEE_R_ALIGN_WR(x, HW_ENET_IEEE_R_ALIGN_RD(x) & ~(v)))
#define HW_ENET_IEEE_R_ALIGN_TOG(x, v) (HW_ENET_IEEE_R_ALIGN_WR(x, HW_ENET_IEEE_R_ALIGN_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_R_ALIGN bitfields
 */

/*!
 * @name Register ENET_IEEE_R_ALIGN, field COUNT[15:0] (RO)
 */
/*@{*/
#define BP_ENET_IEEE_R_ALIGN_COUNT (0U)    /*!< Bit position for ENET_IEEE_R_ALIGN_COUNT. */
#define BM_ENET_IEEE_R_ALIGN_COUNT (0x0000FFFFU) /*!< Bit mask for ENET_IEEE_R_ALIGN_COUNT. */
#define BS_ENET_IEEE_R_ALIGN_COUNT (16U)   /*!< Bit field size in bits for ENET_IEEE_R_ALIGN_COUNT. */

/*! @brief Read current value of the ENET_IEEE_R_ALIGN_COUNT field. */
#define BR_ENET_IEEE_R_ALIGN_COUNT(x) (HW_ENET_IEEE_R_ALIGN(x).B.COUNT)
/*@}*/

/*******************************************************************************
 * HW_ENET_IEEE_R_MACERR - Receive Fifo Overflow count (IEEE_R_MACERR)
 ******************************************************************************/

/*!
 * @brief HW_ENET_IEEE_R_MACERR - Receive Fifo Overflow count (IEEE_R_MACERR) (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_enet_ieee_r_macerr
{
    uint32_t U;
    struct _hw_enet_ieee_r_macerr_bitfields
    {
        uint32_t COUNT : 16;           /*!< [15:0] Count */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_enet_ieee_r_macerr_t;

/*!
 * @name Constants and macros for entire ENET_IEEE_R_MACERR register
 */
/*@{*/
#define HW_ENET_IEEE_R_MACERR_ADDR(x) ((uint32_t)(x) + 0x2D8U)

#define HW_ENET_IEEE_R_MACERR(x) (*(__IO hw_enet_ieee_r_macerr_t *) HW_ENET_IEEE_R_MACERR_ADDR(x))
#define HW_ENET_IEEE_R_MACERR_RD(x) (HW_ENET_IEEE_R_MACERR(x).U)
#define HW_ENET_IEEE_R_MACERR_WR(x, v) (HW_ENET_IEEE_R_MACERR(x).U = (v))
#define HW_ENET_IEEE_R_MACERR_SET(x, v) (HW_ENET_IEEE_R_MACERR_WR(x, HW_ENET_IEEE_R_MACERR_RD(x) |  (v)))
#define HW_ENET_IEEE_R_MACERR_CLR(x, v) (HW_ENET_IEEE_R_MACERR_WR(x, HW_ENET_IEEE_R_MACERR_RD(x) & ~(v)))
#define HW_ENET_IEEE_R_MACERR_TOG(x, v) (HW_ENET_IEEE_R_MACERR_WR(x, HW_ENET_IEEE_R_MACERR_RD(x) ^  (v)))
/*@}*/

