theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
#define HW_ENET_TCCRn(x, n)      (*(__IO hw_enet_tccrn_t *) HW_ENET_TCCRn_ADDR(x, n))
#define HW_ENET_TCCRn_RD(x, n)   (HW_ENET_TCCRn(x, n).U)
#define HW_ENET_TCCRn_WR(x, n, v) (HW_ENET_TCCRn(x, n).U = (v))
#define HW_ENET_TCCRn_SET(x, n, v) (HW_ENET_TCCRn_WR(x, n, HW_ENET_TCCRn_RD(x, n) |  (v)))
#define HW_ENET_TCCRn_CLR(x, n, v) (HW_ENET_TCCRn_WR(x, n, HW_ENET_TCCRn_RD(x, n) & ~(v)))
#define HW_ENET_TCCRn_TOG(x, n, v) (HW_ENET_TCCRn_WR(x, n, HW_ENET_TCCRn_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual ENET_TCCRn bitfields
 */

/*!
 * @name Register ENET_TCCRn, field TCC[31:0] (RW)
 *
 * This register is double buffered between the module clock and 1588 clock
 * domains. When configured for compare, the 1588 clock domain updates with the value
 * in the module clock domain whenever the Timer Channel is first enabled and on
 * each subsequent compare. Write to this register with the first compare value
 * before enabling the Timer Channel. When the Timer Channel is enabled, write
 * the second compare value either immediately, or at least before the first
 * compare occurs. After each compare, write the next compare value before the previous
 * compare occurs and before clearing the Timer Flag. The compare occurs one
 * 1588 clock cycle after the IEEE 1588 Counter increments past the compare value in
 * the 1588 clock domain. If the compare value is less than the value of the
 * 1588 Counter when the Timer Channel is first enabled, then the compare does not
 * occur until following the next overflow of the 1588 Counter. If the compare
 * value is greater than the IEEE 1588 Counter when the 1588 Counter overflows, or
 * the compare value is less than the value of the IEEE 1588 Counter after the
 * overflow, then the compare occurs one 1588 clock cycle following the overflow.
 * When configured for Capture, the value of the IEEE 1588 Counter is captured into
 * the 1588 clock domain and then updated into the module clock domain, provided
 * the Timer Flag is clear. Always read the capture value before clearing the
 * Timer Flag.
 */
/*@{*/
#define BP_ENET_TCCRn_TCC    (0U)          /*!< Bit position for ENET_TCCRn_TCC. */
#define BM_ENET_TCCRn_TCC    (0xFFFFFFFFU) /*!< Bit mask for ENET_TCCRn_TCC. */
#define BS_ENET_TCCRn_TCC    (32U)         /*!< Bit field size in bits for ENET_TCCRn_TCC. */

/*! @brief Read current value of the ENET_TCCRn_TCC field. */
#define BR_ENET_TCCRn_TCC(x, n) (HW_ENET_TCCRn(x, n).U)

/*! @brief Format value for bitfield ENET_TCCRn_TCC. */
#define BF_ENET_TCCRn_TCC(v) ((uint32_t)((uint32_t)(v) << BP_ENET_TCCRn_TCC) & BM_ENET_TCCRn_TCC)

/*! @brief Set the TCC field to a new value. */
#define BW_ENET_TCCRn_TCC(x, n, v) (HW_ENET_TCCRn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * hw_enet_t - module struct
 ******************************************************************************/
/*!
 * @brief All ENET module registers.
 */
#pragma pack(1)
typedef struct _hw_enet
{
    uint8_t _reserved0[4];
    __IO hw_enet_eir_t EIR;                /*!< [0x4] Interrupt Event Register */
    __IO hw_enet_eimr_t EIMR;              /*!< [0x8] Interrupt Mask Register */
    uint8_t _reserved1[4];
    __IO hw_enet_rdar_t RDAR;              /*!< [0x10] Receive Descriptor Active Register */
    __IO hw_enet_tdar_t TDAR;              /*!< [0x14] Transmit Descriptor Active Register */
    uint8_t _reserved2[12];
    __IO hw_enet_ecr_t ECR;                /*!< [0x24] Ethernet Control Register */
    uint8_t _reserved3[24];
    __IO hw_enet_mmfr_t MMFR;              /*!< [0x40] MII Management Frame Register */
    __IO hw_enet_mscr_t MSCR;              /*!< [0x44] MII Speed Control Register */
    uint8_t _reserved4[28];
    __IO hw_enet_mibc_t MIBC;              /*!< [0x64] MIB Control Register */
    uint8_t _reserved5[28];
    __IO hw_enet_rcr_t RCR;                /*!< [0x84] Receive Control Register */
    uint8_t _reserved6[60];
    __IO hw_enet_tcr_t TCR;                /*!< [0xC4] Transmit Control Register */
    uint8_t _reserved7[28];
    __IO hw_enet_palr_t PALR;              /*!< [0xE4] Physical Address Lower Register */
    __IO hw_enet_paur_t PAUR;              /*!< [0xE8] Physical Address Upper Register */
    __IO hw_enet_opd_t OPD;                /*!< [0xEC] Opcode/Pause Duration Register */
    uint8_t _reserved8[40];
    __IO hw_enet_iaur_t IAUR;              /*!< [0x118] Descriptor Individual Upper Address Register */
    __IO hw_enet_ialr_t IALR;              /*!< [0x11C] Descriptor Individual Lower Address Register */
    __IO hw_enet_gaur_t GAUR;              /*!< [0x120] Descriptor Group Upper Address Register */
    __IO hw_enet_galr_t GALR;              /*!< [0x124] Descriptor Group Lower Address Register */
    uint8_t _reserved9[28];
    __IO hw_enet_tfwr_t TFWR;              /*!< [0x144] Transmit FIFO Watermark Register */
    uint8_t _reserved10[56];
    __IO hw_enet_rdsr_t RDSR;              /*!< [0x180] Receive Descriptor Ring Start Register */
    __IO hw_enet_tdsr_t TDSR;              /*!< [0x184] Transmit Buffer Descriptor Ring Start Register */
    __IO hw_enet_mrbr_t MRBR;              /*!< [0x188] Maximum Receive Buffer Size Register */
    uint8_t _reserved11[4];
    __IO hw_enet_rsfl_t RSFL;              /*!< [0x190] Receive FIFO Section Full Threshold */
    __IO hw_enet_rsem_t RSEM;              /*!< [0x194] Receive FIFO Section Empty Threshold */
    __IO hw_enet_raem_t RAEM;              /*!< [0x198] Receive FIFO Almost Empty Threshold */
    __IO hw_enet_rafl_t RAFL;              /*!< [0x19C] Receive FIFO Almost Full Threshold */
    __IO hw_enet_tsem_t TSEM;              /*!< [0x1A0] Transmit FIFO Section Empty Threshold */
    __IO hw_enet_taem_t TAEM;              /*!< [0x1A4] Transmit FIFO Almost Empty Threshold */
    __IO hw_enet_tafl_t TAFL;              /*!< [0x1A8] Transmit FIFO Almost Full Threshold */
    __IO hw_enet_tipg_t TIPG;              /*!< [0x1AC] Transmit Inter-Packet Gap */
    __IO hw_enet_ftrl_t FTRL;              /*!< [0x1B0] Frame Truncation Length */
    uint8_t _reserved12[12];
    __IO hw_enet_tacc_t TACC;              /*!< [0x1C0] Transmit Accelerator Function Configuration */
    __IO hw_enet_racc_t RACC;              /*!< [0x1C4] Receive Accelerator Function Configuration */
    uint8_t _reserved13[56];
    __IO hw_enet_rmon_t_drop_t RMON_T_DROP; /*!< [0x200] Count of frames not counted correctly (RMON_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable. */
    __IO hw_enet_rmon_t_packets_t RMON_T_PACKETS; /*!< [0x204] RMON Tx packet count (RMON_T_PACKETS) */
    __IO hw_enet_rmon_t_bc_pkt_t RMON_T_BC_PKT; /*!< [0x208] RMON Tx Broadcast Packets (RMON_T_BC_PKT) */
    __IO hw_enet_rmon_t_mc_pkt_t RMON_T_MC_PKT; /*!< [0x20C] RMON Tx Multicast Packets (RMON_T_MC_PKT) */
    __IO hw_enet_rmon_t_crc_align_t RMON_T_CRC_ALIGN; /*!< [0x210] RMON Tx Packets w CRC/Align error (RMON_T_CRC_ALIGN) */
    __IO hw_enet_rmon_t_undersize_t RMON_T_UNDERSIZE; /*!< [0x214] RMON Tx Packets < 64 bytes, good CRC (RMON_T_UNDERSIZE) */
    __IO hw_enet_rmon_t_oversize_t RMON_T_OVERSIZE; /*!< [0x218] RMON Tx Packets > MAX_FL bytes, good CRC (RMON_T_OVERSIZE) */
    __IO hw_enet_rmon_t_frag_t RMON_T_FRAG; /*!< [0x21C] RMON Tx Packets < 64 bytes, bad CRC (RMON_T_FRAG) */
    __IO hw_enet_rmon_t_jab_t RMON_T_JAB;  /*!< [0x220] RMON Tx Packets > MAX_FL bytes, bad CRC (RMON_T_JAB) */
    __IO hw_enet_rmon_t_col_t RMON_T_COL;  /*!< [0x224] RMON Tx collision count (RMON_T_COL) */
    __IO hw_enet_rmon_t_p64_t RMON_T_P64;  /*!< [0x228] RMON Tx 64 byte packets (RMON_T_P64) */
    __IO hw_enet_rmon_t_p65to127_t RMON_T_P65TO127; /*!< [0x22C] RMON Tx 65 to 127 byte packets (RMON_T_P65TO127) */
    __IO hw_enet_rmon_t_p128to255_t RMON_T_P128TO255; /*!< [0x230] RMON Tx 128 to 255 byte packets (RMON_T_P128TO255) */
    __IO hw_enet_rmon_t_p256to511_t RMON_T_P256TO511; /*!< [0x234] RMON Tx 256 to 511 byte packets (RMON_T_P256TO511) */
    __IO hw_enet_rmon_t_p512to1023_t RMON_T_P512TO1023; /*!< [0x238] RMON Tx 512 to 1023 byte packets (RMON_T_P512TO1023) */
    __IO hw_enet_rmon_t_p1024to2047_t RMON_T_P1024TO2047; /*!< [0x23C] RMON Tx 1024 to 2047 byte packets (RMON_T_P1024TO2047) */
    __IO hw_enet_rmon_t_p_gte2048_t RMON_T_P_GTE2048; /*!< [0x240] RMON Tx packets w > 2048 bytes (RMON_T_P_GTE2048) */
    __I hw_enet_rmon_t_octets_t RMON_T_OCTETS; /*!< [0x244] RMON Tx Octets (RMON_T_OCTETS) */
    __IO hw_enet_ieee_t_drop_t IEEE_T_DROP; /*!< [0x248] Count of frames not counted correctly (IEEE_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable. */
    __IO hw_enet_ieee_t_frame_ok_t IEEE_T_FRAME_OK; /*!< [0x24C] Frames Transmitted OK (IEEE_T_FRAME_OK) */
    __IO hw_enet_ieee_t_1col_t IEEE_T_1COL; /*!< [0x250] Frames Transmitted with Single Collision (IEEE_T_1COL) */
    __IO hw_enet_ieee_t_mcol_t IEEE_T_MCOL; /*!< [0x254] Frames Transmitted with Multiple Collisions (IEEE_T_MCOL) */
    __IO hw_enet_ieee_t_def_t IEEE_T_DEF;  /*!< [0x258] Frames Transmitted after Deferral Delay (IEEE_T_DEF) */
    __IO hw_enet_ieee_t_lcol_t IEEE_T_LCOL; /*!< [0x25C] Frames Transmitted with Late Collision (IEEE_T_LCOL) */
    __IO hw_enet_ieee_t_excol_t IEEE_T_EXCOL; /*!< [0x260] Frames Transmitted with Excessive Collisions (IEEE_T_EXCOL) */
    __IO hw_enet_ieee_t_macerr_t IEEE_T_MACERR; /*!< [0x264] Frames Transmitted with Tx FIFO Underrun (IEEE_T_MACERR) */
    __IO hw_enet_ieee_t_cserr_t IEEE_T_CSERR; /*!< [0x268] Frames Transmitted with Carrier Sense Error (IEEE_T_CSERR) */
    __IO hw_enet_ieee_t_sqe_t IEEE_T_SQE;  /*!< [0x26C] Frames Transmitted with SQE Error (IEEE_T_SQE). NOTE: Counter not implemented (read 0 always) as no SQE information is available. */
    __IO hw_enet_ieee_t_fdxfc_t IEEE_T_FDXFC; /*!< [0x270] Flow Control Pause frames transmitted (IEEE_T_FDXFC) */
    __I hw_enet_ieee_t_octets_ok_t IEEE_T_OCTETS_OK; /*!< [0x274] Octet count for Frames Transmitted w/o Error (IEEE_T_OCTETS_OK). NOTE: Counts total octets (includes header and FCS fields). */
    uint8_t _reserved14[12];
    __IO hw_enet_rmon_r_packets_t RMON_R_PACKETS; /*!< [0x284] RMON Rx packet count (RMON_R_PACKETS) */
    __IO hw_enet_rmon_r_bc_pkt_t RMON_R_BC_PKT; /*!< [0x288] RMON Rx Broadcast Packets (RMON_R_BC_PKT) */
    __IO hw_enet_rmon_r_mc_pkt_t RMON_R_MC_PKT; /*!< [0x28C] RMON Rx Multicast Packets (RMON_R_MC_PKT) */
    __IO hw_enet_rmon_r_crc_align_t RMON_R_CRC_ALIGN; /*!< [0x290] RMON Rx Packets w CRC/Align error (RMON_R_CRC_ALIGN) */
    __IO hw_enet_rmon_r_undersize_t RMON_R_UNDERSIZE; /*!< [0x294] RMON Rx Packets < 64 bytes, good CRC (RMON_R_UNDERSIZE) */
    __IO hw_enet_rmon_r_oversize_t RMON_R_OVERSIZE; /*!< [0x298] RMON Rx Packets > MAX_FL bytes, good CRC (RMON_R_OVERSIZE) */
    __IO hw_enet_rmon_r_frag_t RMON_R_FRAG; /*!< [0x29C] RMON Rx Packets < 64 bytes, bad CRC (RMON_R_FRAG) */
    __IO hw_enet_rmon_r_jab_t RMON_R_JAB;  /*!< [0x2A0] RMON Rx Packets > MAX_FL bytes, bad CRC (RMON_R_JAB) */
    __IO hw_enet_rmon_r_resvd_0_t RMON_R_RESVD_0; /*!< [0x2A4] Reserved (RMON_R_RESVD_0) */
    __IO hw_enet_rmon_r_p64_t RMON_R_P64;  /*!< [0x2A8] RMON Rx 64 byte packets (RMON_R_P64) */
    __IO hw_enet_rmon_r_p65to127_t RMON_R_P65TO127; /*!< [0x2AC] RMON Rx 65 to 127 byte packets (RMON_R_P65TO127) */
    __IO hw_enet_rmon_r_p128to255_t RMON_R_P128TO255; /*!< [0x2B0] RMON Rx 128 to 255 byte packets (RMON_R_P128TO255) */
    __IO hw_enet_rmon_r_p256to511_t RMON_R_P256TO511; /*!< [0x2B4] RMON Rx 256 to 511 byte packets (RMON_R_P256TO511) */
    __IO hw_enet_rmon_r_p512to1023_t RMON_R_P512TO1023; /*!< [0x2B8] RMON Rx 512 to 1023 byte packets (RMON_R_P512TO1023) */
    __IO hw_enet_rmon_r_p1024to2047_t RMON_R_P1024TO2047; /*!< [0x2BC] RMON Rx 1024 to 2047 byte packets (RMON_R_P1024TO2047) */
    __IO hw_enet_rmon_r_p_gte2048_t RMON_R_P_GTE2048; /*!< [0x2C0] RMON Rx packets w > 2048 bytes (RMON_R_P_GTE2048) */
    __I hw_enet_rmon_r_octets_t RMON_R_OCTETS; /*!< [0x2C4] RMON Rx Octets (RMON_R_OCTETS) */
    __IO hw_enet_ieee_r_drop_t IEEE_R_DROP; /*!< [0x2C8] Count of frames not counted correctly (IEEE_R_DROP). NOTE: Counter increments if a frame with valid/missing SFD character is detected and has been dropped. None of the other counters increments if this counter increments. */
    __IO hw_enet_ieee_r_frame_ok_t IEEE_R_FRAME_OK; /*!< [0x2CC] Frames Received OK (IEEE_R_FRAME_OK) */
    __IO hw_enet_ieee_r_crc_t IEEE_R_CRC;  /*!< [0x2D0] Frames Received with CRC Error (IEEE_R_CRC) */
    __IO hw_enet_ieee_r_align_t IEEE_R_ALIGN; /*!< [0x2D4] Frames Received with Alignment Error (IEEE_R_ALIGN) */
    __IO hw_enet_ieee_r_macerr_t IEEE_R_MACERR; /*!< [0x2D8] Receive Fifo Overflow count (IEEE_R_MACERR) */
    __IO hw_enet_ieee_r_fdxfc_t IEEE_R_FDXFC; /*!< [0x2DC] Flow Control Pause frames received (IEEE_R_FDXFC) */
    __I hw_enet_ieee_r_octets_ok_t IEEE_R_OCTETS_OK; /*!< [0x2E0] Octet count for Frames Rcvd w/o Error (IEEE_R_OCTETS_OK). Counts total octets (includes header and FCS fields). */
    uint8_t _reserved15[284];
    __IO hw_enet_atcr_t ATCR;              /*!< [0x400] Timer Control Register */
    __IO hw_enet_atvr_t ATVR;              /*!< [0x404] Timer Value Register */
    __IO hw_enet_atoff_t ATOFF;            /*!< [0x408] Timer Offset Register */
    __IO hw_enet_atper_t ATPER;            /*!< [0x40C] Timer Period Register */
    __IO hw_enet_atcor_t ATCOR;            /*!< [0x410] Timer Correction Register */
    __IO hw_enet_atinc_t ATINC;            /*!< [0x414] Time-Stamping Clock Period Register */
    __IO hw_enet_atstmp_t ATSTMP;          /*!< [0x418] Timestamp of Last Transmitted Frame */
    uint8_t _reserved16[488];
    __IO hw_enet_tgsr_t TGSR;              /*!< [0x604] Timer Global Status Register */
    struct {
        __IO hw_enet_tcsrn_t TCSRn;        /*!< [0x608] Timer Control Status Register */
        __IO hw_enet_tccrn_t TCCRn;        /*!< [0x60C] Timer Compare Capture Register */
    } CHANNEL[4];
} hw_enet_t;
#pragma pack()

/*! @brief Macro to access all ENET registers. */
/*! @param x ENET module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_ENET_REGS(ENET_BASE)</code>. */
#define HW_ENET_REGS(x) (*(hw_enet_t *)(x))

