theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Format value for bitfield FTFL_FSTAT_ACCERR. */
#define BF_FTFL_FSTAT_ACCERR(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FSTAT_ACCERR) & BM_FTFL_FSTAT_ACCERR)

/*! @brief Set the ACCERR field to a new value. */
#define BW_FTFL_FSTAT_ACCERR(x, v) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_ACCERR) = (v))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field RDCOLERR[6] (W1C)
 *
 * The RDCOLERR error bit indicates that the MCU attempted a read from a flash
 * memory resource that was being manipulated by a flash command (CCIF=0). Any
 * simultaneous access is detected as a collision error by the block arbitration
 * logic. The read data in this case cannot be guaranteed. The RDCOLERR bit is
 * cleared by writing a 1 to it. Writing a 0 to RDCOLERR has no effect.
 *
 * Values:
 * - 0 - No collision error detected
 * - 1 - Collision error detected
 */
/*@{*/
#define BP_FTFL_FSTAT_RDCOLERR (6U)        /*!< Bit position for FTFL_FSTAT_RDCOLERR. */
#define BM_FTFL_FSTAT_RDCOLERR (0x40U)     /*!< Bit mask for FTFL_FSTAT_RDCOLERR. */
#define BS_FTFL_FSTAT_RDCOLERR (1U)        /*!< Bit field size in bits for FTFL_FSTAT_RDCOLERR. */

/*! @brief Read current value of the FTFL_FSTAT_RDCOLERR field. */
#define BR_FTFL_FSTAT_RDCOLERR(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_RDCOLERR))

/*! @brief Format value for bitfield FTFL_FSTAT_RDCOLERR. */
#define BF_FTFL_FSTAT_RDCOLERR(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FSTAT_RDCOLERR) & BM_FTFL_FSTAT_RDCOLERR)

/*! @brief Set the RDCOLERR field to a new value. */
#define BW_FTFL_FSTAT_RDCOLERR(x, v) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_RDCOLERR) = (v))
/*@}*/

/*!
 * @name Register FTFL_FSTAT, field CCIF[7] (W1C)
 *
 * The CCIF flag indicates that a flash command or EEPROM file system operation
 * has completed. The CCIF flag is cleared by writing a 1 to CCIF to launch a
 * command, and CCIF stays low until command completion or command violation. The
 * CCIF flag is also cleared by a successful write to FlexRAM while enabled for
 * EEE, and CCIF stays low until the EEPROM file system has created the associated
 * EEPROM data record. The CCIF bit is reset to 0 but is set to 1 by the memory
 * controller at the end of the reset initialization sequence. Depending on how
 * quickly the read occurs after reset release, the user may or may not see the 0
 * hardware reset value.
 *
 * Values:
 * - 0 - Flash command or EEPROM file system operation in progress
 * - 1 - Flash command or EEPROM file system operation has completed
 */
/*@{*/
#define BP_FTFL_FSTAT_CCIF   (7U)          /*!< Bit position for FTFL_FSTAT_CCIF. */
#define BM_FTFL_FSTAT_CCIF   (0x80U)       /*!< Bit mask for FTFL_FSTAT_CCIF. */
#define BS_FTFL_FSTAT_CCIF   (1U)          /*!< Bit field size in bits for FTFL_FSTAT_CCIF. */

/*! @brief Read current value of the FTFL_FSTAT_CCIF field. */
#define BR_FTFL_FSTAT_CCIF(x) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_CCIF))

/*! @brief Format value for bitfield FTFL_FSTAT_CCIF. */
#define BF_FTFL_FSTAT_CCIF(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FSTAT_CCIF) & BM_FTFL_FSTAT_CCIF)

/*! @brief Set the CCIF field to a new value. */
#define BW_FTFL_FSTAT_CCIF(x, v) (BITBAND_ACCESS8(HW_FTFL_FSTAT_ADDR(x), BP_FTFL_FSTAT_CCIF) = (v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FCNFG - Flash Configuration Register
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FCNFG - Flash Configuration Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register provides information on the current functional state of the
 * flash memory module. The erase control bits (ERSAREQ and ERSSUSP) have write
 * restrictions. SWAP, PFLSH, RAMRDY , and EEERDY are read-only status bits . The
 * unassigned bits read as noted and are not writable. The reset values for the
 * SWAP, PFLASH, RAMRDY , and EEERDY bits are determined during the reset sequence.
 */
typedef union _hw_ftfl_fcnfg
{
    uint8_t U;
    struct _hw_ftfl_fcnfg_bitfields
    {
        uint8_t EEERDY : 1;            /*!< [0]  */
        uint8_t RAMRDY : 1;            /*!< [1] RAM Ready */
        uint8_t PFLSH : 1;             /*!< [2] Flash memory configuration */
        uint8_t SWAP : 1;              /*!< [3] Swap */
        uint8_t ERSSUSP : 1;           /*!< [4] Erase Suspend */
        uint8_t ERSAREQ : 1;           /*!< [5] Erase All Request */
        uint8_t RDCOLLIE : 1;          /*!< [6] Read Collision Error Interrupt Enable
                                        * */
        uint8_t CCIE : 1;              /*!< [7] Command Complete Interrupt Enable */
    } B;
} hw_ftfl_fcnfg_t;

/*!
 * @name Constants and macros for entire FTFL_FCNFG register
 */
/*@{*/
#define HW_FTFL_FCNFG_ADDR(x)    ((uint32_t)(x) + 0x1U)

#define HW_FTFL_FCNFG(x)         (*(__IO hw_ftfl_fcnfg_t *) HW_FTFL_FCNFG_ADDR(x))
#define HW_FTFL_FCNFG_RD(x)      (HW_FTFL_FCNFG(x).U)
#define HW_FTFL_FCNFG_WR(x, v)   (HW_FTFL_FCNFG(x).U = (v))
#define HW_FTFL_FCNFG_SET(x, v)  (HW_FTFL_FCNFG_WR(x, HW_FTFL_FCNFG_RD(x) |  (v)))
#define HW_FTFL_FCNFG_CLR(x, v)  (HW_FTFL_FCNFG_WR(x, HW_FTFL_FCNFG_RD(x) & ~(v)))
#define HW_FTFL_FCNFG_TOG(x, v)  (HW_FTFL_FCNFG_WR(x, HW_FTFL_FCNFG_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCNFG bitfields
 */

/*!
 * @name Register FTFL_FCNFG, field EEERDY[0] (RO)
 *
 * For devices with FlexNVM: This flag indicates if the EEPROM backup data has
 * been copied to the FlexRAM and is therefore available for read access. During
 * the reset sequence, the EEERDY flag will remain cleared while CCIF is clear and
 * will only set if the FlexNVM block is partitioned for EEPROM. For devices
 * without FlexNVM: This field is reserved.
 *
 * Values:
 * - 0 - For devices with FlexNVM: FlexRAM is not available for EEPROM operation.
 * - 1 - For devices with FlexNVM: FlexRAM is available for EEPROM operations
 *     where: reads from the FlexRAM return data previously written to the FlexRAM
 *     in EEPROM mode and writes to the FlexRAM clear EEERDY and launch an EEPROM
 *     operation to store the written data in the FlexRAM and EEPROM backup.
 */
/*@{*/
#define BP_FTFL_FCNFG_EEERDY (0U)          /*!< Bit position for FTFL_FCNFG_EEERDY. */
#define BM_FTFL_FCNFG_EEERDY (0x01U)       /*!< Bit mask for FTFL_FCNFG_EEERDY. */
#define BS_FTFL_FCNFG_EEERDY (1U)          /*!< Bit field size in bits for FTFL_FCNFG_EEERDY. */

/*! @brief Read current value of the FTFL_FCNFG_EEERDY field. */
#define BR_FTFL_FCNFG_EEERDY(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_EEERDY))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field RAMRDY[1] (RO)
 *
 * This flag indicates the current status of the FlexRAM/ programming
 * acceleration RAM. For devices with FlexNVM: The state of the RAMRDY flag is normally
 * controlled by the Set FlexRAM Function command. During the reset sequence, the
 * RAMRDY flag is cleared if the FlexNVM block is partitioned for EEPROM and is set
 * if the FlexNVM block is not partitioned for EEPROM. The RAMRDY flag is
 * cleared if the Program Partition command is run to partition the FlexNVM block for
 * EEPROM. The RAMRDY flag sets after completion of the Erase All Blocks command
 * or execution of the erase-all operation triggered external to the flash memory
 * module. For devices without FlexNVM: This bit should always be set.
 *
 * Values:
 * - 0 - For devices with FlexNVM: FlexRAM is not available for traditional RAM
 *     access. For devices without FlexNVM: Programming acceleration RAM is not
 *     available.
 * - 1 - For devices with FlexNVM: FlexRAM is available as traditional RAM only;
 *     writes to the FlexRAM do not trigger EEPROM operations. For devices
 *     without FlexNVM: Programming acceleration RAM is available.
 */
/*@{*/
#define BP_FTFL_FCNFG_RAMRDY (1U)          /*!< Bit position for FTFL_FCNFG_RAMRDY. */
#define BM_FTFL_FCNFG_RAMRDY (0x02U)       /*!< Bit mask for FTFL_FCNFG_RAMRDY. */
#define BS_FTFL_FCNFG_RAMRDY (1U)          /*!< Bit field size in bits for FTFL_FCNFG_RAMRDY. */

/*! @brief Read current value of the FTFL_FCNFG_RAMRDY field. */
#define BR_FTFL_FCNFG_RAMRDY(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_RAMRDY))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field PFLSH[2] (RO)
 *
 * Values:
 * - 0 - For devices with FlexNVM: Flash memory module configured for FlexMemory
 *     that supports data flash and/or EEPROM. For devices with program flash
 *     only: Reserved
 * - 1 - For devices with FlexNVM: Reserved. For devices with program flash
 *     only: Flash memory module configured for program flash only, without support
 *     for data flash and/or EEPROM
 */
/*@{*/
#define BP_FTFL_FCNFG_PFLSH  (2U)          /*!< Bit position for FTFL_FCNFG_PFLSH. */
#define BM_FTFL_FCNFG_PFLSH  (0x04U)       /*!< Bit mask for FTFL_FCNFG_PFLSH. */
#define BS_FTFL_FCNFG_PFLSH  (1U)          /*!< Bit field size in bits for FTFL_FCNFG_PFLSH. */

