theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the FTFL_FCNFG_PFLSH field. */
#define BR_FTFL_FCNFG_PFLSH(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_PFLSH))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field SWAP[3] (RO)
 *
 * For program flash only configurations, the SWAP flag indicates which physical
 * program flash block is located at relative address 0x0000. The state of the
 * SWAP flag is set by the flash memory module during the reset sequence. See the
 * Swap Control command section for information on swap management.
 *
 * Values:
 * - 0 - Physical program flash 0 is located at relative address 0x0000
 * - 1 - If the PFLSH flag is set, physical program flash 1 is located at
 *     relative address 0x0000. If the PFLSH flag is not set, physical program flash 0
 *     is located at relative address 0x0000
 */
/*@{*/
#define BP_FTFL_FCNFG_SWAP   (3U)          /*!< Bit position for FTFL_FCNFG_SWAP. */
#define BM_FTFL_FCNFG_SWAP   (0x08U)       /*!< Bit mask for FTFL_FCNFG_SWAP. */
#define BS_FTFL_FCNFG_SWAP   (1U)          /*!< Bit field size in bits for FTFL_FCNFG_SWAP. */

/*! @brief Read current value of the FTFL_FCNFG_SWAP field. */
#define BR_FTFL_FCNFG_SWAP(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_SWAP))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field ERSSUSP[4] (RW)
 *
 * The ERSSUSP bit allows the user to suspend (interrupt) the Erase Flash Sector
 * command while it is executing.
 *
 * Values:
 * - 0 - No suspend requested
 * - 1 - Suspend the current Erase Flash Sector command execution.
 */
/*@{*/
#define BP_FTFL_FCNFG_ERSSUSP (4U)         /*!< Bit position for FTFL_FCNFG_ERSSUSP. */
#define BM_FTFL_FCNFG_ERSSUSP (0x10U)      /*!< Bit mask for FTFL_FCNFG_ERSSUSP. */
#define BS_FTFL_FCNFG_ERSSUSP (1U)         /*!< Bit field size in bits for FTFL_FCNFG_ERSSUSP. */

/*! @brief Read current value of the FTFL_FCNFG_ERSSUSP field. */
#define BR_FTFL_FCNFG_ERSSUSP(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_ERSSUSP))

/*! @brief Format value for bitfield FTFL_FCNFG_ERSSUSP. */
#define BF_FTFL_FCNFG_ERSSUSP(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCNFG_ERSSUSP) & BM_FTFL_FCNFG_ERSSUSP)

/*! @brief Set the ERSSUSP field to a new value. */
#define BW_FTFL_FCNFG_ERSSUSP(x, v) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_ERSSUSP) = (v))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field ERSAREQ[5] (RO)
 *
 * This bit issues a request to the memory controller to execute the Erase All
 * Blocks command and release security. ERSAREQ is not directly writable but is
 * under indirect user control. Refer to the device's Chip Configuration details on
 * how to request this command. The ERSAREQ bit sets when an erase all request
 * is triggered external to the flash memory module and CCIF is set (no command is
 * currently being executed). ERSAREQ is cleared by the flash memory module when
 * the operation completes.
 *
 * Values:
 * - 0 - No request or request complete
 * - 1 - Request to: run the Erase All Blocks command, verify the erased state,
 *     program the security byte in the Flash Configuration Field to the unsecure
 *     state, and release MCU security by setting the FSEC[SEC] field to the
 *     unsecure state.
 */
/*@{*/
#define BP_FTFL_FCNFG_ERSAREQ (5U)         /*!< Bit position for FTFL_FCNFG_ERSAREQ. */
#define BM_FTFL_FCNFG_ERSAREQ (0x20U)      /*!< Bit mask for FTFL_FCNFG_ERSAREQ. */
#define BS_FTFL_FCNFG_ERSAREQ (1U)         /*!< Bit field size in bits for FTFL_FCNFG_ERSAREQ. */

/*! @brief Read current value of the FTFL_FCNFG_ERSAREQ field. */
#define BR_FTFL_FCNFG_ERSAREQ(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_ERSAREQ))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field RDCOLLIE[6] (RW)
 *
 * The RDCOLLIE bit controls interrupt generation when a flash memory read
 * collision error occurs.
 *
 * Values:
 * - 0 - Read collision error interrupt disabled
 * - 1 - Read collision error interrupt enabled. An interrupt request is
 *     generated whenever a flash memory read collision error is detected (see the
 *     description of FSTAT[RDCOLERR]).
 */
/*@{*/
#define BP_FTFL_FCNFG_RDCOLLIE (6U)        /*!< Bit position for FTFL_FCNFG_RDCOLLIE. */
#define BM_FTFL_FCNFG_RDCOLLIE (0x40U)     /*!< Bit mask for FTFL_FCNFG_RDCOLLIE. */
#define BS_FTFL_FCNFG_RDCOLLIE (1U)        /*!< Bit field size in bits for FTFL_FCNFG_RDCOLLIE. */

/*! @brief Read current value of the FTFL_FCNFG_RDCOLLIE field. */
#define BR_FTFL_FCNFG_RDCOLLIE(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_RDCOLLIE))

/*! @brief Format value for bitfield FTFL_FCNFG_RDCOLLIE. */
#define BF_FTFL_FCNFG_RDCOLLIE(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCNFG_RDCOLLIE) & BM_FTFL_FCNFG_RDCOLLIE)

/*! @brief Set the RDCOLLIE field to a new value. */
#define BW_FTFL_FCNFG_RDCOLLIE(x, v) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_RDCOLLIE) = (v))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field CCIE[7] (RW)
 *
 * The CCIE bit controls interrupt generation when a flash command completes.
 *
 * Values:
 * - 0 - Command complete interrupt disabled
 * - 1 - Command complete interrupt enabled. An interrupt request is generated
 *     whenever the FSTAT[CCIF] flag is set.
 */
/*@{*/
#define BP_FTFL_FCNFG_CCIE   (7U)          /*!< Bit position for FTFL_FCNFG_CCIE. */
#define BM_FTFL_FCNFG_CCIE   (0x80U)       /*!< Bit mask for FTFL_FCNFG_CCIE. */
#define BS_FTFL_FCNFG_CCIE   (1U)          /*!< Bit field size in bits for FTFL_FCNFG_CCIE. */

/*! @brief Read current value of the FTFL_FCNFG_CCIE field. */
#define BR_FTFL_FCNFG_CCIE(x) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_CCIE))

/*! @brief Format value for bitfield FTFL_FCNFG_CCIE. */
#define BF_FTFL_FCNFG_CCIE(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCNFG_CCIE) & BM_FTFL_FCNFG_CCIE)

/*! @brief Set the CCIE field to a new value. */
#define BW_FTFL_FCNFG_CCIE(x, v) (BITBAND_ACCESS8(HW_FTFL_FCNFG_ADDR(x), BP_FTFL_FCNFG_CCIE) = (v))
/*@}*/

