theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual FTFL_FCCOB8 bitfields
 */

/*!
 * @name Register FTFL_FCCOB8, field CCOBn[7:0] (RW)
 *
 * The FCCOB register provides a command code and relevant parameters to the
 * memory controller. The individual registers that compose the FCCOB data set can
 * be written in any order, but you must provide all needed values, which vary
 * from command to command. First, set up all required FCCOB fields and then
 * initiate the command's execution by writing a 1 to the FSTAT[CCIF] bit. This clears
 * the CCIF bit, which locks all FCCOB parameter fields and they cannot be changed
 * by the user until the command completes (CCIF returns to 1). No command
 * buffering or queueing is provided; the next command can be loaded only after the
 * current command completes. Some commands return information to the FCCOB
 * registers. Any values returned to FCCOB are available for reading after the
 * FSTAT[CCIF] flag returns to 1 by the memory controller. The following table shows a
 * generic flash command format. The first FCCOB register, FCCOB0, always contains
 * the command code. This 8-bit value defines the command to be executed. The
 * command code is followed by the parameters required for this specific flash
 * command, typically an address and/or data values. The command parameter table is
 * written in terms of FCCOB Number (which is equivalent to the byte number). This
 * number is a reference to the FCCOB register name and is not the register
 * address. FCCOB Number Typical Command Parameter Contents [7:0] 0 FCMD (a code that
 * defines the flash command) 1 Flash address [23:16] 2 Flash address [15:8] 3
 * Flash address [7:0] 4 Data Byte 0 5 Data Byte 1 6 Data Byte 2 7 Data Byte 3 8
 * Data Byte 4 9 Data Byte 5 A Data Byte 6 B Data Byte 7 FCCOB Endianness and
 * Multi-Byte Access : The FCCOB register group uses a big endian addressing
 * convention. For all command parameter fields larger than 1 byte, the most significant
 * data resides in the lowest FCCOB register number. The FCCOB register group may
 * be read and written as individual bytes, aligned words (2 bytes) or aligned
 * longwords (4 bytes).
 */
/*@{*/
#define BP_FTFL_FCCOB8_CCOBn (0U)          /*!< Bit position for FTFL_FCCOB8_CCOBn. */
#define BM_FTFL_FCCOB8_CCOBn (0xFFU)       /*!< Bit mask for FTFL_FCCOB8_CCOBn. */
#define BS_FTFL_FCCOB8_CCOBn (8U)          /*!< Bit field size in bits for FTFL_FCCOB8_CCOBn. */

/*! @brief Read current value of the FTFL_FCCOB8_CCOBn field. */
#define BR_FTFL_FCCOB8_CCOBn(x) (HW_FTFL_FCCOB8(x).U)

/*! @brief Format value for bitfield FTFL_FCCOB8_CCOBn. */
#define BF_FTFL_FCCOB8_CCOBn(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FCCOB8_CCOBn) & BM_FTFL_FCCOB8_CCOBn)

/*! @brief Set the CCOBn field to a new value. */
#define BW_FTFL_FCCOB8_CCOBn(x, v) (HW_FTFL_FCCOB8_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FPROT3 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FPROT3 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any flash command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory . The bitfields are
 * defined in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8]
 * FPROT3 PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration
 * Field as indicated in the following table. Program flash protection register
 * Flash Configuration Field offset address FPROT0 0x0008 FPROT1 0x0009 FPROT2 0x000A
 * FPROT3 0x000B To change the program flash protection that is loaded during
 * the reset sequence, unprotect the sector of program flash memory that contains
 * the Flash Configuration Field. Then, reprogram the program flash protection
 * byte.
 */
typedef union _hw_ftfl_fprot3
{
    uint8_t U;
    struct _hw_ftfl_fprot3_bitfields
    {
        uint8_t PROT : 8;              /*!< [7:0] Program Flash Region Protect */
    } B;
} hw_ftfl_fprot3_t;

/*!
 * @name Constants and macros for entire FTFL_FPROT3 register
 */
/*@{*/
#define HW_FTFL_FPROT3_ADDR(x)   ((uint32_t)(x) + 0x10U)

#define HW_FTFL_FPROT3(x)        (*(__IO hw_ftfl_fprot3_t *) HW_FTFL_FPROT3_ADDR(x))
#define HW_FTFL_FPROT3_RD(x)     (HW_FTFL_FPROT3(x).U)
#define HW_FTFL_FPROT3_WR(x, v)  (HW_FTFL_FPROT3(x).U = (v))
#define HW_FTFL_FPROT3_SET(x, v) (HW_FTFL_FPROT3_WR(x, HW_FTFL_FPROT3_RD(x) |  (v)))
#define HW_FTFL_FPROT3_CLR(x, v) (HW_FTFL_FPROT3_WR(x, HW_FTFL_FPROT3_RD(x) & ~(v)))
#define HW_FTFL_FPROT3_TOG(x, v) (HW_FTFL_FPROT3_WR(x, HW_FTFL_FPROT3_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FPROT3 bitfields
 */

/*!
 * @name Register FTFL_FPROT3, field PROT[7:0] (RW)
 *
 * Each program flash region can be protected from program and erase operations
 * by setting the associated PROT bit. In NVM Normal mode: The protection can
 * only be increased, meaning that currently unprotected memory can be protected,
 * but currently protected memory cannot be unprotected. Since unprotected regions
 * are marked with a 1 and protected regions use a 0, only writes changing 1s to
 * 0s are accepted. This 1-to-0 transition check is performed on a bit-by-bit
 * basis. Those FPROT bits with 1-to-0 transitions are accepted while all bits with
 * 0-to-1 transitions are ignored. In NVM Special mode: All bits of FPROT are
 * writable without restriction. Unprotected areas can be protected and protected
 * areas can be unprotected. The user must never write to any FPROT register while
 * a command is running (CCIF=0). Trying to alter data in any protected area in
 * the program flash memory results in a protection violation error and sets the
 * FSTAT[FPVIOL] bit. A full block erase of a program flash block is not possible
 * if it contains any protected region. Each bit in the 32-bit protection
 * register represents 1/32 of the total program flash.
 *
 * Values:
 * - 0 - Program flash region is protected.
 * - 1 - Program flash region is not protected
 */
/*@{*/
#define BP_FTFL_FPROT3_PROT  (0U)          /*!< Bit position for FTFL_FPROT3_PROT. */
#define BM_FTFL_FPROT3_PROT  (0xFFU)       /*!< Bit mask for FTFL_FPROT3_PROT. */
#define BS_FTFL_FPROT3_PROT  (8U)          /*!< Bit field size in bits for FTFL_FPROT3_PROT. */

/*! @brief Read current value of the FTFL_FPROT3_PROT field. */
#define BR_FTFL_FPROT3_PROT(x) (HW_FTFL_FPROT3(x).U)

