theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Set the SRAMLAP field to a new value. */
#define BW_MCM_CR_SRAMLAP(x, v) (HW_MCM_CR_WR(x, (HW_MCM_CR_RD(x) & ~BM_MCM_CR_SRAMLAP) | BF_MCM_CR_SRAMLAP(v)))
/*@}*/

/*!
 * @name Register MCM_CR, field SRAMLWP[30] (RW)
 *
 * When this bit is set, writes to SRAM_L array generates a bus error.
 */
/*@{*/
#define BP_MCM_CR_SRAMLWP    (30U)         /*!< Bit position for MCM_CR_SRAMLWP. */
#define BM_MCM_CR_SRAMLWP    (0x40000000U) /*!< Bit mask for MCM_CR_SRAMLWP. */
#define BS_MCM_CR_SRAMLWP    (1U)          /*!< Bit field size in bits for MCM_CR_SRAMLWP. */

/*! @brief Read current value of the MCM_CR_SRAMLWP field. */
#define BR_MCM_CR_SRAMLWP(x) (HW_MCM_CR(x).B.SRAMLWP)

/*! @brief Format value for bitfield MCM_CR_SRAMLWP. */
#define BF_MCM_CR_SRAMLWP(v) ((uint32_t)((uint32_t)(v) << BP_MCM_CR_SRAMLWP) & BM_MCM_CR_SRAMLWP)

/*! @brief Set the SRAMLWP field to a new value. */
#define BW_MCM_CR_SRAMLWP(x, v) (HW_MCM_CR_WR(x, (HW_MCM_CR_RD(x) & ~BM_MCM_CR_SRAMLWP) | BF_MCM_CR_SRAMLWP(v)))
/*@}*/

/*******************************************************************************
 * HW_MCM_ISR - Interrupt Status Register
 ******************************************************************************/

/*!
 * @brief HW_MCM_ISR - Interrupt Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_mcm_isr
{
    uint32_t U;
    struct _hw_mcm_isr_bitfields
    {
        uint32_t RESERVED0 : 1;        /*!< [0]  */
        uint32_t IRQ : 1;              /*!< [1] Normal Interrupt Pending */
        uint32_t NMI : 1;              /*!< [2] Non-maskable Interrupt Pending */
        uint32_t DHREQ : 1;            /*!< [3] Debug Halt Request Indicator */
        uint32_t RESERVED1 : 28;       /*!< [31:4]  */
    } B;
} hw_mcm_isr_t;

/*!
 * @name Constants and macros for entire MCM_ISR register
 */
/*@{*/
#define HW_MCM_ISR_ADDR(x)       ((uint32_t)(x) + 0x10U)

#define HW_MCM_ISR(x)            (*(__IO hw_mcm_isr_t *) HW_MCM_ISR_ADDR(x))
#define HW_MCM_ISR_RD(x)         (HW_MCM_ISR(x).U)
#define HW_MCM_ISR_WR(x, v)      (HW_MCM_ISR(x).U = (v))
#define HW_MCM_ISR_SET(x, v)     (HW_MCM_ISR_WR(x, HW_MCM_ISR_RD(x) |  (v)))
#define HW_MCM_ISR_CLR(x, v)     (HW_MCM_ISR_WR(x, HW_MCM_ISR_RD(x) & ~(v)))
#define HW_MCM_ISR_TOG(x, v)     (HW_MCM_ISR_WR(x, HW_MCM_ISR_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual MCM_ISR bitfields
 */

/*!
 * @name Register MCM_ISR, field IRQ[1] (W1C)
 *
 * If ETBCC[RSPT] is set to 01b, this bit is set when the ETB counter expires.
 *
 * Values:
 * - 0 - No pending interrupt
 * - 1 - Due to the ETB counter expiring, a normal interrupt is pending
 */
/*@{*/
#define BP_MCM_ISR_IRQ       (1U)          /*!< Bit position for MCM_ISR_IRQ. */
#define BM_MCM_ISR_IRQ       (0x00000002U) /*!< Bit mask for MCM_ISR_IRQ. */
#define BS_MCM_ISR_IRQ       (1U)          /*!< Bit field size in bits for MCM_ISR_IRQ. */

/*! @brief Read current value of the MCM_ISR_IRQ field. */
#define BR_MCM_ISR_IRQ(x)    (HW_MCM_ISR(x).B.IRQ)

/*! @brief Format value for bitfield MCM_ISR_IRQ. */
#define BF_MCM_ISR_IRQ(v)    ((uint32_t)((uint32_t)(v) << BP_MCM_ISR_IRQ) & BM_MCM_ISR_IRQ)

/*! @brief Set the IRQ field to a new value. */
#define BW_MCM_ISR_IRQ(x, v) (HW_MCM_ISR_WR(x, (HW_MCM_ISR_RD(x) & ~BM_MCM_ISR_IRQ) | BF_MCM_ISR_IRQ(v)))
/*@}*/

/*!
 * @name Register MCM_ISR, field NMI[2] (W1C)
 *
 * If ETBCC[RSPT] is set to 10b, this bit is set when the ETB counter expires.
 *
 * Values:
 * - 0 - No pending NMI
 * - 1 - Due to the ETB counter expiring, an NMI is pending
 */
/*@{*/
#define BP_MCM_ISR_NMI       (2U)          /*!< Bit position for MCM_ISR_NMI. */
#define BM_MCM_ISR_NMI       (0x00000004U) /*!< Bit mask for MCM_ISR_NMI. */
#define BS_MCM_ISR_NMI       (1U)          /*!< Bit field size in bits for MCM_ISR_NMI. */

/*! @brief Read current value of the MCM_ISR_NMI field. */
#define BR_MCM_ISR_NMI(x)    (HW_MCM_ISR(x).B.NMI)

/*! @brief Format value for bitfield MCM_ISR_NMI. */
#define BF_MCM_ISR_NMI(v)    ((uint32_t)((uint32_t)(v) << BP_MCM_ISR_NMI) & BM_MCM_ISR_NMI)

/*! @brief Set the NMI field to a new value. */
#define BW_MCM_ISR_NMI(x, v) (HW_MCM_ISR_WR(x, (HW_MCM_ISR_RD(x) & ~BM_MCM_ISR_NMI) | BF_MCM_ISR_NMI(v)))
/*@}*/

/*!
 * @name Register MCM_ISR, field DHREQ[3] (RO)
 *
 * Indicates that a debug halt request is initiated due to a ETB counter
 * expiration, ETBCC[2:0] = 3b111 & ETBCV[10:0] = 11h0. This bit is cleared when the
 * counter is disabled or when the ETB counter is reloaded.
 *
 * Values:
 * - 0 - No debug halt request
 * - 1 - Debug halt request initiated
 */
/*@{*/
#define BP_MCM_ISR_DHREQ     (3U)          /*!< Bit position for MCM_ISR_DHREQ. */
#define BM_MCM_ISR_DHREQ     (0x00000008U) /*!< Bit mask for MCM_ISR_DHREQ. */
#define BS_MCM_ISR_DHREQ     (1U)          /*!< Bit field size in bits for MCM_ISR_DHREQ. */

/*! @brief Read current value of the MCM_ISR_DHREQ field. */
#define BR_MCM_ISR_DHREQ(x)  (HW_MCM_ISR(x).B.DHREQ)
/*@}*/

/*******************************************************************************
 * HW_MCM_ETBCC - ETB Counter Control register
 ******************************************************************************/

/*!
 * @brief HW_MCM_ETBCC - ETB Counter Control register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_mcm_etbcc
{
    uint32_t U;
    struct _hw_mcm_etbcc_bitfields
    {
        uint32_t CNTEN : 1;            /*!< [0] Counter Enable */
        uint32_t RSPT : 2;             /*!< [2:1] Response Type */
        uint32_t RLRQ : 1;             /*!< [3] Reload Request */
        uint32_t ETDIS : 1;            /*!< [4] ETM-To-TPIU Disable */
        uint32_t ITDIS : 1;            /*!< [5] ITM-To-TPIU Disable */
        uint32_t RESERVED0 : 26;       /*!< [31:6]  */
    } B;
} hw_mcm_etbcc_t;

/*!
 * @name Constants and macros for entire MCM_ETBCC register
 */
/*@{*/
#define HW_MCM_ETBCC_ADDR(x)     ((uint32_t)(x) + 0x14U)

#define HW_MCM_ETBCC(x)          (*(__IO hw_mcm_etbcc_t *) HW_MCM_ETBCC_ADDR(x))
#define HW_MCM_ETBCC_RD(x)       (HW_MCM_ETBCC(x).U)
#define HW_MCM_ETBCC_WR(x, v)    (HW_MCM_ETBCC(x).U = (v))
#define HW_MCM_ETBCC_SET(x, v)   (HW_MCM_ETBCC_WR(x, HW_MCM_ETBCC_RD(x) |  (v)))
#define HW_MCM_ETBCC_CLR(x, v)   (HW_MCM_ETBCC_WR(x, HW_MCM_ETBCC_RD(x) & ~(v)))
#define HW_MCM_ETBCC_TOG(x, v)   (HW_MCM_ETBCC_WR(x, HW_MCM_ETBCC_RD(x) ^  (v)))
/*@}*/

