theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the TSI_GENCS_ESOR field. */
#define BR_TSI_GENCS_ESOR(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_ESOR))

/*! @brief Format value for bitfield TSI_GENCS_ESOR. */
#define BF_TSI_GENCS_ESOR(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_ESOR) & BM_TSI_GENCS_ESOR)

/*! @brief Set the ESOR field to a new value. */
#define BW_TSI_GENCS_ESOR(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_ESOR) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field ERIE[5] (RW)
 *
 * Caused either by a Short or Overrun Error.
 *
 * Values:
 * - 0 - Interrupt disabled for error.
 * - 1 - Interrupt enabled for error.
 */
/*@{*/
#define BP_TSI_GENCS_ERIE    (5U)          /*!< Bit position for TSI_GENCS_ERIE. */
#define BM_TSI_GENCS_ERIE    (0x00000020U) /*!< Bit mask for TSI_GENCS_ERIE. */
#define BS_TSI_GENCS_ERIE    (1U)          /*!< Bit field size in bits for TSI_GENCS_ERIE. */

/*! @brief Read current value of the TSI_GENCS_ERIE field. */
#define BR_TSI_GENCS_ERIE(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_ERIE))

/*! @brief Format value for bitfield TSI_GENCS_ERIE. */
#define BF_TSI_GENCS_ERIE(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_ERIE) & BM_TSI_GENCS_ERIE)

/*! @brief Set the ERIE field to a new value. */
#define BW_TSI_GENCS_ERIE(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_ERIE) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field TSIIE[6] (RW)
 *
 * Values:
 * - 0 - Interrupt from TSI is disabled.
 * - 1 - Interrupt from TSI is enabled.
 */
/*@{*/
#define BP_TSI_GENCS_TSIIE   (6U)          /*!< Bit position for TSI_GENCS_TSIIE. */
#define BM_TSI_GENCS_TSIIE   (0x00000040U) /*!< Bit mask for TSI_GENCS_TSIIE. */
#define BS_TSI_GENCS_TSIIE   (1U)          /*!< Bit field size in bits for TSI_GENCS_TSIIE. */

/*! @brief Read current value of the TSI_GENCS_TSIIE field. */
#define BR_TSI_GENCS_TSIIE(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_TSIIE))

/*! @brief Format value for bitfield TSI_GENCS_TSIIE. */
#define BF_TSI_GENCS_TSIIE(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_TSIIE) & BM_TSI_GENCS_TSIIE)

/*! @brief Set the TSIIE field to a new value. */
#define BW_TSI_GENCS_TSIIE(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_TSIIE) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field TSIEN[7] (RW)
 *
 * Values:
 * - 0 - TSI module is disabled.
 * - 1 - TSI module is enabled.
 */
/*@{*/
#define BP_TSI_GENCS_TSIEN   (7U)          /*!< Bit position for TSI_GENCS_TSIEN. */
#define BM_TSI_GENCS_TSIEN   (0x00000080U) /*!< Bit mask for TSI_GENCS_TSIEN. */
#define BS_TSI_GENCS_TSIEN   (1U)          /*!< Bit field size in bits for TSI_GENCS_TSIEN. */

/*! @brief Read current value of the TSI_GENCS_TSIEN field. */
#define BR_TSI_GENCS_TSIEN(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_TSIEN))

/*! @brief Format value for bitfield TSI_GENCS_TSIEN. */
#define BF_TSI_GENCS_TSIEN(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_TSIEN) & BM_TSI_GENCS_TSIEN)

/*! @brief Set the TSIEN field to a new value. */
#define BW_TSI_GENCS_TSIEN(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_TSIEN) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field SWTS[8] (WO)
 *
 * Write a 1 to this bit will start a scan sequence and write a 0 to this bit
 * has no effect.
 */
/*@{*/
#define BP_TSI_GENCS_SWTS    (8U)          /*!< Bit position for TSI_GENCS_SWTS. */
#define BM_TSI_GENCS_SWTS    (0x00000100U) /*!< Bit mask for TSI_GENCS_SWTS. */
#define BS_TSI_GENCS_SWTS    (1U)          /*!< Bit field size in bits for TSI_GENCS_SWTS. */

/*! @brief Format value for bitfield TSI_GENCS_SWTS. */
#define BF_TSI_GENCS_SWTS(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_SWTS) & BM_TSI_GENCS_SWTS)
/*@}*/

/*!
 * @name Register TSI_GENCS, field SCNIP[9] (RO)
 *
 * 1 indicates a scanning process is in progress. This bit is read-only and
 * changes automatically by the TSI model.
 */
/*@{*/
#define BP_TSI_GENCS_SCNIP   (9U)          /*!< Bit position for TSI_GENCS_SCNIP. */
#define BM_TSI_GENCS_SCNIP   (0x00000200U) /*!< Bit mask for TSI_GENCS_SCNIP. */
#define BS_TSI_GENCS_SCNIP   (1U)          /*!< Bit field size in bits for TSI_GENCS_SCNIP. */

/*! @brief Read current value of the TSI_GENCS_SCNIP field. */
#define BR_TSI_GENCS_SCNIP(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_SCNIP))
/*@}*/

/*!
 * @name Register TSI_GENCS, field OVRF[12] (W1C)
 *
 * This flag is set when a scan trigger occurs while a scan is still in
 * progress. Writing 1 to this bit will clear the flag to 0.
 *
 * Values:
 * - 0 - No overrun.
 * - 1 - Overrun occurred.
 */
/*@{*/
#define BP_TSI_GENCS_OVRF    (12U)         /*!< Bit position for TSI_GENCS_OVRF. */
#define BM_TSI_GENCS_OVRF    (0x00001000U) /*!< Bit mask for TSI_GENCS_OVRF. */
#define BS_TSI_GENCS_OVRF    (1U)          /*!< Bit field size in bits for TSI_GENCS_OVRF. */

/*! @brief Read current value of the TSI_GENCS_OVRF field. */
#define BR_TSI_GENCS_OVRF(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_OVRF))

/*! @brief Format value for bitfield TSI_GENCS_OVRF. */
#define BF_TSI_GENCS_OVRF(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_OVRF) & BM_TSI_GENCS_OVRF)

/*! @brief Set the OVRF field to a new value. */
#define BW_TSI_GENCS_OVRF(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_OVRF) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field EXTERF[13] (W1C)
 *
 * This flag is set when an active electrode has a result register either 0x0000
 * or 0xFFFF. Writing 1 to this bit will clear the flag to 0.
 *
 * Values:
 * - 0 - No fault happend on TSI electrodes.
 * - 1 - Short to VDD or VSS was detected on one or more electrodes.
 */
/*@{*/
#define BP_TSI_GENCS_EXTERF  (13U)         /*!< Bit position for TSI_GENCS_EXTERF. */
#define BM_TSI_GENCS_EXTERF  (0x00002000U) /*!< Bit mask for TSI_GENCS_EXTERF. */
#define BS_TSI_GENCS_EXTERF  (1U)          /*!< Bit field size in bits for TSI_GENCS_EXTERF. */

/*! @brief Read current value of the TSI_GENCS_EXTERF field. */
#define BR_TSI_GENCS_EXTERF(x) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_EXTERF))

/*! @brief Format value for bitfield TSI_GENCS_EXTERF. */
#define BF_TSI_GENCS_EXTERF(v) ((uint32_t)((uint32_t)(v) << BP_TSI_GENCS_EXTERF) & BM_TSI_GENCS_EXTERF)

/*! @brief Set the EXTERF field to a new value. */
#define BW_TSI_GENCS_EXTERF(x, v) (BITBAND_ACCESS32(HW_TSI_GENCS_ADDR(x), BP_TSI_GENCS_EXTERF) = (v))
/*@}*/

/*!
 * @name Register TSI_GENCS, field OUTRGF[14] (W1C)
 *
 * This flag is set if the result register of the low-power enabled electrode is
 * outside the range defined by the TSI_THRESHOLD register. This flag is set
 * only when the TSI is in low-power mode. It can be read after the CPU wakes up.
 * Writing 1 to this bit will clear the flag to 0.
 */
/*@{*/
#define BP_TSI_GENCS_OUTRGF  (14U)         /*!< Bit position for TSI_GENCS_OUTRGF. */
#define BM_TSI_GENCS_OUTRGF  (0x00004000U) /*!< Bit mask for TSI_GENCS_OUTRGF. */
#define BS_TSI_GENCS_OUTRGF  (1U)          /*!< Bit field size in bits for TSI_GENCS_OUTRGF. */

