theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Set the PEN3 field to a new value. */
#define BW_TSI_PEN_PEN3(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN3) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN4[4] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN4      (4U)          /*!< Bit position for TSI_PEN_PEN4. */
#define BM_TSI_PEN_PEN4      (0x00000010U) /*!< Bit mask for TSI_PEN_PEN4. */
#define BS_TSI_PEN_PEN4      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN4. */

/*! @brief Read current value of the TSI_PEN_PEN4 field. */
#define BR_TSI_PEN_PEN4(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN4))

/*! @brief Format value for bitfield TSI_PEN_PEN4. */
#define BF_TSI_PEN_PEN4(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN4) & BM_TSI_PEN_PEN4)

/*! @brief Set the PEN4 field to a new value. */
#define BW_TSI_PEN_PEN4(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN4) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN5[5] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN5      (5U)          /*!< Bit position for TSI_PEN_PEN5. */
#define BM_TSI_PEN_PEN5      (0x00000020U) /*!< Bit mask for TSI_PEN_PEN5. */
#define BS_TSI_PEN_PEN5      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN5. */

/*! @brief Read current value of the TSI_PEN_PEN5 field. */
#define BR_TSI_PEN_PEN5(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN5))

/*! @brief Format value for bitfield TSI_PEN_PEN5. */
#define BF_TSI_PEN_PEN5(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN5) & BM_TSI_PEN_PEN5)

/*! @brief Set the PEN5 field to a new value. */
#define BW_TSI_PEN_PEN5(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN5) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN6[6] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN6      (6U)          /*!< Bit position for TSI_PEN_PEN6. */
#define BM_TSI_PEN_PEN6      (0x00000040U) /*!< Bit mask for TSI_PEN_PEN6. */
#define BS_TSI_PEN_PEN6      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN6. */

/*! @brief Read current value of the TSI_PEN_PEN6 field. */
#define BR_TSI_PEN_PEN6(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN6))

/*! @brief Format value for bitfield TSI_PEN_PEN6. */
#define BF_TSI_PEN_PEN6(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN6) & BM_TSI_PEN_PEN6)

/*! @brief Set the PEN6 field to a new value. */
#define BW_TSI_PEN_PEN6(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN6) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN7[7] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN7      (7U)          /*!< Bit position for TSI_PEN_PEN7. */
#define BM_TSI_PEN_PEN7      (0x00000080U) /*!< Bit mask for TSI_PEN_PEN7. */
#define BS_TSI_PEN_PEN7      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN7. */

/*! @brief Read current value of the TSI_PEN_PEN7 field. */
#define BR_TSI_PEN_PEN7(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN7))

/*! @brief Format value for bitfield TSI_PEN_PEN7. */
#define BF_TSI_PEN_PEN7(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN7) & BM_TSI_PEN_PEN7)

/*! @brief Set the PEN7 field to a new value. */
#define BW_TSI_PEN_PEN7(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN7) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN8[8] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN8      (8U)          /*!< Bit position for TSI_PEN_PEN8. */
#define BM_TSI_PEN_PEN8      (0x00000100U) /*!< Bit mask for TSI_PEN_PEN8. */
#define BS_TSI_PEN_PEN8      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN8. */

/*! @brief Read current value of the TSI_PEN_PEN8 field. */
#define BR_TSI_PEN_PEN8(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN8))

/*! @brief Format value for bitfield TSI_PEN_PEN8. */
#define BF_TSI_PEN_PEN8(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN8) & BM_TSI_PEN_PEN8)

/*! @brief Set the PEN8 field to a new value. */
#define BW_TSI_PEN_PEN8(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN8) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN9[9] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN9      (9U)          /*!< Bit position for TSI_PEN_PEN9. */
#define BM_TSI_PEN_PEN9      (0x00000200U) /*!< Bit mask for TSI_PEN_PEN9. */
#define BS_TSI_PEN_PEN9      (1U)          /*!< Bit field size in bits for TSI_PEN_PEN9. */

/*! @brief Read current value of the TSI_PEN_PEN9 field. */
#define BR_TSI_PEN_PEN9(x)   (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN9))

/*! @brief Format value for bitfield TSI_PEN_PEN9. */
#define BF_TSI_PEN_PEN9(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_PEN9) & BM_TSI_PEN_PEN9)

/*! @brief Set the PEN9 field to a new value. */
#define BW_TSI_PEN_PEN9(x, v) (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN9) = (v))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN10[10] (RW)
 *
 * Values:
 * - 0 - The corresponding pin is not used by TSI.
 * - 1 - The corresponding pin is used by TSI.
 */
/*@{*/
#define BP_TSI_PEN_PEN10     (10U)         /*!< Bit position for TSI_PEN_PEN10. */
#define BM_TSI_PEN_PEN10     (0x00000400U) /*!< Bit mask for TSI_PEN_PEN10. */
#define BS_TSI_PEN_PEN10     (1U)          /*!< Bit field size in bits for TSI_PEN_PEN10. */

/*! @brief Read current value of the TSI_PEN_PEN10 field. */
#define BR_TSI_PEN_PEN10(x)  (BITBAND_ACCESS32(HW_TSI_PEN_ADDR(x), BP_TSI_PEN_PEN10))

