theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Format value for bitfield TSI_PEN_LPSP. */
#define BF_TSI_PEN_LPSP(v)   ((uint32_t)((uint32_t)(v) << BP_TSI_PEN_LPSP) & BM_TSI_PEN_LPSP)

/*! @brief Set the LPSP field to a new value. */
#define BW_TSI_PEN_LPSP(x, v) (HW_TSI_PEN_WR(x, (HW_TSI_PEN_RD(x) & ~BM_TSI_PEN_LPSP) | BF_TSI_PEN_LPSP(v)))
/*@}*/

/*******************************************************************************
 * HW_TSI_WUCNTR - Wake-Up Channel Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_WUCNTR - Wake-Up Channel Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_wucntr
{
    uint32_t U;
    struct _hw_tsi_wucntr_bitfields
    {
        uint32_t WUCNT : 16;           /*!< [15:0] Touch Sensing Wake-Up Channel 16-bit
                                        * Counter Value */
        uint32_t RESERVED0 : 16;       /*!< [31:16]  */
    } B;
} hw_tsi_wucntr_t;

/*!
 * @name Constants and macros for entire TSI_WUCNTR register
 */
/*@{*/
#define HW_TSI_WUCNTR_ADDR(x)    ((uint32_t)(x) + 0xCU)

#define HW_TSI_WUCNTR(x)         (*(__I hw_tsi_wucntr_t *) HW_TSI_WUCNTR_ADDR(x))
#define HW_TSI_WUCNTR_RD(x)      (HW_TSI_WUCNTR(x).U)
/*@}*/

/*
 * Constants & macros for individual TSI_WUCNTR bitfields
 */

/*!
 * @name Register TSI_WUCNTR, field WUCNT[15:0] (RO)
 */
/*@{*/
#define BP_TSI_WUCNTR_WUCNT  (0U)          /*!< Bit position for TSI_WUCNTR_WUCNT. */
#define BM_TSI_WUCNTR_WUCNT  (0x0000FFFFU) /*!< Bit mask for TSI_WUCNTR_WUCNT. */
#define BS_TSI_WUCNTR_WUCNT  (16U)         /*!< Bit field size in bits for TSI_WUCNTR_WUCNT. */

/*! @brief Read current value of the TSI_WUCNTR_WUCNT field. */
#define BR_TSI_WUCNTR_WUCNT(x) (HW_TSI_WUCNTR(x).B.WUCNT)
/*@}*/

/*******************************************************************************
 * HW_TSI_CNTR1 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR1 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr1
{
    uint32_t U;
    struct _hw_tsi_cntr1_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] Touch Sensing Channel n-1 16-bit
                                        * Counter Value */
        uint32_t CTN : 16;             /*!< [31:16] Touch Sensing Channel n 16-bit
                                        * Counter Value */
    } B;
} hw_tsi_cntr1_t;

/*!
 * @name Constants and macros for entire TSI_CNTR1 register
 */
/*@{*/
#define HW_TSI_CNTR1_ADDR(x)     ((uint32_t)(x) + 0x100U)

#define HW_TSI_CNTR1(x)          (*(__I hw_tsi_cntr1_t *) HW_TSI_CNTR1_ADDR(x))
#define HW_TSI_CNTR1_RD(x)       (HW_TSI_CNTR1(x).U)
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR1 bitfields
 */

/*!
 * @name Register TSI_CNTR1, field CTN1[15:0] (RO)
 */
/*@{*/
#define BP_TSI_CNTR1_CTN1    (0U)          /*!< Bit position for TSI_CNTR1_CTN1. */
#define BM_TSI_CNTR1_CTN1    (0x0000FFFFU) /*!< Bit mask for TSI_CNTR1_CTN1. */
#define BS_TSI_CNTR1_CTN1    (16U)         /*!< Bit field size in bits for TSI_CNTR1_CTN1. */

/*! @brief Read current value of the TSI_CNTR1_CTN1 field. */
#define BR_TSI_CNTR1_CTN1(x) (HW_TSI_CNTR1(x).B.CTN1)
/*@}*/

/*!
 * @name Register TSI_CNTR1, field CTN[31:16] (RO)
 */
/*@{*/
#define BP_TSI_CNTR1_CTN     (16U)         /*!< Bit position for TSI_CNTR1_CTN. */
#define BM_TSI_CNTR1_CTN     (0xFFFF0000U) /*!< Bit mask for TSI_CNTR1_CTN. */
#define BS_TSI_CNTR1_CTN     (16U)         /*!< Bit field size in bits for TSI_CNTR1_CTN. */

/*! @brief Read current value of the TSI_CNTR1_CTN field. */
#define BR_TSI_CNTR1_CTN(x)  (HW_TSI_CNTR1(x).B.CTN)
/*@}*/

/*******************************************************************************
 * HW_TSI_CNTR3 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR3 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr3
{
    uint32_t U;
    struct _hw_tsi_cntr3_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] Touch Sensing Channel n-1 16-bit
                                        * Counter Value */
        uint32_t CTN : 16;             /*!< [31:16] Touch Sensing Channel n 16-bit
                                        * Counter Value */
    } B;
} hw_tsi_cntr3_t;

/*!
 * @name Constants and macros for entire TSI_CNTR3 register
 */
/*@{*/
#define HW_TSI_CNTR3_ADDR(x)     ((uint32_t)(x) + 0x104U)

#define HW_TSI_CNTR3(x)          (*(__I hw_tsi_cntr3_t *) HW_TSI_CNTR3_ADDR(x))
#define HW_TSI_CNTR3_RD(x)       (HW_TSI_CNTR3(x).U)
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR3 bitfields
 */

/*!
 * @name Register TSI_CNTR3, field CTN1[15:0] (RO)
 */
/*@{*/
#define BP_TSI_CNTR3_CTN1    (0U)          /*!< Bit position for TSI_CNTR3_CTN1. */
#define BM_TSI_CNTR3_CTN1    (0x0000FFFFU) /*!< Bit mask for TSI_CNTR3_CTN1. */
#define BS_TSI_CNTR3_CTN1    (16U)         /*!< Bit field size in bits for TSI_CNTR3_CTN1. */

/*! @brief Read current value of the TSI_CNTR3_CTN1 field. */
#define BR_TSI_CNTR3_CTN1(x) (HW_TSI_CNTR3(x).B.CTN1)
/*@}*/

/*!
 * @name Register TSI_CNTR3, field CTN[31:16] (RO)
 */
/*@{*/
#define BP_TSI_CNTR3_CTN     (16U)         /*!< Bit position for TSI_CNTR3_CTN. */
#define BM_TSI_CNTR3_CTN     (0xFFFF0000U) /*!< Bit mask for TSI_CNTR3_CTN. */
#define BS_TSI_CNTR3_CTN     (16U)         /*!< Bit field size in bits for TSI_CNTR3_CTN. */

/*! @brief Read current value of the TSI_CNTR3_CTN field. */
#define BR_TSI_CNTR3_CTN(x)  (HW_TSI_CNTR3(x).B.CTN)
/*@}*/

/*******************************************************************************
 * HW_TSI_CNTR5 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR5 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr5
{
    uint32_t U;
    struct _hw_tsi_cntr5_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] Touch Sensing Channel n-1 16-bit
                                        * Counter Value */
        uint32_t CTN : 16;             /*!< [31:16] Touch Sensing Channel n 16-bit
                                        * Counter Value */
    } B;
} hw_tsi_cntr5_t;

/*!
 * @name Constants and macros for entire TSI_CNTR5 register
 */
/*@{*/
#define HW_TSI_CNTR5_ADDR(x)     ((uint32_t)(x) + 0x108U)

#define HW_TSI_CNTR5(x)          (*(__I hw_tsi_cntr5_t *) HW_TSI_CNTR5_ADDR(x))
#define HW_TSI_CNTR5_RD(x)       (HW_TSI_CNTR5(x).U)
/*@}*/

