theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the TSI_CNTR11_CTN1 field. */
#define BR_TSI_CNTR11_CTN1(x) (HW_TSI_CNTR11(x).B.CTN1)
/*@}*/

/*!
 * @name Register TSI_CNTR11, field CTN[31:16] (RO)
 */
/*@{*/
#define BP_TSI_CNTR11_CTN    (16U)         /*!< Bit position for TSI_CNTR11_CTN. */
#define BM_TSI_CNTR11_CTN    (0xFFFF0000U) /*!< Bit mask for TSI_CNTR11_CTN. */
#define BS_TSI_CNTR11_CTN    (16U)         /*!< Bit field size in bits for TSI_CNTR11_CTN. */

/*! @brief Read current value of the TSI_CNTR11_CTN field. */
#define BR_TSI_CNTR11_CTN(x) (HW_TSI_CNTR11(x).B.CTN)
/*@}*/

/*******************************************************************************
 * HW_TSI_CNTR13 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR13 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr13
{
    uint32_t U;
    struct _hw_tsi_cntr13_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] Touch Sensing Channel n-1 16-bit
                                        * Counter Value */
        uint32_t CTN : 16;             /*!< [31:16] Touch Sensing Channel n 16-bit
                                        * Counter Value */
    } B;
} hw_tsi_cntr13_t;

/*!
 * @name Constants and macros for entire TSI_CNTR13 register
 */
/*@{*/
#define HW_TSI_CNTR13_ADDR(x)    ((uint32_t)(x) + 0x118U)

#define HW_TSI_CNTR13(x)         (*(__I hw_tsi_cntr13_t *) HW_TSI_CNTR13_ADDR(x))
#define HW_TSI_CNTR13_RD(x)      (HW_TSI_CNTR13(x).U)
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR13 bitfields
 */

/*!
 * @name Register TSI_CNTR13, field CTN1[15:0] (RO)
 */
/*@{*/
#define BP_TSI_CNTR13_CTN1   (0U)          /*!< Bit position for TSI_CNTR13_CTN1. */
#define BM_TSI_CNTR13_CTN1   (0x0000FFFFU) /*!< Bit mask for TSI_CNTR13_CTN1. */
#define BS_TSI_CNTR13_CTN1   (16U)         /*!< Bit field size in bits for TSI_CNTR13_CTN1. */

/*! @brief Read current value of the TSI_CNTR13_CTN1 field. */
#define BR_TSI_CNTR13_CTN1(x) (HW_TSI_CNTR13(x).B.CTN1)
/*@}*/

/*!
 * @name Register TSI_CNTR13, field CTN[31:16] (RO)
 */
/*@{*/
#define BP_TSI_CNTR13_CTN    (16U)         /*!< Bit position for TSI_CNTR13_CTN. */
#define BM_TSI_CNTR13_CTN    (0xFFFF0000U) /*!< Bit mask for TSI_CNTR13_CTN. */
#define BS_TSI_CNTR13_CTN    (16U)         /*!< Bit field size in bits for TSI_CNTR13_CTN. */

/*! @brief Read current value of the TSI_CNTR13_CTN field. */
#define BR_TSI_CNTR13_CTN(x) (HW_TSI_CNTR13(x).B.CTN)
/*@}*/

/*******************************************************************************
 * HW_TSI_CNTR15 - Counter Register
 ******************************************************************************/

/*!
 * @brief HW_TSI_CNTR15 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_cntr15
{
    uint32_t U;
    struct _hw_tsi_cntr15_bitfields
    {
        uint32_t CTN1 : 16;            /*!< [15:0] Touch Sensing Channel n-1 16-bit
                                        * Counter Value */
        uint32_t CTN : 16;             /*!< [31:16] Touch Sensing Channel n 16-bit
                                        * Counter Value */
    } B;
} hw_tsi_cntr15_t;

/*!
 * @name Constants and macros for entire TSI_CNTR15 register
 */
/*@{*/
#define HW_TSI_CNTR15_ADDR(x)    ((uint32_t)(x) + 0x11CU)

#define HW_TSI_CNTR15(x)         (*(__I hw_tsi_cntr15_t *) HW_TSI_CNTR15_ADDR(x))
#define HW_TSI_CNTR15_RD(x)      (HW_TSI_CNTR15(x).U)
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR15 bitfields
 */

/*!
 * @name Register TSI_CNTR15, field CTN1[15:0] (RO)
 */
/*@{*/
#define BP_TSI_CNTR15_CTN1   (0U)          /*!< Bit position for TSI_CNTR15_CTN1. */
#define BM_TSI_CNTR15_CTN1   (0x0000FFFFU) /*!< Bit mask for TSI_CNTR15_CTN1. */
#define BS_TSI_CNTR15_CTN1   (16U)         /*!< Bit field size in bits for TSI_CNTR15_CTN1. */

/*! @brief Read current value of the TSI_CNTR15_CTN1 field. */
#define BR_TSI_CNTR15_CTN1(x) (HW_TSI_CNTR15(x).B.CTN1)
/*@}*/

/*!
 * @name Register TSI_CNTR15, field CTN[31:16] (RO)
 */
/*@{*/
#define BP_TSI_CNTR15_CTN    (16U)         /*!< Bit position for TSI_CNTR15_CTN. */
#define BM_TSI_CNTR15_CTN    (0xFFFF0000U) /*!< Bit mask for TSI_CNTR15_CTN. */
#define BS_TSI_CNTR15_CTN    (16U)         /*!< Bit field size in bits for TSI_CNTR15_CTN. */

/*! @brief Read current value of the TSI_CNTR15_CTN field. */
#define BR_TSI_CNTR15_CTN(x) (HW_TSI_CNTR15(x).B.CTN)
/*@}*/

/*******************************************************************************
 * HW_TSI_THRESHOLD - Low-Power Channel Threshold register
 ******************************************************************************/

/*!
 * @brief HW_TSI_THRESHOLD - Low-Power Channel Threshold register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_tsi_threshold
{
    uint32_t U;
    struct _hw_tsi_threshold_bitfields
    {
        uint32_t HTHH : 16;            /*!< [15:0] Touch Sensing Channel High Threshold
                                        * Value */
        uint32_t LTHH : 16;            /*!< [31:16] Touch Sensing Channel Low Threshold
                                        * Value */
    } B;
} hw_tsi_threshold_t;

/*!
 * @name Constants and macros for entire TSI_THRESHOLD register
 */
/*@{*/
#define HW_TSI_THRESHOLD_ADDR(x) ((uint32_t)(x) + 0x120U)

#define HW_TSI_THRESHOLD(x)      (*(__IO hw_tsi_threshold_t *) HW_TSI_THRESHOLD_ADDR(x))
#define HW_TSI_THRESHOLD_RD(x)   (HW_TSI_THRESHOLD(x).U)
#define HW_TSI_THRESHOLD_WR(x, v) (HW_TSI_THRESHOLD(x).U = (v))
#define HW_TSI_THRESHOLD_SET(x, v) (HW_TSI_THRESHOLD_WR(x, HW_TSI_THRESHOLD_RD(x) |  (v)))
#define HW_TSI_THRESHOLD_CLR(x, v) (HW_TSI_THRESHOLD_WR(x, HW_TSI_THRESHOLD_RD(x) & ~(v)))
#define HW_TSI_THRESHOLD_TOG(x, v) (HW_TSI_THRESHOLD_WR(x, HW_TSI_THRESHOLD_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual TSI_THRESHOLD bitfields
 */

/*!
 * @name Register TSI_THRESHOLD, field HTHH[15:0] (RW)
 */
/*@{*/
#define BP_TSI_THRESHOLD_HTHH (0U)         /*!< Bit position for TSI_THRESHOLD_HTHH. */
#define BM_TSI_THRESHOLD_HTHH (0x0000FFFFU) /*!< Bit mask for TSI_THRESHOLD_HTHH. */
#define BS_TSI_THRESHOLD_HTHH (16U)        /*!< Bit field size in bits for TSI_THRESHOLD_HTHH. */

/*! @brief Read current value of the TSI_THRESHOLD_HTHH field. */
#define BR_TSI_THRESHOLD_HTHH(x) (HW_TSI_THRESHOLD(x).B.HTHH)

/*! @brief Format value for bitfield TSI_THRESHOLD_HTHH. */
#define BF_TSI_THRESHOLD_HTHH(v) ((uint32_t)((uint32_t)(v) << BP_TSI_THRESHOLD_HTHH) & BM_TSI_THRESHOLD_HTHH)

/*! @brief Set the HTHH field to a new value. */
#define BW_TSI_THRESHOLD_HTHH(x, v) (HW_TSI_THRESHOLD_WR(x, (HW_TSI_THRESHOLD_RD(x) & ~BM_TSI_THRESHOLD_HTHH) | BF_TSI_THRESHOLD_HTHH(v)))
/*@}*/

/*!
 * @name Register TSI_THRESHOLD, field LTHH[31:16] (RW)
 */
/*@{*/
#define BP_TSI_THRESHOLD_LTHH (16U)        /*!< Bit position for TSI_THRESHOLD_LTHH. */
#define BM_TSI_THRESHOLD_LTHH (0xFFFF0000U) /*!< Bit mask for TSI_THRESHOLD_LTHH. */
#define BS_TSI_THRESHOLD_LTHH (16U)        /*!< Bit field size in bits for TSI_THRESHOLD_LTHH. */

/*! @brief Read current value of the TSI_THRESHOLD_LTHH field. */
#define BR_TSI_THRESHOLD_LTHH(x) (HW_TSI_THRESHOLD(x).B.LTHH)

/*! @brief Format value for bitfield TSI_THRESHOLD_LTHH. */
#define BF_TSI_THRESHOLD_LTHH(v) ((uint32_t)((uint32_t)(v) << BP_TSI_THRESHOLD_LTHH) & BM_TSI_THRESHOLD_LTHH)

/*! @brief Set the LTHH field to a new value. */
#define BW_TSI_THRESHOLD_LTHH(x, v) (HW_TSI_THRESHOLD_WR(x, (HW_TSI_THRESHOLD_RD(x) & ~BM_TSI_THRESHOLD_LTHH) | BF_TSI_THRESHOLD_LTHH(v)))
/*@}*/

