theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Read current value of the UART_IE_PCTEIE field. */
#define BR_UART_IE_PCTEIE(x) (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_PCTEIE))

/*! @brief Format value for bitfield UART_IE_PCTEIE. */
#define BF_UART_IE_PCTEIE(v) ((uint8_t)((uint8_t)(v) << BP_UART_IE_PCTEIE) & BM_UART_IE_PCTEIE)

/*! @brief Set the PCTEIE field to a new value. */
#define BW_UART_IE_PCTEIE(x, v) (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_PCTEIE) = (v))
/*@}*/

/*!
 * @name Register UART_IE, field PTXIE[3] (RW)
 *
 * Interrupt enable for packet transmitted flag.
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
#define BP_UART_IE_PTXIE     (3U)          /*!< Bit position for UART_IE_PTXIE. */
#define BM_UART_IE_PTXIE     (0x08U)       /*!< Bit mask for UART_IE_PTXIE. */
#define BS_UART_IE_PTXIE     (1U)          /*!< Bit field size in bits for UART_IE_PTXIE. */

/*! @brief Read current value of the UART_IE_PTXIE field. */
#define BR_UART_IE_PTXIE(x)  (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_PTXIE))

/*! @brief Format value for bitfield UART_IE_PTXIE. */
#define BF_UART_IE_PTXIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART_IE_PTXIE) & BM_UART_IE_PTXIE)

/*! @brief Set the PTXIE field to a new value. */
#define BW_UART_IE_PTXIE(x, v) (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_PTXIE) = (v))
/*@}*/

/*!
 * @name Register UART_IE, field PRXIE[4] (RW)
 *
 * Interrupt enable for packet received flag.
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
#define BP_UART_IE_PRXIE     (4U)          /*!< Bit position for UART_IE_PRXIE. */
#define BM_UART_IE_PRXIE     (0x10U)       /*!< Bit mask for UART_IE_PRXIE. */
#define BS_UART_IE_PRXIE     (1U)          /*!< Bit field size in bits for UART_IE_PRXIE. */

/*! @brief Read current value of the UART_IE_PRXIE field. */
#define BR_UART_IE_PRXIE(x)  (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_PRXIE))

/*! @brief Format value for bitfield UART_IE_PRXIE. */
#define BF_UART_IE_PRXIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART_IE_PRXIE) & BM_UART_IE_PRXIE)

/*! @brief Set the PRXIE field to a new value. */
#define BW_UART_IE_PRXIE(x, v) (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_PRXIE) = (v))
/*@}*/

/*!
 * @name Register UART_IE, field ISDIE[5] (RW)
 *
 * Interrupt enable for initial synchronization detection flag. This field
 * cannot be cleared except by disabling CEA709. Therefore, ISDIE must be cleared when
 * the first initial sync detection interrupt occurs. If the ISD interrupt is
 * not disabled in the interrupt handler, then user will continuously get
 * interrupts.
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
#define BP_UART_IE_ISDIE     (5U)          /*!< Bit position for UART_IE_ISDIE. */
#define BM_UART_IE_ISDIE     (0x20U)       /*!< Bit mask for UART_IE_ISDIE. */
#define BS_UART_IE_ISDIE     (1U)          /*!< Bit field size in bits for UART_IE_ISDIE. */

/*! @brief Read current value of the UART_IE_ISDIE field. */
#define BR_UART_IE_ISDIE(x)  (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_ISDIE))

/*! @brief Format value for bitfield UART_IE_ISDIE. */
#define BF_UART_IE_ISDIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART_IE_ISDIE) & BM_UART_IE_ISDIE)

/*! @brief Set the ISDIE field to a new value. */
#define BW_UART_IE_ISDIE(x, v) (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_ISDIE) = (v))
/*@}*/

/*!
 * @name Register UART_IE, field WBEIE[6] (RW)
 *
 * Interrupt enable for WBASE expired flag.
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
#define BP_UART_IE_WBEIE     (6U)          /*!< Bit position for UART_IE_WBEIE. */
#define BM_UART_IE_WBEIE     (0x40U)       /*!< Bit mask for UART_IE_WBEIE. */
#define BS_UART_IE_WBEIE     (1U)          /*!< Bit field size in bits for UART_IE_WBEIE. */

/*! @brief Read current value of the UART_IE_WBEIE field. */
#define BR_UART_IE_WBEIE(x)  (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_WBEIE))

/*! @brief Format value for bitfield UART_IE_WBEIE. */
#define BF_UART_IE_WBEIE(v)  ((uint8_t)((uint8_t)(v) << BP_UART_IE_WBEIE) & BM_UART_IE_WBEIE)

/*! @brief Set the WBEIE field to a new value. */
#define BW_UART_IE_WBEIE(x, v) (BITBAND_ACCESS8(HW_UART_IE_ADDR(x), BP_UART_IE_WBEIE) = (v))
/*@}*/

/*******************************************************************************
 * HW_UART_WB - UART CEA709.1-B WBASE
 ******************************************************************************/

/*!
 * @brief HW_UART_WB - UART CEA709.1-B WBASE (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_wb
{
    uint8_t U;
    struct _hw_uart_wb_bitfields
    {
        uint8_t WBASE : 8;             /*!< [7:0] CEA709.1-B WBASE register */
    } B;
} hw_uart_wb_t;

/*!
 * @name Constants and macros for entire UART_WB register
 */
/*@{*/
#define HW_UART_WB_ADDR(x)       ((uint32_t)(x) + 0x2AU)

#define HW_UART_WB(x)            (*(__IO hw_uart_wb_t *) HW_UART_WB_ADDR(x))
#define HW_UART_WB_RD(x)         (HW_UART_WB(x).U)
#define HW_UART_WB_WR(x, v)      (HW_UART_WB(x).U = (v))
#define HW_UART_WB_SET(x, v)     (HW_UART_WB_WR(x, HW_UART_WB_RD(x) |  (v)))
#define HW_UART_WB_CLR(x, v)     (HW_UART_WB_WR(x, HW_UART_WB_RD(x) & ~(v)))
#define HW_UART_WB_TOG(x, v)     (HW_UART_WB_WR(x, HW_UART_WB_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_WB bitfields
 */

/*!
 * @name Register UART_WB, field WBASE[7:0] (RW)
 *
 * Size of the basic randomizing window in bit periods after Beta1 time period.
 */
/*@{*/
#define BP_UART_WB_WBASE     (0U)          /*!< Bit position for UART_WB_WBASE. */
#define BM_UART_WB_WBASE     (0xFFU)       /*!< Bit mask for UART_WB_WBASE. */
#define BS_UART_WB_WBASE     (8U)          /*!< Bit field size in bits for UART_WB_WBASE. */

/*! @brief Read current value of the UART_WB_WBASE field. */
#define BR_UART_WB_WBASE(x)  (HW_UART_WB(x).U)

