theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Format value for bitfield UART_WB_WBASE. */
#define BF_UART_WB_WBASE(v)  ((uint8_t)((uint8_t)(v) << BP_UART_WB_WBASE) & BM_UART_WB_WBASE)

/*! @brief Set the WBASE field to a new value. */
#define BW_UART_WB_WBASE(x, v) (HW_UART_WB_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_S3 - UART CEA709.1-B Status Register
 ******************************************************************************/

/*!
 * @brief HW_UART_S3 - UART CEA709.1-B Status Register (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_s3
{
    uint8_t U;
    struct _hw_uart_s3_bitfields
    {
        uint8_t TXFF : 1;              /*!< [0] Transmission Fail Flag */
        uint8_t PSF : 1;               /*!< [1] Preamble Start Flag */
        uint8_t PCTEF : 1;             /*!< [2] Packet Cycle Timer Expired Flag */
        uint8_t PTXF : 1;              /*!< [3] Packet Transmitted Flag */
        uint8_t PRXF : 1;              /*!< [4] Packet Received Flag */
        uint8_t ISD : 1;               /*!< [5] Initial Sync Detect */
        uint8_t WBEF : 1;              /*!< [6] Wbase Expired Flag */
        uint8_t PEF : 1;               /*!< [7] Preamble Error Flag */
    } B;
} hw_uart_s3_t;

/*!
 * @name Constants and macros for entire UART_S3 register
 */
/*@{*/
#define HW_UART_S3_ADDR(x)       ((uint32_t)(x) + 0x2BU)

#define HW_UART_S3(x)            (*(__IO hw_uart_s3_t *) HW_UART_S3_ADDR(x))
#define HW_UART_S3_RD(x)         (HW_UART_S3(x).U)
#define HW_UART_S3_WR(x, v)      (HW_UART_S3(x).U = (v))
#define HW_UART_S3_SET(x, v)     (HW_UART_S3_WR(x, HW_UART_S3_RD(x) |  (v)))
#define HW_UART_S3_CLR(x, v)     (HW_UART_S3_WR(x, HW_UART_S3_RD(x) & ~(v)))
#define HW_UART_S3_TOG(x, v)     (HW_UART_S3_WR(x, HW_UART_S3_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_S3 bitfields
 */

/*!
 * @name Register UART_S3, field TXFF[0] (RW)
 *
 * Indicates that transmission could not proceed. This flag is asserted when the
 * packet is queued for transmission but before the random delay has expired and
 * an incoming receive packet is detected. This flag is also asserted while
 * transmission when the TX FIFO becomes empty or overflows. In these cases, line
 * code violation is transmitted on TX line immediately after the current byte or
 * preamble transmission is finished, without waiting for completion of transmit
 * packet length. If the transmission fail flag is asserted, C6[TX709] is cleared.
 * This flag is cleared by writing 1.
 *
 * Values:
 * - 0 - Transmission continues normally.
 * - 1 - Transmission has failed.
 */
/*@{*/
#define BP_UART_S3_TXFF      (0U)          /*!< Bit position for UART_S3_TXFF. */
#define BM_UART_S3_TXFF      (0x01U)       /*!< Bit mask for UART_S3_TXFF. */
#define BS_UART_S3_TXFF      (1U)          /*!< Bit field size in bits for UART_S3_TXFF. */

/*! @brief Read current value of the UART_S3_TXFF field. */
#define BR_UART_S3_TXFF(x)   (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_TXFF))

/*! @brief Format value for bitfield UART_S3_TXFF. */
#define BF_UART_S3_TXFF(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S3_TXFF) & BM_UART_S3_TXFF)

/*! @brief Set the TXFF field to a new value. */
#define BW_UART_S3_TXFF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_TXFF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PSF[1] (RW)
 *
 * Indicates start of the preamble while the packet is being transmitted. This
 * flag is cleared by writing 1.
 *
 * Values:
 * - 0 - Preamble start is not detected.
 * - 1 - Preamble start is detected.
 */
/*@{*/
#define BP_UART_S3_PSF       (1U)          /*!< Bit position for UART_S3_PSF. */
#define BM_UART_S3_PSF       (0x02U)       /*!< Bit mask for UART_S3_PSF. */
#define BS_UART_S3_PSF       (1U)          /*!< Bit field size in bits for UART_S3_PSF. */

/*! @brief Read current value of the UART_S3_PSF field. */
#define BR_UART_S3_PSF(x)    (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PSF))

/*! @brief Format value for bitfield UART_S3_PSF. */
#define BF_UART_S3_PSF(v)    ((uint8_t)((uint8_t)(v) << BP_UART_S3_PSF) & BM_UART_S3_PSF)

/*! @brief Set the PSF field to a new value. */
#define BW_UART_S3_PSF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PSF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PCTEF[2] (RW)
 *
 * Indicates that packet cycle time period has expired with no activity on the
 * line. This flag is cleared by writing 1.
 *
 * Values:
 * - 0 - Packet cycle time has not expired.
 * - 1 - Packet cycle time has expired.
 */
/*@{*/
#define BP_UART_S3_PCTEF     (2U)          /*!< Bit position for UART_S3_PCTEF. */
#define BM_UART_S3_PCTEF     (0x04U)       /*!< Bit mask for UART_S3_PCTEF. */
#define BS_UART_S3_PCTEF     (1U)          /*!< Bit field size in bits for UART_S3_PCTEF. */

/*! @brief Read current value of the UART_S3_PCTEF field. */
#define BR_UART_S3_PCTEF(x)  (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PCTEF))

/*! @brief Format value for bitfield UART_S3_PCTEF. */
#define BF_UART_S3_PCTEF(v)  ((uint8_t)((uint8_t)(v) << BP_UART_S3_PCTEF) & BM_UART_S3_PCTEF)

/*! @brief Set the PCTEF field to a new value. */
#define BW_UART_S3_PCTEF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PCTEF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PTXF[3] (RW)
 *
 * Indicates that complete packet is transmitted. This flag is cleared by
 * writing 1. In case TX packet gets aborted due to FIFO becoming empty or an overflow,
 * packet transmitted flag will still be generated.
 *
 * Values:
 * - 0 - Packet transmission is not complete.
 * - 1 - Packet transmission is complete.
 */
/*@{*/
#define BP_UART_S3_PTXF      (3U)          /*!< Bit position for UART_S3_PTXF. */
#define BM_UART_S3_PTXF      (0x08U)       /*!< Bit mask for UART_S3_PTXF. */
#define BS_UART_S3_PTXF      (1U)          /*!< Bit field size in bits for UART_S3_PTXF. */

/*! @brief Read current value of the UART_S3_PTXF field. */
#define BR_UART_S3_PTXF(x)   (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PTXF))

/*! @brief Format value for bitfield UART_S3_PTXF. */
#define BF_UART_S3_PTXF(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S3_PTXF) & BM_UART_S3_PTXF)

