theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Set the PTXF field to a new value. */
#define BW_UART_S3_PTXF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PTXF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PRXF[4] (RW)
 *
 * Indicates that complete packet is received. This flag is cleared by writing 1.
 *
 * Values:
 * - 0 - Packet is not received.
 * - 1 - Packet is received.
 */
/*@{*/
#define BP_UART_S3_PRXF      (4U)          /*!< Bit position for UART_S3_PRXF. */
#define BM_UART_S3_PRXF      (0x10U)       /*!< Bit mask for UART_S3_PRXF. */
#define BS_UART_S3_PRXF      (1U)          /*!< Bit field size in bits for UART_S3_PRXF. */

/*! @brief Read current value of the UART_S3_PRXF field. */
#define BR_UART_S3_PRXF(x)   (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PRXF))

/*! @brief Format value for bitfield UART_S3_PRXF. */
#define BF_UART_S3_PRXF(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S3_PRXF) & BM_UART_S3_PRXF)

/*! @brief Set the PRXF field to a new value. */
#define BW_UART_S3_PRXF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PRXF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field ISD[5] (RO)
 *
 * Indicates that initially, a valid one and a line code violation is detected.
 * This flag is cleared by deasserting EN709 bit.
 *
 * Values:
 * - 0 - Initial sync is not detected.
 * - 1 - Initial sync is detected.
 */
/*@{*/
#define BP_UART_S3_ISD       (5U)          /*!< Bit position for UART_S3_ISD. */
#define BM_UART_S3_ISD       (0x20U)       /*!< Bit mask for UART_S3_ISD. */
#define BS_UART_S3_ISD       (1U)          /*!< Bit field size in bits for UART_S3_ISD. */

/*! @brief Read current value of the UART_S3_ISD field. */
#define BR_UART_S3_ISD(x)    (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_ISD))
/*@}*/

/*!
 * @name Register UART_S3, field WBEF[6] (RW)
 *
 * Indicates that the Wbase time period has expired after beta1 time slots. This
 * flag is cleared by writing 1.
 *
 * Values:
 * - 0 - WBASE time period has not expired.
 * - 1 - WBASE time period has expired after beta1 time slots.
 */
/*@{*/
#define BP_UART_S3_WBEF      (6U)          /*!< Bit position for UART_S3_WBEF. */
#define BM_UART_S3_WBEF      (0x40U)       /*!< Bit mask for UART_S3_WBEF. */
#define BS_UART_S3_WBEF      (1U)          /*!< Bit field size in bits for UART_S3_WBEF. */

/*! @brief Read current value of the UART_S3_WBEF field. */
#define BR_UART_S3_WBEF(x)   (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_WBEF))

/*! @brief Format value for bitfield UART_S3_WBEF. */
#define BF_UART_S3_WBEF(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S3_WBEF) & BM_UART_S3_WBEF)

/*! @brief Set the WBEF field to a new value. */
#define BW_UART_S3_WBEF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_WBEF) = (v))
/*@}*/

/*!
 * @name Register UART_S3, field PEF[7] (RW)
 *
 * Indicates that the received preamble has an error. If the received preamble
 * length is greater than or less than the transmit preamble length, the preamble
 * error flag is asserted. This flag is cleared by writing 1.
 *
 * Values:
 * - 0 - Preamble is correct.
 * - 1 - Preamble has an error.
 */
/*@{*/
#define BP_UART_S3_PEF       (7U)          /*!< Bit position for UART_S3_PEF. */
#define BM_UART_S3_PEF       (0x80U)       /*!< Bit mask for UART_S3_PEF. */
#define BS_UART_S3_PEF       (1U)          /*!< Bit field size in bits for UART_S3_PEF. */

/*! @brief Read current value of the UART_S3_PEF field. */
#define BR_UART_S3_PEF(x)    (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PEF))

/*! @brief Format value for bitfield UART_S3_PEF. */
#define BF_UART_S3_PEF(v)    ((uint8_t)((uint8_t)(v) << BP_UART_S3_PEF) & BM_UART_S3_PEF)

/*! @brief Set the PEF field to a new value. */
#define BW_UART_S3_PEF(x, v) (BITBAND_ACCESS8(HW_UART_S3_ADDR(x), BP_UART_S3_PEF) = (v))
/*@}*/

/*******************************************************************************
 * HW_UART_S4 - UART CEA709.1-B Status Register
 ******************************************************************************/

/*!
 * @brief HW_UART_S4 - UART CEA709.1-B Status Register (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_s4
{
    uint8_t U;
    struct _hw_uart_s4_bitfields
    {
        uint8_t FE : 1;                /*!< [0] Framing Error */
        uint8_t ILCV : 1;              /*!< [1] Improper Line Code Violation */
        uint8_t CDET : 2;              /*!< [3:2] CDET */
        uint8_t INITF : 1;             /*!< [4] Initial Synchronization Fail Flag */
        uint8_t RESERVED0 : 3;         /*!< [7:5]  */
    } B;
} hw_uart_s4_t;

/*!
 * @name Constants and macros for entire UART_S4 register
 */
/*@{*/
#define HW_UART_S4_ADDR(x)       ((uint32_t)(x) + 0x2CU)

#define HW_UART_S4(x)            (*(__IO hw_uart_s4_t *) HW_UART_S4_ADDR(x))
#define HW_UART_S4_RD(x)         (HW_UART_S4(x).U)
#define HW_UART_S4_WR(x, v)      (HW_UART_S4(x).U = (v))
#define HW_UART_S4_SET(x, v)     (HW_UART_S4_WR(x, HW_UART_S4_RD(x) |  (v)))
#define HW_UART_S4_CLR(x, v)     (HW_UART_S4_WR(x, HW_UART_S4_RD(x) & ~(v)))
#define HW_UART_S4_TOG(x, v)     (HW_UART_S4_WR(x, HW_UART_S4_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_S4 bitfields
 */

/*!
 * @name Register UART_S4, field FE[0] (RW)
 *
 * Indicates that the received CEA709.1-B packet has finished at byte boundary.
 * This flag is cleared by writing 1.
 *
 * Values:
 * - 0 - Received packet is byte bound.
 * - 1 - Received packet is not byte bound.
 */
/*@{*/
#define BP_UART_S4_FE        (0U)          /*!< Bit position for UART_S4_FE. */
#define BM_UART_S4_FE        (0x01U)       /*!< Bit mask for UART_S4_FE. */
#define BS_UART_S4_FE        (1U)          /*!< Bit field size in bits for UART_S4_FE. */

/*! @brief Read current value of the UART_S4_FE field. */
#define BR_UART_S4_FE(x)     (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_FE))

/*! @brief Format value for bitfield UART_S4_FE. */
#define BF_UART_S4_FE(v)     ((uint8_t)((uint8_t)(v) << BP_UART_S4_FE) & BM_UART_S4_FE)

/*! @brief Set the FE field to a new value. */
#define BW_UART_S4_FE(x, v)  (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_FE) = (v))
/*@}*/

/*!
 * @name Register UART_S4, field ILCV[1] (RW)
 *
 * Indicates that line code violation received is not proper. This flag is
 * cleared by writing 1.
 *
 * Values:
 * - 0 - Line code violation received is proper.
 * - 1 - Line code violation received is improper, that is, less than three bit
 *     periods.
 */
/*@{*/
#define BP_UART_S4_ILCV      (1U)          /*!< Bit position for UART_S4_ILCV. */
#define BM_UART_S4_ILCV      (0x02U)       /*!< Bit mask for UART_S4_ILCV. */
#define BS_UART_S4_ILCV      (1U)          /*!< Bit field size in bits for UART_S4_ILCV. */

/*! @brief Read current value of the UART_S4_ILCV field. */
#define BR_UART_S4_ILCV(x)   (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_ILCV))

