theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*! @brief Format value for bitfield UART_S4_ILCV. */
#define BF_UART_S4_ILCV(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S4_ILCV) & BM_UART_S4_ILCV)

/*! @brief Set the ILCV field to a new value. */
#define BW_UART_S4_ILCV(x, v) (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_ILCV) = (v))
/*@}*/

/*!
 * @name Register UART_S4, field CDET[3:2] (RW)
 *
 * Indicates when the collision occurs during transmission. This flag is cleared
 * by writing 2'b11. If the collision flag is not cleared by software and a
 * valid collision pulse is detected during some other phase of transmission, then
 * collision flag continues to indicate the previous value.
 *
 * Values:
 * - 00 - No collision.
 * - 01 - Collision occurred during preamble.
 * - 10 - Collision occurred during data.
 * - 11 - Collision occurred during line code violation.
 */
/*@{*/
#define BP_UART_S4_CDET      (2U)          /*!< Bit position for UART_S4_CDET. */
#define BM_UART_S4_CDET      (0x0CU)       /*!< Bit mask for UART_S4_CDET. */
#define BS_UART_S4_CDET      (2U)          /*!< Bit field size in bits for UART_S4_CDET. */

/*! @brief Read current value of the UART_S4_CDET field. */
#define BR_UART_S4_CDET(x)   (HW_UART_S4(x).B.CDET)

/*! @brief Format value for bitfield UART_S4_CDET. */
#define BF_UART_S4_CDET(v)   ((uint8_t)((uint8_t)(v) << BP_UART_S4_CDET) & BM_UART_S4_CDET)

/*! @brief Set the CDET field to a new value. */
#define BW_UART_S4_CDET(x, v) (HW_UART_S4_WR(x, (HW_UART_S4_RD(x) & ~BM_UART_S4_CDET) | BF_UART_S4_CDET(v)))
/*@}*/

/*!
 * @name Register UART_S4, field INITF[4] (RO)
 *
 * Indicates that the initial synchronization has failed and the packet cycle
 * time has expired after enabling EN709 register. This flag is cleared if EN709 is
 * cleared.
 *
 * Values:
 * - 0 - Initial synchronization has not failed.
 * - 1 - Initial synchronization has failed.
 */
/*@{*/
#define BP_UART_S4_INITF     (4U)          /*!< Bit position for UART_S4_INITF. */
#define BM_UART_S4_INITF     (0x10U)       /*!< Bit mask for UART_S4_INITF. */
#define BS_UART_S4_INITF     (1U)          /*!< Bit field size in bits for UART_S4_INITF. */

/*! @brief Read current value of the UART_S4_INITF field. */
#define BR_UART_S4_INITF(x)  (BITBAND_ACCESS8(HW_UART_S4_ADDR(x), BP_UART_S4_INITF))
/*@}*/

/*******************************************************************************
 * HW_UART_RPL - UART CEA709.1-B Received Packet Length
 ******************************************************************************/

/*!
 * @brief HW_UART_RPL - UART CEA709.1-B Received Packet Length (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_rpl
{
    uint8_t U;
    struct _hw_uart_rpl_bitfields
    {
        uint8_t RPL : 8;               /*!< [7:0] Received Packet Length */
    } B;
} hw_uart_rpl_t;

/*!
 * @name Constants and macros for entire UART_RPL register
 */
/*@{*/
#define HW_UART_RPL_ADDR(x)      ((uint32_t)(x) + 0x2DU)

#define HW_UART_RPL(x)           (*(__I hw_uart_rpl_t *) HW_UART_RPL_ADDR(x))
#define HW_UART_RPL_RD(x)        (HW_UART_RPL(x).U)
/*@}*/

/*
 * Constants & macros for individual UART_RPL bitfields
 */

/*!
 * @name Register UART_RPL, field RPL[7:0] (RO)
 *
 * Indicates the length of received packet in bytes. If the received packet is
 * not byte aligned, the partial byte received is appended by zeros.
 */
/*@{*/
#define BP_UART_RPL_RPL      (0U)          /*!< Bit position for UART_RPL_RPL. */
#define BM_UART_RPL_RPL      (0xFFU)       /*!< Bit mask for UART_RPL_RPL. */
#define BS_UART_RPL_RPL      (8U)          /*!< Bit field size in bits for UART_RPL_RPL. */

/*! @brief Read current value of the UART_RPL_RPL field. */
#define BR_UART_RPL_RPL(x)   (HW_UART_RPL(x).U)
/*@}*/

/*******************************************************************************
 * HW_UART_RPREL - UART CEA709.1-B Received Preamble Length
 ******************************************************************************/

/*!
 * @brief HW_UART_RPREL - UART CEA709.1-B Received Preamble Length (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_rprel
{
    uint8_t U;
    struct _hw_uart_rprel_bitfields
    {
        uint8_t RPREL : 8;             /*!< [7:0] Received Preamble Length */
    } B;
} hw_uart_rprel_t;

/*!
 * @name Constants and macros for entire UART_RPREL register
 */
/*@{*/
#define HW_UART_RPREL_ADDR(x)    ((uint32_t)(x) + 0x2EU)

#define HW_UART_RPREL(x)         (*(__I hw_uart_rprel_t *) HW_UART_RPREL_ADDR(x))
#define HW_UART_RPREL_RD(x)      (HW_UART_RPREL(x).U)
/*@}*/

/*
 * Constants & macros for individual UART_RPREL bitfields
 */

/*!
 * @name Register UART_RPREL, field RPREL[7:0] (RO)
 *
 * Indicates the number of bit sync fields received in the preamble.
 */
/*@{*/
#define BP_UART_RPREL_RPREL  (0U)          /*!< Bit position for UART_RPREL_RPREL. */
#define BM_UART_RPREL_RPREL  (0xFFU)       /*!< Bit mask for UART_RPREL_RPREL. */
#define BS_UART_RPREL_RPREL  (8U)          /*!< Bit field size in bits for UART_RPREL_RPREL. */

/*! @brief Read current value of the UART_RPREL_RPREL field. */
#define BR_UART_RPREL_RPREL(x) (HW_UART_RPREL(x).U)
/*@}*/

/*******************************************************************************
 * HW_UART_CPW - UART CEA709.1-B Collision Pulse Width
 ******************************************************************************/

/*!
 * @brief HW_UART_CPW - UART CEA709.1-B Collision Pulse Width (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_cpw
{
    uint8_t U;
    struct _hw_uart_cpw_bitfields
    {
        uint8_t CPW : 8;               /*!< [7:0] CEA709.1-B CPW register */
    } B;
} hw_uart_cpw_t;

/*!
 * @name Constants and macros for entire UART_CPW register
 */
/*@{*/
#define HW_UART_CPW_ADDR(x)      ((uint32_t)(x) + 0x2FU)

#define HW_UART_CPW(x)           (*(__IO hw_uart_cpw_t *) HW_UART_CPW_ADDR(x))
#define HW_UART_CPW_RD(x)        (HW_UART_CPW(x).U)
#define HW_UART_CPW_WR(x, v)     (HW_UART_CPW(x).U = (v))
#define HW_UART_CPW_SET(x, v)    (HW_UART_CPW_WR(x, HW_UART_CPW_RD(x) |  (v)))
#define HW_UART_CPW_CLR(x, v)    (HW_UART_CPW_WR(x, HW_UART_CPW_RD(x) & ~(v)))
#define HW_UART_CPW_TOG(x, v)    (HW_UART_CPW_WR(x, HW_UART_CPW_RD(x) ^  (v)))
/*@}*/

