theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual UART_CPW bitfields
 */

/*!
 * @name Register UART_CPW, field CPW[7:0] (RW)
 *
 * Indicates the width of valid collision pulse in terms of IPG clock cycles.
 */
/*@{*/
#define BP_UART_CPW_CPW      (0U)          /*!< Bit position for UART_CPW_CPW. */
#define BM_UART_CPW_CPW      (0xFFU)       /*!< Bit mask for UART_CPW_CPW. */
#define BS_UART_CPW_CPW      (8U)          /*!< Bit field size in bits for UART_CPW_CPW. */

/*! @brief Read current value of the UART_CPW_CPW field. */
#define BR_UART_CPW_CPW(x)   (HW_UART_CPW(x).U)

/*! @brief Format value for bitfield UART_CPW_CPW. */
#define BF_UART_CPW_CPW(v)   ((uint8_t)((uint8_t)(v) << BP_UART_CPW_CPW) & BM_UART_CPW_CPW)

/*! @brief Set the CPW field to a new value. */
#define BW_UART_CPW_CPW(x, v) (HW_UART_CPW_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_RIDT - UART CEA709.1-B Receive Indeterminate Time
 ******************************************************************************/

/*!
 * @brief HW_UART_RIDT - UART CEA709.1-B Receive Indeterminate Time (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_ridt
{
    uint8_t U;
    struct _hw_uart_ridt_bitfields
    {
        uint8_t RIDT : 8;              /*!< [7:0] CEA709.1-B Receive IDT register */
    } B;
} hw_uart_ridt_t;

/*!
 * @name Constants and macros for entire UART_RIDT register
 */
/*@{*/
#define HW_UART_RIDT_ADDR(x)     ((uint32_t)(x) + 0x30U)

#define HW_UART_RIDT(x)          (*(__IO hw_uart_ridt_t *) HW_UART_RIDT_ADDR(x))
#define HW_UART_RIDT_RD(x)       (HW_UART_RIDT(x).U)
#define HW_UART_RIDT_WR(x, v)    (HW_UART_RIDT(x).U = (v))
#define HW_UART_RIDT_SET(x, v)   (HW_UART_RIDT_WR(x, HW_UART_RIDT_RD(x) |  (v)))
#define HW_UART_RIDT_CLR(x, v)   (HW_UART_RIDT_WR(x, HW_UART_RIDT_RD(x) & ~(v)))
#define HW_UART_RIDT_TOG(x, v)   (HW_UART_RIDT_WR(x, HW_UART_RIDT_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_RIDT bitfields
 */

/*!
 * @name Register UART_RIDT, field RIDT[7:0] (RW)
 *
 * Indicates the indeterminate time period after reception during which any
 * activity on RX line will be discarded. Indeterminate time period value should be
 * less than Beta1 timer value.
 */
/*@{*/
#define BP_UART_RIDT_RIDT    (0U)          /*!< Bit position for UART_RIDT_RIDT. */
#define BM_UART_RIDT_RIDT    (0xFFU)       /*!< Bit mask for UART_RIDT_RIDT. */
#define BS_UART_RIDT_RIDT    (8U)          /*!< Bit field size in bits for UART_RIDT_RIDT. */

/*! @brief Read current value of the UART_RIDT_RIDT field. */
#define BR_UART_RIDT_RIDT(x) (HW_UART_RIDT(x).U)

/*! @brief Format value for bitfield UART_RIDT_RIDT. */
#define BF_UART_RIDT_RIDT(v) ((uint8_t)((uint8_t)(v) << BP_UART_RIDT_RIDT) & BM_UART_RIDT_RIDT)

/*! @brief Set the RIDT field to a new value. */
#define BW_UART_RIDT_RIDT(x, v) (HW_UART_RIDT_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_UART_TIDT - UART CEA709.1-B Transmit Indeterminate Time
 ******************************************************************************/

/*!
 * @brief HW_UART_TIDT - UART CEA709.1-B Transmit Indeterminate Time (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_uart_tidt
{
    uint8_t U;
    struct _hw_uart_tidt_bitfields
    {
        uint8_t TIDT : 8;              /*!< [7:0] CEA709.1-B Transmit IDT Register */
    } B;
} hw_uart_tidt_t;

/*!
 * @name Constants and macros for entire UART_TIDT register
 */
/*@{*/
#define HW_UART_TIDT_ADDR(x)     ((uint32_t)(x) + 0x31U)

#define HW_UART_TIDT(x)          (*(__IO hw_uart_tidt_t *) HW_UART_TIDT_ADDR(x))
#define HW_UART_TIDT_RD(x)       (HW_UART_TIDT(x).U)
#define HW_UART_TIDT_WR(x, v)    (HW_UART_TIDT(x).U = (v))
#define HW_UART_TIDT_SET(x, v)   (HW_UART_TIDT_WR(x, HW_UART_TIDT_RD(x) |  (v)))
#define HW_UART_TIDT_CLR(x, v)   (HW_UART_TIDT_WR(x, HW_UART_TIDT_RD(x) & ~(v)))
#define HW_UART_TIDT_TOG(x, v)   (HW_UART_TIDT_WR(x, HW_UART_TIDT_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual UART_TIDT bitfields
 */

/*!
 * @name Register UART_TIDT, field TIDT[7:0] (RW)
 *
 * This register indicates the indeterminate time period after transmission
 * during which any activity on TX line will be discarded. Indeterminate time period
 * value should be less than Beta1 timer value.
 */
/*@{*/
#define BP_UART_TIDT_TIDT    (0U)          /*!< Bit position for UART_TIDT_TIDT. */
#define BM_UART_TIDT_TIDT    (0xFFU)       /*!< Bit mask for UART_TIDT_TIDT. */
#define BS_UART_TIDT_TIDT    (8U)          /*!< Bit field size in bits for UART_TIDT_TIDT. */

/*! @brief Read current value of the UART_TIDT_TIDT field. */
#define BR_UART_TIDT_TIDT(x) (HW_UART_TIDT(x).U)

/*! @brief Format value for bitfield UART_TIDT_TIDT. */
#define BF_UART_TIDT_TIDT(v) ((uint8_t)((uint8_t)(v) << BP_UART_TIDT_TIDT) & BM_UART_TIDT_TIDT)

/*! @brief Set the TIDT field to a new value. */
#define BW_UART_TIDT_TIDT(x, v) (HW_UART_TIDT_WR(x, v))
/*@}*/

/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma push
  #pragma anon_unions
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/*******************************************************************************
 * hw_uart_t - module struct
 ******************************************************************************/
/*!
 * @brief All UART module registers.
 */
#pragma pack(1)
typedef struct _hw_uart
{
    __IO hw_uart_bdh_t BDH;                /*!< [0x0] UART Baud Rate Registers: High */
    __IO hw_uart_bdl_t BDL;                /*!< [0x1] UART Baud Rate Registers: Low */
    __IO hw_uart_c1_t C1;                  /*!< [0x2] UART Control Register 1 */
    __IO hw_uart_c2_t C2;                  /*!< [0x3] UART Control Register 2 */
    __I hw_uart_s1_t S1;                   /*!< [0x4] UART Status Register 1 */
    __IO hw_uart_s2_t S2;                  /*!< [0x5] UART Status Register 2 */
    __IO hw_uart_c3_t C3;                  /*!< [0x6] UART Control Register 3 */
    __IO hw_uart_d_t D;                    /*!< [0x7] UART Data Register */
    __IO hw_uart_ma1_t MA1;                /*!< [0x8] UART Match Address Registers 1 */
    __IO hw_uart_ma2_t MA2;                /*!< [0x9] UART Match Address Registers 2 */
    __IO hw_uart_c4_t C4;                  /*!< [0xA] UART Control Register 4 */
    __IO hw_uart_c5_t C5;                  /*!< [0xB] UART Control Register 5 */
    __I hw_uart_ed_t ED;                   /*!< [0xC] UART Extended Data Register */
    __IO hw_uart_modem_t MODEM;            /*!< [0xD] UART Modem Register */
    __IO hw_uart_ir_t IR;                  /*!< [0xE] UART Infrared Register */
    uint8_t _reserved0[1];
    __IO hw_uart_pfifo_t PFIFO;            /*!< [0x10] UART FIFO Parameters */
    __IO hw_uart_cfifo_t CFIFO;            /*!< [0x11] UART FIFO Control Register */
    __IO hw_uart_sfifo_t SFIFO;            /*!< [0x12] UART FIFO Status Register */
    __IO hw_uart_twfifo_t TWFIFO;          /*!< [0x13] UART FIFO Transmit Watermark */
    __I hw_uart_tcfifo_t TCFIFO;           /*!< [0x14] UART FIFO Transmit Count */
    __IO hw_uart_rwfifo_t RWFIFO;          /*!< [0x15] UART FIFO Receive Watermark */
    __I hw_uart_rcfifo_t RCFIFO;           /*!< [0x16] UART FIFO Receive Count */
    uint8_t _reserved1[1];
    __IO hw_uart_c7816_t C7816;            /*!< [0x18] UART 7816 Control Register */
    __IO hw_uart_ie7816_t IE7816;          /*!< [0x19] UART 7816 Interrupt Enable Register */
    __IO hw_uart_is7816_t IS7816;          /*!< [0x1A] UART 7816 Interrupt Status Register */
    union {
        __IO hw_uart_wp7816t0_t WP7816T0;  /*!< [0x1B] UART 7816 Wait Parameter Register */
        __IO hw_uart_wp7816t1_t WP7816T1;  /*!< [0x1B] UART 7816 Wait Parameter Register */
    };
    __IO hw_uart_wn7816_t WN7816;          /*!< [0x1C] UART 7816 Wait N Register */
    __IO hw_uart_wf7816_t WF7816;          /*!< [0x1D] UART 7816 Wait FD Register */
    __IO hw_uart_et7816_t ET7816;          /*!< [0x1E] UART 7816 Error Threshold Register */
    __IO hw_uart_tl7816_t TL7816;          /*!< [0x1F] UART 7816 Transmit Length Register */
    uint8_t _reserved2[1];
    __IO hw_uart_c6_t C6;                  /*!< [0x21] UART CEA709.1-B Control Register 6 */
    __IO hw_uart_pcth_t PCTH;              /*!< [0x22] UART CEA709.1-B Packet Cycle Time Counter High */
    __IO hw_uart_pctl_t PCTL;              /*!< [0x23] UART CEA709.1-B Packet Cycle Time Counter Low */
    __IO hw_uart_b1t_t B1T;                /*!< [0x24] UART CEA709.1-B Beta1 Timer */
    __IO hw_uart_sdth_t SDTH;              /*!< [0x25] UART CEA709.1-B Secondary Delay Timer High */
    __IO hw_uart_sdtl_t SDTL;              /*!< [0x26] UART CEA709.1-B Secondary Delay Timer Low */
    __IO hw_uart_pre_t PRE;                /*!< [0x27] UART CEA709.1-B Preamble */
    __IO hw_uart_tpl_t TPL;                /*!< [0x28] UART CEA709.1-B Transmit Packet Length */
    __IO hw_uart_ie_t IE;                  /*!< [0x29] UART CEA709.1-B Interrupt Enable Register */
    __IO hw_uart_wb_t WB;                  /*!< [0x2A] UART CEA709.1-B WBASE */
    __IO hw_uart_s3_t S3;                  /*!< [0x2B] UART CEA709.1-B Status Register */
    __IO hw_uart_s4_t S4;                  /*!< [0x2C] UART CEA709.1-B Status Register */
    __I hw_uart_rpl_t RPL;                 /*!< [0x2D] UART CEA709.1-B Received Packet Length */
    __I hw_uart_rprel_t RPREL;             /*!< [0x2E] UART CEA709.1-B Received Preamble Length */
    __IO hw_uart_cpw_t CPW;                /*!< [0x2F] UART CEA709.1-B Collision Pulse Width */
    __IO hw_uart_ridt_t RIDT;              /*!< [0x30] UART CEA709.1-B Receive Indeterminate Time */
    __IO hw_uart_tidt_t TIDT;              /*!< [0x31] UART CEA709.1-B Transmit Indeterminate Time */
} hw_uart_t;
#pragma pack()

/*! @brief Macro to access all UART registers. */
/*! @param x UART module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_UART_REGS(UART0_BASE)</code>. */
#define HW_UART_REGS(x) (*(hw_uart_t *)(x))

