theatrus/ksdk/platform/CMSIS/Include/device/MK60D10/MK60D10_registers.h
/*
 * Constants & macros for individual USBDCD_TIMER1 bitfields
 */

/*!
 * @name Register USBDCD_TIMER1, field TVDPSRC_ON[9:0] (RW)
 *
 * This timing parameter is used after detection of the data pin. See "Charging
 * Port Detection". Valid values are 1-1023, but the USB Battery Charging
 * Specification requires a minimum value of 40 ms.
 */
/*@{*/
#define BP_USBDCD_TIMER1_TVDPSRC_ON (0U)   /*!< Bit position for USBDCD_TIMER1_TVDPSRC_ON. */
#define BM_USBDCD_TIMER1_TVDPSRC_ON (0x000003FFU) /*!< Bit mask for USBDCD_TIMER1_TVDPSRC_ON. */
#define BS_USBDCD_TIMER1_TVDPSRC_ON (10U)  /*!< Bit field size in bits for USBDCD_TIMER1_TVDPSRC_ON. */

/*! @brief Read current value of the USBDCD_TIMER1_TVDPSRC_ON field. */
#define BR_USBDCD_TIMER1_TVDPSRC_ON(x) (HW_USBDCD_TIMER1(x).B.TVDPSRC_ON)

/*! @brief Format value for bitfield USBDCD_TIMER1_TVDPSRC_ON. */
#define BF_USBDCD_TIMER1_TVDPSRC_ON(v) ((uint32_t)((uint32_t)(v) << BP_USBDCD_TIMER1_TVDPSRC_ON) & BM_USBDCD_TIMER1_TVDPSRC_ON)

/*! @brief Set the TVDPSRC_ON field to a new value. */
#define BW_USBDCD_TIMER1_TVDPSRC_ON(x, v) (HW_USBDCD_TIMER1_WR(x, (HW_USBDCD_TIMER1_RD(x) & ~BM_USBDCD_TIMER1_TVDPSRC_ON) | BF_USBDCD_TIMER1_TVDPSRC_ON(v)))
/*@}*/

/*!
 * @name Register USBDCD_TIMER1, field TDCD_DBNC[25:16] (RW)
 *
 * Sets the time period (ms) to debounce the D+ signal during the data pin
 * contact detection phase. See "Debouncing the data pin contact" Valid values are
 * 1-1023, but the USB Battery Charging Specification requires a minimum value of 10
 * ms.
 */
/*@{*/
#define BP_USBDCD_TIMER1_TDCD_DBNC (16U)   /*!< Bit position for USBDCD_TIMER1_TDCD_DBNC. */
#define BM_USBDCD_TIMER1_TDCD_DBNC (0x03FF0000U) /*!< Bit mask for USBDCD_TIMER1_TDCD_DBNC. */
#define BS_USBDCD_TIMER1_TDCD_DBNC (10U)   /*!< Bit field size in bits for USBDCD_TIMER1_TDCD_DBNC. */

/*! @brief Read current value of the USBDCD_TIMER1_TDCD_DBNC field. */
#define BR_USBDCD_TIMER1_TDCD_DBNC(x) (HW_USBDCD_TIMER1(x).B.TDCD_DBNC)

/*! @brief Format value for bitfield USBDCD_TIMER1_TDCD_DBNC. */
#define BF_USBDCD_TIMER1_TDCD_DBNC(v) ((uint32_t)((uint32_t)(v) << BP_USBDCD_TIMER1_TDCD_DBNC) & BM_USBDCD_TIMER1_TDCD_DBNC)

/*! @brief Set the TDCD_DBNC field to a new value. */
#define BW_USBDCD_TIMER1_TDCD_DBNC(x, v) (HW_USBDCD_TIMER1_WR(x, (HW_USBDCD_TIMER1_RD(x) & ~BM_USBDCD_TIMER1_TDCD_DBNC) | BF_USBDCD_TIMER1_TDCD_DBNC(v)))
/*@}*/

/*******************************************************************************
 * HW_USBDCD_TIMER2 - TIMER2 register
 ******************************************************************************/

/*!
 * @brief HW_USBDCD_TIMER2 - TIMER2 register (RW)
 *
 * Reset value: 0x00280001U
 *
 * TIMER2 contains timing parameters. Register values can be written that are
 * not compliant with the USB Battery Charging Specification v1.1, so care should
 * be taken when overwriting the default values.
 */
typedef union _hw_usbdcd_timer2
{
    uint32_t U;
    struct _hw_usbdcd_timer2_bitfields
    {
        uint32_t CHECK_DM : 4;         /*!< [3:0] Time Before Check of D- Line */
        uint32_t RESERVED0 : 12;       /*!< [15:4]  */
        uint32_t TVDPSRC_CON : 10;     /*!< [25:16] Time Period Before Enabling
                                        * D+ Pullup */
        uint32_t RESERVED1 : 6;        /*!< [31:26]  */
    } B;
} hw_usbdcd_timer2_t;

/*!
 * @name Constants and macros for entire USBDCD_TIMER2 register
 */
/*@{*/
#define HW_USBDCD_TIMER2_ADDR(x) ((uint32_t)(x) + 0x18U)

#define HW_USBDCD_TIMER2(x)      (*(__IO hw_usbdcd_timer2_t *) HW_USBDCD_TIMER2_ADDR(x))
#define HW_USBDCD_TIMER2_RD(x)   (HW_USBDCD_TIMER2(x).U)
#define HW_USBDCD_TIMER2_WR(x, v) (HW_USBDCD_TIMER2(x).U = (v))
#define HW_USBDCD_TIMER2_SET(x, v) (HW_USBDCD_TIMER2_WR(x, HW_USBDCD_TIMER2_RD(x) |  (v)))
#define HW_USBDCD_TIMER2_CLR(x, v) (HW_USBDCD_TIMER2_WR(x, HW_USBDCD_TIMER2_RD(x) & ~(v)))
#define HW_USBDCD_TIMER2_TOG(x, v) (HW_USBDCD_TIMER2_WR(x, HW_USBDCD_TIMER2_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER2 bitfields
 */

/*!
 * @name Register USBDCD_TIMER2, field CHECK_DM[3:0] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after the device
 * connects to the USB bus until checking the state of the D- line to determine the
 * type of charging port. See "Charger Type Detection." Valid values are 1-15ms.
 */
/*@{*/
#define BP_USBDCD_TIMER2_CHECK_DM (0U)     /*!< Bit position for USBDCD_TIMER2_CHECK_DM. */
#define BM_USBDCD_TIMER2_CHECK_DM (0x0000000FU) /*!< Bit mask for USBDCD_TIMER2_CHECK_DM. */
#define BS_USBDCD_TIMER2_CHECK_DM (4U)     /*!< Bit field size in bits for USBDCD_TIMER2_CHECK_DM. */

/*! @brief Read current value of the USBDCD_TIMER2_CHECK_DM field. */
#define BR_USBDCD_TIMER2_CHECK_DM(x) (HW_USBDCD_TIMER2(x).B.CHECK_DM)

/*! @brief Format value for bitfield USBDCD_TIMER2_CHECK_DM. */
#define BF_USBDCD_TIMER2_CHECK_DM(v) ((uint32_t)((uint32_t)(v) << BP_USBDCD_TIMER2_CHECK_DM) & BM_USBDCD_TIMER2_CHECK_DM)

/*! @brief Set the CHECK_DM field to a new value. */
#define BW_USBDCD_TIMER2_CHECK_DM(x, v) (HW_USBDCD_TIMER2_WR(x, (HW_USBDCD_TIMER2_RD(x) & ~BM_USBDCD_TIMER2_CHECK_DM) | BF_USBDCD_TIMER2_CHECK_DM(v)))
/*@}*/

/*!
 * @name Register USBDCD_TIMER2, field TVDPSRC_CON[25:16] (RW)
 *
 * Sets the time period (ms) that the module waits after charging port detection
 * before system software must enable the D+ pullup to connect to the USB host.
 * Valid values are 1-1023, but the USB Battery Charging Specification requires a
 * minimum value of 40 ms.
 */
/*@{*/
#define BP_USBDCD_TIMER2_TVDPSRC_CON (16U) /*!< Bit position for USBDCD_TIMER2_TVDPSRC_CON. */
#define BM_USBDCD_TIMER2_TVDPSRC_CON (0x03FF0000U) /*!< Bit mask for USBDCD_TIMER2_TVDPSRC_CON. */
#define BS_USBDCD_TIMER2_TVDPSRC_CON (10U) /*!< Bit field size in bits for USBDCD_TIMER2_TVDPSRC_CON. */

/*! @brief Read current value of the USBDCD_TIMER2_TVDPSRC_CON field. */
#define BR_USBDCD_TIMER2_TVDPSRC_CON(x) (HW_USBDCD_TIMER2(x).B.TVDPSRC_CON)

/*! @brief Format value for bitfield USBDCD_TIMER2_TVDPSRC_CON. */
#define BF_USBDCD_TIMER2_TVDPSRC_CON(v) ((uint32_t)((uint32_t)(v) << BP_USBDCD_TIMER2_TVDPSRC_CON) & BM_USBDCD_TIMER2_TVDPSRC_CON)

/*! @brief Set the TVDPSRC_CON field to a new value. */
#define BW_USBDCD_TIMER2_TVDPSRC_CON(x, v) (HW_USBDCD_TIMER2_WR(x, (HW_USBDCD_TIMER2_RD(x) & ~BM_USBDCD_TIMER2_TVDPSRC_CON) | BF_USBDCD_TIMER2_TVDPSRC_CON(v)))
/*@}*/

